[
  {
    "author": "grendelt",
    "text": "That cable hack job. :twitch:",
    "children": [
      {
        "author": "edent",
        "text": "Hey, it worked! But, yeah, I need to learn how to solder",
        "children": [
          {
            "author": "Relys",
            "text": "If you really don't feel like doing through-hole soldering to the board you could at least use:\nhttps://en.wikipedia.org/wiki/Crimp_(joining)\nhttps://en.wikipedia.org/wiki/Electrical_tapeI just don't want to see you burn your house down! :p",
            "children": []
          },
          {
            "author": "hamitron",
            "text": "http://makezine.com/2012/02/28/how-to-splice-wire-to-nasa-st...",
            "children": [
              {
                "author": "miahi",
                "text": "I saw a lot of this splicing type in old military radio transceivers (\"portable\" for a given value of portable - usually some kind of backpack weighting ~30Kg - and the batteries were in another backpack).That splicing works for solid-core conductors, but it doesn't have the same strength on stranded wire, as it is more flexible. It could work on tinned thin stranded wire (as it makes a kindof-solid wire) but if you tin it then you can just solder it and that's it. The referenced standard[1] also contains the splicing for stranded wire, and some requirements about when and how to use each.[1] http://www.hq.nasa.gov/office/codeq/doctree/87394.pdf",
                "children": []
              },
              {
                "author": "hatsunearu",
                "text": "If you haven't noticed already, you are now aware that the two intertwined wires in the second and third section of that illustration is topologically impossible.It's a pretty darn good technique though, useful when your wire harness is going through some minor tension. Extensively used during our underwater robot build :)",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "author": "hayksaakian",
    "text": "i know nothing of electronics really, but doesn't the google chromecast get power over hdmi? maybe there's some way to do that with this hack?",
    "children": [
      {
        "author": "agumonkey",
        "text": "AFAIK chromecast and other HDMI dongles have secondary USB port to get power.",
        "children": [
          {
            "author": "GauntletWizard",
            "text": "It's technically possible, but supported on so few devices it's not worth the extra circuitry, I assume.",
            "children": []
          },
          {
            "author": "rzzzt",
            "text": "According to this Q&A, about 55-150 mA is available on a 5V line: http://www.hdmi.org/learningcenter/kb.aspx?c=13#42",
            "children": [
              {
                "author": "bduerst",
                "text": "Yep - the chromecast pulls too much juice (up to 1A) for the HDMI power spec.1A would be the sweet spot for future HDMI specs.",
                "children": []
              },
              {
                "author": "agumonkey",
                "text": "Oh I didn't know it was in spec. Also, it's just in range for a pi zero. How convenient.",
                "children": [
                  {
                    "author": "bduerst",
                    "text": "The USB-powered XBox controller is going to need another 300 mA.I also don't think the pi zero has a powerable HDMI adaptor.",
                    "children": [
                      {
                        "author": "agumonkey",
                        "text": "I had a pi zero hdmi dongle in mind without a supplementary usb cable.",
                        "children": [
                          {
                            "author": "MiguelHudnandez",
                            "text": "An on-board battery or capacitor could help to smooth out brief high power tasks, but I don't think it will be able to sustain video decoding & playback at a constant supply of 150mA. I'm really excited for that to be a possibility though, so I hope I'm wrong.Of course, some TVs might dump a lot more current over the connection, just like what was common with USB 2.0 going well over 500mA.",
                            "children": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              },
              {
                "author": "mikepavone",
                "text": "That's on source devices, which in this case would be the Pi Zero. AFAIK, sink devices like a TV do not supply power.",
                "children": [
                  {
                    "author": "rzzzt",
                    "text": "I somehow managed to miss the sentence entirely where this is explained (it is used for reading EDID from a connected display). Thanks for the correction!",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "johnward",
        "text": "Chromecast requires external power. Google's advertising of it is misleading.",
        "children": [
          {
            "author": "Spivak",
            "text": "Edit: I'm an idiot. You're right, I must have been thinking of CEC.",
            "children": []
          },
          {
            "author": "moftz",
            "text": "I've never seen any Chromecast advertising that implies it only gets power over HDMI. All of the media on Google's Chromecast site show either both HDMI/Aux and USB plugged in or nothing plugged in. Pretty much any TV now has a USB port whether it be for media playback or for updating the firmware of the TV on older ones so its not a huge deal to have to plug it.Even the first release of the device clearly mentioned it needing USB power. https://www.youtube.com/watch?v=YRu18f2GRQo&t=41m22s",
            "children": [
              {
                "author": "johnward",
                "text": "All of the screenshots I saw before purchasing the original device clearly showed it plugged into a TV with no power cord attached. It looks like they may have fixed it in the newer marketing.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "edent",
        "text": "Nah. They rely on the fact that most modern TVs have a USB port near the HDMI ports. That usually provides enough juice.",
        "children": []
      },
      {
        "author": "guyzero",
        "text": "Meaning power over HDMI is only provided when the TV supports MHL which most TVs don't support.",
        "children": []
      },
      {
        "author": "CaptSpify",
        "text": "I know the rpi2 gets power over hdmi, not sure about the zero though",
        "children": []
      }
    ]
  },
  {
    "author": "electricblue",
    "text": "I don't really see a use for this but I agree with your ending point about computers being snuck into all sorts of things for little or no cost is very exciting.",
    "children": [
      {
        "author": "vlunkr",
        "text": "The use is for a super portable game console. As you can see from all his links lots of people are interested in this type of thing.http://blog.petrockblock.com/retropie/. That's a project that sets up a whole bunch of emulators and stuff to get you started if anyone is interested.",
        "children": [
          {
            "author": "electricblue",
            "text": "I've used retropie but if I still gotta use HDMI TV I'd rather the console be hidden behind the TV. Just my personal preference though.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "bduerst",
    "text": "It would be cool if they loaded Android onto the pi zero, and then used chromecast with their apps/games.Not sure about the USB XBox controller support on Android though.",
    "children": [
      {
        "author": "edent",
        "text": "I briefly plugged it in to an Android to check the cable worked. lsusb detected it, but I didn't have a chance to test any games directly on the phone.",
        "children": [
          {
            "author": "bduerst",
            "text": "I wonder what the latency is on the new chromecasts.  I've heard it's about 10ms (just for display) but it would be worth testing with a stop watch app.",
            "children": []
          }
        ]
      },
      {
        "author": "yincrash",
        "text": "The android would work with the controller if the xpad kernel module[1] is built with the ROM.[1] https://www.kernel.org/doc/Documentation/input/xpad.txt",
        "children": []
      }
    ]
  },
  {
    "author": "orliesaurus",
    "text": "wow Terence has done it again!",
    "children": []
  },
  {
    "author": "danesparza",
    "text": "His parting comments on a portable mesh network are not fiction.  Here is some interesting software that already exists: http://www.netlore.co.uk/airmesh/?page=about",
    "children": [
      {
        "author": "IshKebab",
        "text": "Not battery powered though. A battery powered mesh network is still not really doable.",
        "children": [
          {
            "author": "awqrre",
            "text": "Even if you plug it in your Tesla battery?",
            "children": []
          },
          {
            "author": "sdrothrock",
            "text": "Depends on the kind of mesh you're talking about. Linear Technologies has a mesh network with motes that can be battery-powered for years.",
            "children": []
          },
          {
            "author": "vanderZwan",
            "text": "Does this count?http://www.servalproject.org/",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "logicallee",
    "text": "I'll just leave this here - http://yachtpals.com/files/news/boat-wiring-connect.jpg (western union splice, no soldering required.)I don't normally complain but his splice is painful - it will come undone if anyone is so much as in the same house as it.",
    "children": []
  },
  {
    "author": "ryangittins",
    "text": "Wow, what a great post!  This is just incredible.  It makes you realize how much the world has changed and how much more change we're going to see in the near future.  Props to you, Terence.",
    "children": []
  },
  {
    "author": "garrettgrimsley",
    "text": "Since the site is beginning to struggle:https://web.archive.org/web/20151201211146/https://shkspr.mo...Mirror. Cache.",
    "children": []
  },
  {
    "author": "haberman",
    "text": "Very cool.  Another fun project would be loading up the Pi with speed run controller input so you could pretend to be superhuman at video games.",
    "children": []
  }
]