[
  {
    "author": "prezjordan",
    "text": "> We will give 99% of our Facebook shares -- currently about $45 billion -- during our lives to advance this mission. We know this is a small contribution compared to all the resources and talents of those already working on these issues. But we want to do what we can, working alongside many others.Ninety. Nine. Percent.",
    "children": [
      {
        "author": "anonu",
        "text": "Crazy. Even crazier when you realize that that 1% is $450 million....",
        "children": [
          {
            "author": "gordon_freeman",
            "text": "so Max will still be (half) a billionaire once she grows up.",
            "children": [
              {
                "author": "fla",
                "text": "Mr. Zuckerberg probably has other assets ;)",
                "children": []
              },
              {
                "author": "Shengbo",
                "text": "So much for the three comma club.",
                "children": []
              },
              {
                "author": "goatforce5",
                "text": "Assuming Facebook maintains it's valuation.Empires grow and empires crumble.",
                "children": [
                  {
                    "author": "ceejayoz",
                    "text": "Chances are at least 1% of their wealth will be put into something stable. Index funds, bonds, treasuries. Hell, cash'd be fine.",
                    "children": [
                      {
                        "author": "clock_tower",
                        "text": "Indeed. Bill Gates owns a railroad in Wisconsin, for example.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "author": "nandemo",
                "text": "She'll be way richer than that.They'll donate 99% of their shares along their lifetimes. In the meantime, they'll get cash in several ways: dividends, salaries, bonuses, etc.",
                "children": [
                  {
                    "author": "gordon_freeman",
                    "text": "Zuck takes only $1 as salary btw from facebook.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "author": "nsxwolf",
            "text": "So she'll be OK. Hope I'll still be able to take care of my kids after Zuckerberg unleashes the flood of H1Bs to lower my salary.",
            "children": []
          }
        ]
      },
      {
        "author": "myth_buster",
        "text": "Now I don't feel too bad about Fb snubbing Telegram. /sI'm curious how they plan to liquidate that shares as it will have quite some effect on the dynamics of Fb and on this:  I will continue to serve as Facebook's CEO for many, many years to come",
        "children": [
          {
            "author": "hkmurakami",
            "text": "Pledge during lifetime means that they have the flexibility to do the bulk of the liquidation during the latter years of their lives, when perhaps he has assumed only Chairman responsibilities.Also, you can get loans at very low rates by putting shares into collateral. This is how Larry Ellison funds much of his endeavors.",
            "children": []
          }
        ]
      },
      {
        "author": "Cshelton",
        "text": "Keep in mind that it is of the Facebook shares value, not net worth. \nAlthough admirable, it is not apart of the Bill and Melinda Gates pledge that many billionaires (notably, Buffet) have taken of giving away half of their new worth before they die.Anyway though, it's still a lot. And I hope they follow what other billionaires have been doing; not just throwing it at charities, but putting it into research and even funding entirely new projects.Funding startups and research labs that have no economic goal or an economic return to shareholders is something that is very needed. I see much of the funding coming from this.",
        "children": [
          {
            "author": "nugget",
            "text": "How much does he have outside of Facebook shares?  A billion or two?  So it's still >90% of net worth.",
            "children": []
          },
          {
            "author": "hkmurakami",
            "text": ">Anyway though, it's still a lot. And I hope they follow what other billionaires have been doing; not just throwing it at charities, but putting it into research and even funding entirely new projects.You might be interested in reading about Chuck Feeney (the founder of Duty Free Stores), who was the original guy advocating for such hands-on charitable work.",
            "children": []
          },
          {
            "author": "Arjuna",
            "text": "\"Although admirable, it is not apart of the Bill and Melinda Gates pledge that many billionaires (notably, Buffet) have taken of giving away half of their new worth before they die.\"Are you referring to The Giving Pledge [1]? Both Mark and Priscilla have signed it [2]:\"We salute the Giving Pledge movement, and are proud to be part of its declaration that those who have been fortunate should give back at least half of their wealth during their lifetimes.\"[1] https://en.wikipedia.org/wiki/The_Giving_Pledge[2] http://givingpledge.org/pdf/pledge-letters/Zuckerberg_Letter...",
            "children": []
          }
        ]
      },
      {
        "author": "nextos",
        "text": "I think his point of \"We must make long term investments over 25, 50 or even 100 years. The greatest challenges require very long time horizons and cannot be solved by short term thinking.\" is extremely important.As someone doing research at a top university, I am constantly annoyed by short term vision and optimizing for publication number at all costs. This system is broken.Alfred Sanger got 2 Nobel Prizes, and he spent a lot of time without publishing before each. Clearly something impossible to do these days.",
        "children": [
          {
            "author": "myth_buster",
            "text": "And on the other hand we have the public companies, lacking strong leadership, forced to look at quarterly returns.",
            "children": []
          },
          {
            "author": "throwaway999888",
            "text": "Is _top_ university an important distinction in this context?",
            "children": [
              {
                "author": "huac",
                "text": "Implication is competition is paramount - both level and quality of output",
                "children": []
              },
              {
                "author": "Cookingboy",
                "text": "It actually is in my opinion. If the top, elite research institutes show these kind of problem, then we can expect it to be very prevalent in the rest of the field as well. As in, this isn't some no name low tier school run by mediocre people.",
                "children": [
                  {
                    "author": "kuschku",
                    "text": "Actually, I’d say it’s the opposite.\"Top\" \"Elite\" universities are usually optimized for their metric – which is the Shanghai index, which is based on number of publications in english-language magazines.In countries outside of the Anglosphere often research at universities can go a lot slower, as they have no chance in the Shanghai index anyway.The Fraunhofer institute has, in cooperation with Sony, VW and Mercedes, worked on self driving cars since 2002. Sometimes you just have to throw a few million euro and a few decades onto a project to get some results.",
                    "children": []
                  }
                ]
              },
              {
                "author": "nextos",
                "text": "It was just to highlight that things are broken even at the top. I've worked all the way from a relatively small institution and I've found little correlation between long term vision and institution ranking, which is quite surprising.",
                "children": []
              }
            ]
          },
          {
            "author": "resu_nimda",
            "text": "If you're not already familiar, you might be interested in the Long Now. \"The Long Now Foundation hopes to provide a counterpoint to today's accelerating culture and help make long-term thinking more common. We hope to creatively foster responsibility in the framework of the next 10,000 years.\"http://longnow.org/",
            "children": []
          },
          {
            "author": "sjg007",
            "text": "Well there are more research institutions competing for the same dollars so the only way they can differentiate is based on publications. A lot of science is derivative and collaborative.  Most important though it needs to be reproducible.  Starting there is priority #1.",
            "children": []
          }
        ]
      },
      {
        "author": "austenallred",
        "text": "I mean, what else are you going to do with $45 Billion? Build a really big house?I've had the opportunity to rub shoulders with a few billionaires over the past few weeks, and it's remarkable how differently they think about money than the people who don't have it. Sure, they may buy a nice car (or jet), but after a certain level the only thing you can do with that kind of money is plug it back into something meaningful.Hats off to Zuck and the other people who try to turn their success into something even greater than, well, their success.",
        "children": [
          {
            "author": "AndrewKemendo",
            "text": ">I mean, what else are you going to do with $45 Billion?You are thinking about it the wrong way. You don't spend $45B on stuff for yourself. You spend $45B on changing the way governments and populations live work and how power is balanced.When Bud Fox asked Gordon Gekko \"How much is enough\" Gekko knew immediately that Fox wasn't in the same league. Money isn't about stuff, it's about power and influence.",
            "children": [
              {
                "author": "cwe",
                "text": "Which is exactly the type of stuff Zuck is talking about here, although in less power-hungry ways. So you're kind of proving @austenallred's point.",
                "children": [
                  {
                    "author": "toomuchtodo",
                    "text": "I think Zuck is still power hungry, he's just more veiled about it. Everyone with enough power (through money) wants to shape the world in their specific ideal.",
                    "children": [
                      {
                        "author": "AndrewKemendo",
                        "text": "I'd go one better:\"Everyone ... wants to shape the world in their specific ideal.\"Most people give up on this idea in their mid-20s though or never really believe that they can.",
                        "children": [
                          {
                            "author": "circlefavshape",
                            "text": "That's because most people actually can't.",
                            "children": []
                          }
                        ]
                      },
                      {
                        "author": "chc",
                        "text": "If we define \"power-hungry\" so broadly that it encompasses merely wanting to make the world a better place, I'm not sure what use the term is anymore.",
                        "children": [
                          {
                            "author": "toomuchtodo",
                            "text": "The problem is \"better\" is subjective, and its probably preferred that the majority of people determine what better is instead of the small minority of people with billions of dollars.I like the future Bill Gates and Elon Musk want to bring. I do not like the future the Koch Brother's envision.",
                            "children": [
                              {
                                "author": "jsnathan",
                                "text": "But would you be in the majority with that? :)",
                                "children": [
                                  {
                                    "author": "toomuchtodo",
                                    "text": "Yes, I'm part of the 7.3 billion people who are not billionaires.",
                                    "children": [
                                      {
                                        "author": "jsnathan",
                                        "text": "Sorry I was referring to the second part of your comment.Even if you happen to be in majority with your progressive views, in this instance, there is no guarantee for that generally, especially if we consider the entire global populace.. is what I was trying to point out.",
                                        "children": [
                                          {
                                            "author": "toomuchtodo",
                                            "text": "I'd argue 7 billion people can find common ground on what you'd consider \"quality of life\" for everyone.",
                                            "children": [
                                              {
                                                "author": "jsnathan",
                                                "text": "That seems counterfactual to me, but that's just my opinion.",
                                                "children": []
                                              }
                                            ]
                                          }
                                        ]
                                      }
                                    ]
                                  }
                                ]
                              },
                              {
                                "author": "ArkyBeagle",
                                "text": "First you'll get the one, then the other. Elon Musk and Gates are hardcore egotists. Charles Koch was just trying to live up to his father's expectations. He's stated that his guiding principle is economic consumer surplus.I won't excuse the whole \"killer instinct\" thing they all have in common. It's just how humans sometimes work.Don't get me wrong - Koch et al is a weird company but there's room for that, too. W.R.T energy I hope you're right but it moves slowly.",
                                "children": []
                              }
                            ]
                          },
                          {
                            "author": "bigbugbag",
                            "text": "I sincerely doubt Zucker wants to make the world a better place, else why would he be doing the opposite while making billions out of it ?Usually a billionaire giving his fortune away does it out of vanity, out of guilt, for the tax breaks, out of conviction that their success in business makes them equally expert in solving the world’s problems or last but not least as “legacy” as explained by John Caudwell:\nhttp://www.theguardian.com/society/2012/mar/07/new-philanthr...",
                            "children": [
                              {
                                "author": "Veedrac",
                                "text": "I sincerely doubt he thinks he has been doing the opposite.",
                                "children": []
                              },
                              {
                                "author": "reddytowns",
                                "text": "What is so awful about Facebook? I mean it's hardly an original idea, and if Facebook never existed, I'm sure that Myspace or Friendster or some hereto unknown company would have taken its place.It's like hating Ford because they make cars, while ignoring all other automobile companies.",
                                "children": [
                                  {
                                    "author": "DanBC",
                                    "text": "Yur analogy makes more sense if Ford make cars that contain cameras and microphones and they monitor everything you say and do and where you go and they send all that information back to the mothership.And they want to build cars for all poor people, but those cars can only travel to certain destinations on certain roads, but Ford making and providing these cars means other organisations who sell bicycles or mopeds or small cars (which provide a lot more freedom) are hampered.",
                                    "children": []
                                  }
                                ]
                              }
                            ]
                          }
                        ]
                      },
                      {
                        "author": "Chathamization",
                        "text": "Agreed. The fact that they're having a big press release about all the awesome stuff they're going to be doing before they've done any of it, heck before they're even ready to say what they're actually going to be doing, is telling. As is naming their initiative after their daughter.It's nice when vanity projects end up helping the masses (and we'll have to wait and see how successful it is at that). However, we shouldn't act like this very public display of wealth (again, before anything is even done) has motives that are so different from, say, giant statues of oneself or giant mausoleums.",
                        "children": [
                          {
                            "author": "lifeformed",
                            "text": "How is any of that stuff bad, though?  Seems like a good trade.  You put $45B into improving the world, we'll sing your praises.What's the difference between it being all done in vanity and it being all done in goodwill?  It's literally the same thing to the rest of the world, the only difference is some internal chemical state in his brain.",
                            "children": [
                              {
                                "author": "psykovsky",
                                "text": "Except he still didn't do a thing besides putting out a press-release. Do you think his real intentions will not shape the way he acts in the future? How can you say it is a good trade when no trade happened yet?",
                                "children": [
                                  {
                                    "author": "lifeformed",
                                    "text": "You think he's going to just put a press release out and not actually do it?",
                                    "children": [
                                      {
                                        "author": "psykovsky",
                                        "text": "I still remember what Internet.org was supposed to be and what it turned out to be. The man is an egocentric liar.",
                                        "children": []
                                      }
                                    ]
                                  }
                                ]
                              },
                              {
                                "author": "ArkyBeagle",
                                "text": "We've become too cynical and rent-seek-ey. Many people realize that a large wad of money was Nature's way of telling them to keep doing what they're doing.Instead, it has to be \"charity\" now. Very few rich people ever did charity well.",
                                "children": []
                              }
                            ]
                          }
                        ]
                      },
                      {
                        "author": "ArkyBeagle",
                        "text": "I see more and more that hubris is apparently a deprecated concept.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "author": "AndrewKemendo",
                    "text": "although in less power-hungry waysYes, well that's 100% the distinction.The OP seems to think that the obvious choice is for money to \"go to something meaningful\" without specifying what \"meaningful\" actually is. Within this context, that would seem to mean the \"meaningful\" thing is \"greater -good\" charity. My point is that more frequently, this type of money go toward direct influence of power like setting up Super PACs, hosting power networks like Sun Valley Conference, establishing think tanks, grants to universities for certain research etc...",
                    "children": []
                  }
                ]
              },
              {
                "author": "Cookingboy",
                "text": "Exactly, when you have that much wealth, you buy things that don't have price tags on.",
                "children": []
              },
              {
                "author": "slg",
                "text": ">You spend $45B on changing the way governments and populations live work and how power is balanced.$45B is even overkill for that.  Each presidential candidate spent (or had spent on their behalf) roughly $1B in 2012.  Zuckerberg therefore could have doubled a candidates spending for each presidential election for the rest of his life and still have half his fortune.  $45B is that huge.EDIT: The multiple downvotes seem to indicate I said something that is disagreeable.  I'm not implying that buying elections would be a better use of Zuckerberg's money, just that he has so much money that elections are just more \"stuff\" he could buy without even thinking hard about it.",
                "children": [
                  {
                    "author": "AndrewKemendo",
                    "text": "The Koch brothers have a combined $100BN and they still haven't gotten the influence that they want. So yes, $45B is a shitload, but practically once you spread it out to where you need it to be to make the world look like you want it to, it still only makes a dent.",
                    "children": [
                      {
                        "author": "slg",
                        "text": "The Koch brothers are the most influential political backers in the country and they spend somewhere in the neighborhood of  $200M per election cycle.  They are the closest someone has come to trying to buy an election, but even their donations are still only rounding errors in comparison to their overall fortune.  Politics is a relatively cheap game for someone with tens of billions of dollars.",
                        "children": [
                          {
                            "author": "brbsix",
                            "text": "It is a cheap game for someone with millions of dollars even. ROI on these sort of political contributions can be absolutely insane. Apparently corporations on average receive ~$760 for every $1 spent influencing politics. Depending on the industry, ROI is anywhere from 5,000 to 77,000 percent.http://www.zerohedge.com/news/2015-03-16/words-greatest-inve...",
                            "children": [
                              {
                                "author": "lmm",
                                "text": "Zerohedge is... rarely aligned with reality. Do you have a reliable source?",
                                "children": []
                              },
                              {
                                "author": "mseebach",
                                "text": "> Depending on the industry, ROI is anywhere from 5,000 to 77,000 percent.That is clearly not true. If that sort of ROI existed in anywhere near the general case, a lot more people and companies would spend a lot more money on it, and they don't. Perhaps there exists lobbying opportunities with these kinds of ROIs, but they are limited, and there definitely isn't a 5,000% floor on it.https://www.washingtonpost.com/news/the-fix/wp/2015/05/04/am...I think the problem with the zerohedge article (and the report it summarises) is that, first, they seem to assume that all corporate welfare benefits the businesses doing the lobbying locally (not to businesses in general, which is probably more the case -- Ford lobbying against foreign competition will help Chevrolet equally, regardless of how much either firm spends on lobbying), and second, that corporate welfare only exists because of lobbying: Politicians still need to get elected, and creating industry, jobs and high-profile ribbon-cutting opportunities in their districts (regardless of whether businesses lobby them for it or not) is likely to remain a popular tactic in the absence of lobbying.",
                                "children": [
                                  {
                                    "author": "sukulaku",
                                    "text": "I'm not sure if you meant it that way, but for the record: politicians don't create jobs - entrepreneurs do.The best thing politicians can do for the common good, is to get the hell out of the way and let productive people be productive.",
                                    "children": [
                                      {
                                        "author": "mseebach",
                                        "text": "I agree fully with you -- I was trying to frame the comment inside the political calculus, in which actors can certainly redirect public funds in such away that it appears new jobs are created in their districts, even if it's often zero or negative sum for the economy at large.",
                                        "children": []
                                      }
                                    ]
                                  }
                                ]
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  }
                ]
              },
              {
                "author": "sytelus",
                "text": "I strongly feel this power, influence, giant houses, jets, personal cruise ships etc are old generation stuff - something that grey haired Gekko will personify. The \"new rich\" is dramatically different and for the better. Today's centi-millionairs wants to stay anonymous, don't want to have butlers, have houses that they can manage without permanent staff and often prefers travelling first class or renting Yatch instead of buying them even if they can afford it. The new rich sets target to make X amount of money and then \"retire\". Their \"retirement\" consist of working hard doing their favorite activities and travelling the globe to sample the \"regular folks\" flavors. Most of them don't have desire to keep growing billion dollar business which will sip away their time and energy. They have strong political belief but have no desire for acquiring political power directly or indirectly. They are not in to heavily influencing how rest of the population shall live. They consider time to do their favorite activities far more important than keeping money scoreboard. They want to buy fashionable cloths and accessories but not those that will immediately attract attention and single them out in the crowd. They want to be physically fit and avoid having family as long as possible. They like to invest in ideas and technology more than traditional financial instruments.I think new rich crowd will almost completely replace old generation wealthy in next 50 years or so. People who are born in this decade will have very hard time understanding philosophies and life style choices of Gorden Gekko.",
                "children": [
                  {
                    "author": "beccasanchez",
                    "text": "These people you're describing are no different than the old aristocracy. Aristocrats have always attempted to live a comfortable, quiet life of idle pleasures. A Rockefeller or Ford figure that works really hard is the exception--and they are a very American invention who were raised with the protestant work ethic.",
                    "children": []
                  },
                  {
                    "author": "AndrewKemendo",
                    "text": "Hate to break it to you but what you described about the \"new\" millionaires is the majority of all multimillionaires, regardless of generation.See: The Millionaire next door",
                    "children": [
                      {
                        "author": "majani",
                        "text": "I accidentally downvoted you due to fat finger error, sorry.",
                        "children": [
                          {
                            "author": "AndrewKemendo",
                            "text": "Well I'm crushed, but hopefully I can get over it ;)",
                            "children": []
                          }
                        ]
                      },
                      {
                        "author": "kamaal",
                        "text": "I hope most people understood this. In fact bulk of the worlds rich is invisible, they become rich through mundane savings and investment methods everybody else avoids.World is a strange place. Very few millionaires win and lose spectacularly. Nearly all of rich people out there are silent and invisible.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "author": "saiya-jin",
                    "text": "you're idolizing new rich a bit too much. yes there are people like you describe, but that's nothing new with this generation. then there is remaining majority, which is a mix of it all, including the worst \"offenders\".just because via social media you see more of the \"new rich\", which have desire to make public statements and be as visible as possible, doesn't mean that's all there is.",
                    "children": []
                  },
                  {
                    "author": "bambax",
                    "text": "> Today's centi-millionairs wants to stay anonymous, don't want to have butlersPeter Thiel, the godfather of \"today's centi-millionaires\", has a butler.— At least he had one in 2007:http://fortune.com/2007/11/13/paypal-mafia/",
                    "children": []
                  }
                ]
              },
              {
                "author": "ams6110",
                "text": "$45B is not enough to change governments. That's about 4 days worth of US federal spending.",
                "children": [
                  {
                    "author": "HaloZero",
                    "text": "Yeah but it's more than enough to bribe the hell out of a lot of senators.",
                    "children": []
                  },
                  {
                    "author": "wheels",
                    "text": "It's more than the annual budgets of about 2/3rds of the world's countries, including places like Croatia, or the Philippines.  I'd call that politically significant.",
                    "children": []
                  },
                  {
                    "author": "kamaal",
                    "text": "ISRO spent a mere $73 million to go to mars. Big and small are perspectives between what one can do and what one can't.",
                    "children": []
                  }
                ]
              },
              {
                "author": "ArkyBeagle",
                "text": "Nah. It's about ego(tism). Power & influence use different currency. You have to either - 1) not know or 2) not care - how badly you'll mess this up.And you will.",
                "children": []
              }
            ]
          },
          {
            "author": "vinceguidry",
            "text": "Spending money meaningfully is hard work. John D. Rockefeller had such a hard time with it that after awhile he just left it up to his son, who devoted his life to philanthropy.At the Cleveland church he went to, significant portions of his time spent there was to write checks to parishioners.I'd say it takes roughly the same amount of effort to spend money as it does to make it. You still need an organization, you still need to make really hard decisions day in and day out. It seems that there's something fundamental about philanthropy that doesn't scale.Personally, I think the work a person does to earn that kind of money, assuming of course it's from legitimate commercial activity, is plenty enough, one shouldn't feel morally compelled to donate it back. But like you said, what else are you going to do with it? Doesn't make a lot of sense anymore to leave billions to heirs.",
            "children": [
              {
                "author": "lloyddobbler",
                "text": "> Personally, I think the work a person does to earn that kind of money, assuming of course it's from legitimate commercial activity, is plenty enough, one shouldn't feel morally compelled to donate it back.Agreed. And not to get too political, but I'm thankful that individuals in the U.S. are exceptionally generous, and do think about these things. And that those who DO earn copious amounts of money have the choice of what to donate it to - rather than having 90% of it confiscated and doled out by someone else who didn't earn it.",
                "children": []
              },
              {
                "author": "visakanv",
                "text": "Relevant bit from Playboy's interview with Steve Jobs:> Playboy: What does the money actually mean to you?> Jobs: I still don’t understand it. It’s a large responsibility to have more than you can spend in your lifetime—and I feel I have to spend it. If you die, you certainly don’t want to leave a large amount to your children. It will just ruin their lives. And if you die without kids, it will all go to the Government. Almost everyone would think that he could invest the money back into humanity in a much more astute way than the Government could. The challenges are to figure out how to live with it and to reinvest it back into the world, which means either giving it away or using it to express your concerns or values.> Playboy: So what do you do?> Jobs: That’s a part of my life that I like to keep private. When I have some time, I’m going to start a public foundation. I do some things privately now.> Playboy: You could spend all of your time disbursing your money.> Jobs: Oh, you have to. I’m convinced that to give away a dollar effectively is harder than to make a dollar.",
                "children": [
                  {
                    "author": "saiya-jin",
                    "text": "honest question - how did that went? I mean donation & public foundation part",
                    "children": [
                      {
                        "author": "austenallred",
                        "text": "He died before it happened.",
                        "children": []
                      },
                      {
                        "author": "MagnumOpus",
                        "text": "In typical Jobsian fashion. He talked a good game, but decided to do the opposite. Put his wealth into a living trust to shield it from taxes and publicity and left it to benefit his wife and children.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "author": "kamaal",
                "text": ">>It seems that there's something fundamental about philanthropy that doesn't scale.There is.You don't give people fish to eat, you teach them how to fish.",
                "children": [
                  {
                    "author": "vinceguidry",
                    "text": "John D. Rockefeller started the University of Chicago. Much of his time had to be spent convincing his trustees that they had to spend time soliciting funds from other donors than him. They tended to get slothful and spendthrift otherwise.Teaching isn't presently scalable. You can look to the failures of our public school system for evidence. One might be tempted to look to other countries for systems that work better, but there has to be a political path forward for implementing those systems here.One good teacher can only teach so many. That good teacher may not be good at teaching teachers. Teaching is not warfare, where good soldiers can teach other people to teach soldiers.Teachers that are good at teaching teachers can only teach so many teachers. Any attempt to scale a working method will eventually run out of talent. And if you don't stop when you run out of talent, then the quality of your teaching will inevitably go down. Universities can only get so big.Billionaires who want to put their wealth towards education are pretty limited in their options.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "author": "equalarrow",
            "text": "> I've had the opportunity to rub shoulders with a few billionaires over the past few weeks, and it's remarkable how differently they think about money than the people who don't have it.Yah, I don't necessarily disagree with their mindset. I've crossed a lot of spectrums, including chilling and rubbing shoulders with the rich to scraping by. I definitely do agree with a lot of the lofty 'moon shots' and some of these people have achieved remarkable things not just for themselves, but for society as well.But, with Zuck, I just don't know. Gates got rich off operating systems and crushing opponents at all costs (a success story for capitalism). Zuck, from advertising and selling 'your' data. It's admirable that he's giving 99% away, but, I just don't get a warm fuzzy feeling about it.Time will tell and I hope it turns out good.",
            "children": [
              {
                "author": "austenallred",
                "text": "> Zuck, from advertising and selling 'your' dataIMO that's a really narrow-minded read of what Facebook is. >1B people log into products he founded every day. He lets advertisers target you using data you've provided, as you sit on the platform he helped build, but I'm not convinced that makes him an evil dude.",
                "children": [
                  {
                    "author": "tjl",
                    "text": "My problem is him collecting data on people who aren't even using the service. They collect data on any site with a Facebook button. I don't even use the service and he has my data. I'm not getting any value from his product, so what right does he have to my data?",
                    "children": [
                      {
                        "author": "saiya-jin",
                        "text": "well, I don't think there are many FB users who would like that to be done to them either, I know I am not.FB might not be some evil company, but they are definitely not nice guys.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "author": "joering2",
                    "text": "\"Dude they just give me their info. Yeah... Dumb suckers!\"Okay perhaps he was young and naive. But is Facebook naive now in Belgium where they want to track people outside of facebook \"for their own safety\"?This is EVIL!!",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "author": "yongjik",
            "text": "...Meanwhile, Samsung's owner Lee Kun-Hee is still officially alive (even though nobody has seen him in months after he had a heart attack), because the company still hasn't tied up all the loose ends for transferring the company's ownership to Lee's son while paying as little tax as possible.So, yes, you can do a lot worse (to your society) with $$billions.(Sorry for the rant.  Please carry on.)",
            "children": []
          },
          {
            "author": "morgante",
            "text": "> I mean, what else are you going to do with $45 Billion? Build a really big house?Leave it to your children so you can perpetuate hereditary wealth on a grand scale. Because your great-great-great-great-great-great-great grandchildren should never have to work, right?",
            "children": []
          }
        ]
      },
      {
        "author": "nugget",
        "text": "I give Mark and Priscilla a lot of credit for this.  There's a big difference between 50% and 99%.  There's a big difference between leaving your children a few hundred million and many billions.  They have certainly exemplified the challenge to ''put your money where your mouth is''.Having said that, the first thing I thought of was the tax implications.  If the shares were to eventually be sold (but not donated), the State of California alone would earn roughly 6 billion dollars in tax revenue.  And the Federal Government another 13 - 15 billion.  Assuming a lot of variables that could push the value up or down, of course, and the fact that they would be unlikely to sell the majority of their shares any time soon.  My understanding is that by donating the appreciated stock to a charity, under current laws, there is zero tax due.  I wonder if there's a state financial forecaster or analyst in Sacramento having a bad day today.",
        "children": [
          {
            "author": "marknutter",
            "text": "> Nonetheless the big winner here is the group of causes they donate to but it comes at the expense of a significant amount of tax revenueHere is the world's smallest fiddle...",
            "children": [
              {
                "author": "munchbunny",
                "text": "In this case it really does just sound like \"the tax incentive is working as intended\".",
                "children": []
              },
              {
                "author": "briandear",
                "text": "Good! Government is far less efficient anyway. How many different agencies and special interest groups does the money now not have to touch to get to where Zuck thinks it's best used? The government would just buy a few more F35s or funnel it to bail out companies like GM. Or squander it on 'investments' such as Solydra or market-distorting Ethanol subsidies. It certainly wouldn't get funneled into meaningful education reform or lowering taxes for the rest of us.",
                "children": []
              }
            ]
          },
          {
            "author": "whatok",
            "text": "They didn't announce plans to sell immediately and given the timeframe, I'd imagine that selling/transferring those shares will be done in the most tax-advantaged way possible.",
            "children": [
              {
                "author": "bonzini",
                "text": "Besides taxes, selling 44.5 billion worth of shares would affect the share value negatively.  They will probably use some kind of derivative contract to get funds for the non-profit.",
                "children": [
                  {
                    "author": "cplease",
                    "text": "He's not selling the shares. He said they \"will give 99% of our Facebook shares.\" If he sold appreciated stock and donated the proceeds, he'd still have to pay tax on the capital gains, and could only deduct the amount of the actual donation, which would be smaller after tax.By donating stock directly, he still gets to deduct the full value of the stock without paying any tax, and the charity (or more likely, private foundation) gets to keep the full value without paying any tax. And it could take as long as it wanted to liquidate the stock and get the best price.",
                    "children": [
                      {
                        "author": "bonzini",
                        "text": "> the charity (or more likely, private foundation) gets to keep the full value without paying any tax. And it could take as long as it wanted to liquidate the stock and get the best price.Yes, and the foundation will likely not liquidate the stock, but use the proceeds of some kind of swap contract.",
                        "children": []
                      },
                      {
                        "author": "cdcarter",
                        "text": "The Initiative is an LLC and not a public charity or private foundation, so as not to limit the activities they can take part in. This will all be taxed at some point (though the Initiative may further grant shares to public charities).",
                        "children": [
                          {
                            "author": "cplease",
                            "text": "Yeah, I missed this the first time around. But you are not quite correct. An LLC is a pass-through entity. No doubt it will be treated as a disregarded entity for federal tax purposes. So, gifting shares to an LLC is not a taxable event. If the LLC sells shares for a non-charitable purpose (e.g. lobbying, or funding commercial ventures), then sure, that will be taxable. But if it in turn donates shares to either a private foundation or another charity, in that case, it will not be taxable, and will in fact be deductible for the Zucks.Basically, if the Zucks own the LLC, then until funds actually leave the LLC they really haven't made a donation at all.",
                            "children": [
                              {
                                "author": "cdcarter",
                                "text": "However, if the Initiative ever liquidates shares, regardless of what it does with them, they'll owe cap gains just M+P would have.",
                                "children": []
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "arasmussen",
            "text": "I think that's why they created a non-profit organization, Chan Zuckerberg Initiative. Non-profits are taxed differently and I'm sure they'll figure out how to get the money where it needs to be and pay as little tax as possible.",
            "children": [
              {
                "author": "k__",
                "text": "Is it possible in the US to take both names after marriage?If so, I'm disappointed that Mark didn't choose to be Zuckerberg-Chan.",
                "children": [
                  {
                    "author": "tomschlick",
                    "text": "In the US you can change your name to anything. The guy can change just as the girl can but it is very uncommon for the guy to change his last name.Honestly, why are you disappointed?",
                    "children": [
                      {
                        "author": "EC1",
                        "text": "\"Chan is a diminutive suffix; it expresses that the speaker finds a person endearing. Thus, using chan with a superior's name would be condescending and rude. In general, chan is used for babies, young children, and teenage girls. It may also be used towards cute animals, lovers, and close friends. \"It's otaku humor.",
                        "children": [
                          {
                            "author": "khuey",
                            "text": "In Japanese ... his wife is ethnically Chinese.",
                            "children": [
                              {
                                "author": "EC1",
                                "text": "Doesn't matter in the context of the joke. Has nothing to do with his wife, only 'chan'.",
                                "children": []
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "author": "dexterdog",
                    "text": "It's possible to do anything with your band. I'm disappointed he didn't choose Suckitwinkelvoss.",
                    "children": []
                  },
                  {
                    "author": "stevesearer",
                    "text": "Yeah. I have an extended family member who took both names and a friend who opted to just take on his wife's maiden name and dropped his. Another set of friends came up with a last name that was new to them both.The hyphenating of both names is an interesting concept, but would in all practicality be a difficult thing to pass on after a few generations if it were the standard. Though maybe I'm not thinking thorough it properly.",
                    "children": []
                  },
                  {
                    "author": "spicyj",
                    "text": "Neither of them changed their names.",
                    "children": []
                  },
                  {
                    "author": "dagw",
                    "text": "Is it possible in the US to take both names after marriage?Where isn't it possible?",
                    "children": [
                      {
                        "author": "fmueller",
                        "text": "In Switzerland for example. Either both use the same name or they keep the one they already had.",
                        "children": [
                          {
                            "author": "cdcarter",
                            "text": "According to https://www.ch.ch/en/married-name/> Surnames combined with a hyphen, such as Meier-Müller, are still allowed. Combined surnames are not official registered names, but may be used in everyday situations and recorded in your passport and identity card.So, it's not \"official\" but you can use it everywhere including on your official documents.",
                            "children": []
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "author": "visakanv",
                    "text": "Everybody's disappointed with Mark one way or another, it seems.",
                    "children": []
                  }
                ]
              },
              {
                "author": "xyzzyz",
                "text": "According to NYT, Chan Zuckerberg Initiative is LLC, and not a non-profit. See my comment here:https://news.ycombinator.com/item?id=10662073",
                "children": [
                  {
                    "author": "arasmussen",
                    "text": "Thanks for the correction.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "author": "Bedon292",
            "text": "I might be wrong, but didn't he already pay the massive tax bill for all of the stock options? Meaning all of those stocks would be taxed at long term capital gains rates, not at the high rates you are saying here. I believe his Federal taxes on sales would be 15% of current price - IPO price so approximately 4.5B not 13-15B at this time. That is also assuming Facebook continues to be dominant and doesn't go the way of every other social networking site before it, but that is a different issue.And either way, the charitable organizations deserve to be supported and will do good for society, and they get to pick how it is used. Which doesn't seem like a bad thing, when the Federal government can barely agree on any budget at all.",
            "children": [
              {
                "author": "jonknee",
                "text": "The current capital gains tax rate he would be avoiding is 20%, or $9b at today's Facebook market cap. There is also a 3.8% Medicare tax added on that would come to another $1.7B. The state of California would also get their hands on it and take another 13.3% (or about $6B).tl;dr Giving capital gains away is very tax advantageous!",
                "children": [
                  {
                    "author": "Bedon292",
                    "text": "I did miss the Medicare Tax part yes, however he takes a $1 salary which would put his regular tax bracket at 10% and long term capital gains would be 0% to start and work his way up to 15%. As long as he doesn't cash out $400k a year he never pays that 20%, and he shouldn't need to ever. You also need to subtract IPO price from current price. Which is about going to drop those estimates about 35%. It still a big chunk of change, no doubt, but I have no problem with getting around it by going to charities. Especially when he already paid ~$2Billion in taxes for the stock at IPO time. The top 400 tax payers only payed $16Billion in 2009 so, he has paid a huge amount.",
                    "children": [
                      {
                        "author": "jonknee",
                        "text": "It would be shocking if he doesn't have alternate income from investments that would knock him up to the top tax bracket. Even moderate dividends on $25m add up to putting you in the top bracket. I have to imagine he has more than $25m in non-Facebook assets.Regardless, he's saving a fortune in tax by donating money to his own foundation. It could turn out to be awesome like the Gates Foundation, but it could also be a decades long experiment in tossing money down the drain as he works on pet projects. Hopefully the former!",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "gist",
            "text": "\"There's a big difference between 50% and 99%. There's a big difference between leaving your children a few hundred million and many billions.\"There is a saying \"you can name the price if I can name the terms\". Zuckerberg saying this and when he actually does this are two different things. (Per my other comment). I am not saying that he won't (how would I know?) but this is a promise that is based on a future event that, given the age of both parents, could easily be 50 or 60 years in the future.  And of course exactly nothing will happen if he changes his mind (he isn't going to issue a press release on that) and nobody has any access to his finances anyway. So he is free to say anything he wants for any reason and that of course could change. That said it's his money and he can do what he wants with it. And there is no reason to even announce this if not playing some PR angle.Edit: And to my point I just got a WSJ Technology Alert email with the headline \"FACEBOOK'S MARK ZUCKERBERG IS GIVING AWAY 99% OF HIS SHARES\" and then further down in a paragraph \"over the course of their lives\".",
            "children": []
          }
        ]
      },
      {
        "author": "Fede_V",
        "text": "Chapeau Mr. and Mrs. Zuckerberg.",
        "children": []
      },
      {
        "author": "suyash",
        "text": "At last Zuckerberg realized real problems of the world can't be solved by Facebook or for that matter technology. I am talking about healthcare and medical problems. Personally websites like Facebook are wate of time and barely make ant impact in human potential improvement.They do make us feel worse and sell our personal data to advertisers though.",
        "children": [
          {
            "author": "narrator",
            "text": "With the amount of money Zuk has he should start a non-profit drug maker that produces generic drugs at cost.",
            "children": []
          },
          {
            "author": "WWKong",
            "text": "There hasn't been another other thing that has had as much impact in bringing me closer to my family and friends across the globe. Waste of time for you, positive life changing medium for me. Further, who know what positive impact this have had on my health? Maybe it has prevented the need for medicines in many cases.",
            "children": [
              {
                "author": "bigbugbag",
                "text": "Except for the internet and computers and electricity and a few other things.I hope you understand that your personal experience is anecdotal evidence at best and perception bias for you didn't take into account the downside for the rest of the population.What about this stubborn family member who refuses to have a facebook account because he believes in privacy as a fundamental freedom,  how exactly facebook is bringing you closer to him/her?",
                "children": [
                  {
                    "author": "WWKong",
                    "text": "Anecdotal? Perception bias? Okay, let's go by hard data. 1.4 Billion active users. Billion of advertising dollar flowing through the platform because users are engaged. How many billions of family pictures shared and enjoyed? You think people are suffering through the experience and being forced to use facebook? Think again. And that stubborn family member with the tin foil hat (edge case), he can surely pick up the phone and give me a call.",
                    "children": [
                      {
                        "author": "bigbugbag",
                        "text": "yes one's own experience is always anecdotal and due to perception bias we believe our personal experience to be significant. You're not special, we pretty much all do this.Please define active user as it could mean anything, then again don't, as number of used (which is more appropriate than users for facebook) and advertising dollars are hardly valid metrics for bringing people together and positive life changing.\nTurns out you are right actually, some are suffering through the experience and feel they are forced to use facebook[1][2][2], note that they are mostly in the same demographic group which happen to be the next generations of adults.This tin foil hat edge case is a boat that has sailed a while ago, facebook is a major privacy problem[3][4][5] and as we know privacy is the foundation for liberty and freedoms. But Facebook is also censorship[6][7] and manufacturing public opinion[8].Not only that, but contrary to your personal experience facebook usually makes people miserable and feel bad about themselves[9][10][11][12] and other personal experience point to it being bad and getting worse at giving you the meaningful posts[13].If you care about your loved ones and family you should help them get away from facebook[14][15], not trap them in by putting all you interactions with them there.[1]: https://medium.com/backchannel/a-teenagers-view-on-social-me...[2]: http://www.slate.com/blogs/xx_factor/2013/05/22/teenagers_ha...[2]: http://mashable.com/2013/08/11/teens-facebook/[3]: http://www.techrepublic.com/blog/it-security/why-you-should-...[4]: http://www.dailykos.com/story/2013/06/23/1218189/-HBGary-Pal...[5]: http://techcrunch.com/2015/06/06/the-online-privacy-lie-is-u...[6]: https://www.washingtonpost.com/news/the-intersect/wp/2015/01...[7]: https://www.aclu.org/blog/naked-statue-reveals-one-thing-fac...[8]: https://medium.com/message/engineering-the-public-289c913902...[9]: http://www.npr.org/2012/10/18/163098594/in-constant-digital-...[10]: http://www.sciencedirect.com/science/article/pii/S0747563214...http://www.theguardian.com/technology/2012/mar/17/facebook-d...[11]: http://qz.com/546799/a-study-forced-people-to-quit-facebook-...[12]: http://www.economist.com/news/science-and-technology/2158359...https://hbr.org/2011/12/facebook-is-making-us-miserabl[13]: https://www.refheap.com/ee96f4d90abd10b643cee0448[14]: http://saintsal.com/facebook/[15]: http://www.theguardian.com/commentisfree/andrewbrown/2010/ma...",
                        "children": [
                          {
                            "author": "WWKong",
                            "text": "We both agree that individual experience is anecdotal. That is why I tried the way of stats. But you are now questioning the number of users on fb. That boat has sailed few yrs back.A.We can all confidently agree that a large number of users use fb.B. Most of what you have linked is opinion pieces. The first one I clicked had private chat transcripts from Zuckerberg when he was a kid and fb was nothing like what it is today.C. Some studies are referenced which show people are miserable using social networks. Similar results have been \"derived\" for almost anything: news, video games, television, cell phones etc. I recommend taking it with a pinch of salt.D. You say that advertising dollars mean nothing. Exactly the opposite is true. Try getting coke, kraft, apple and other brands to associate themselves with something that makes miserable.",
                            "children": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "agorabinary",
        "text": "Will this ~$45 billion go to efficient use? Based on his track record of $100 million to newark and how effective that was, I am skeptical.Good intentions in philanthropy are a dime a dozen, actual results are less common.",
        "children": [
          {
            "author": "spicyj",
            "text": "Has it really been so big a failure as the press has led us to believe?https://www.facebook.com/zuck/posts/10102461245925231",
            "children": []
          },
          {
            "author": "likerofnews",
            "text": "Did you actually read the results of the $100 million going to Newark instead of blindly believing the media? Probably not... #uninformed.",
            "children": []
          },
          {
            "author": "sliverstorm",
            "text": "If the Newark experiment winds up being a catastrophe, we do still walk away with a postmortem teaching us interesting things about the problems we face, and debunking the notion that all schools need is more money.",
            "children": []
          },
          {
            "author": "peter303",
            "text": "Improving schools is HARD for techies and non-techies alike.\nEducation is one of the major iniatives of the Gates Foundation and Mrs Jobs main charity.",
            "children": [
              {
                "author": "ams6110",
                "text": "Dumping money in to a proven failed approach was not a great idea. He should have founded a separate school system instead.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "bababouy33",
        "text": "That would leave him with $450 million left over.Four hundred. And fifty. Million.",
        "children": [
          {
            "author": "theworstshill",
            "text": "He earned it.",
            "children": [
              {
                "author": "mempko",
                "text": "lolz, the army of facebook engineers earned it.",
                "children": [
                  {
                    "author": "palmer_eldritch",
                    "text": "No, they did the work, he earned the money.",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "gist",
        "text": "\"During our lives\" doesn't specify a time frame such that it will happen in the next 5 years or 50 years. What he appears to be really saying is \"our heirs will only inherit 1% of our Facebook shares\". Until both Chan and Zuckerberg pass away we don't know how many shares (or wealth) they will have access to.",
        "children": [
          {
            "author": "Cthulhu_",
            "text": "It's very probable Facebook will get a competitor, and/or make a decision, that makes the company worth a lot less in a very short time, like its predecessors / previous competitors did. Internet companies can be fickle like that. Mind you, it's not likely to happen overnight and it also depends on how much the company's value is based on thin air, but still.",
            "children": []
          }
        ]
      },
      {
        "author": "pcl",
        "text": "Yeah... how's that for burying the lede? I almost didn't get that far through the post.",
        "children": []
      },
      {
        "author": "ricardobeat",
        "text": "He's still left with US$450 million, for living expenses...",
        "children": []
      },
      {
        "author": "benihana",
        "text": "What point are you making? Are you saying that's a lot or a little? We all read the 99% number. Adding periods between the words puts emphasis on it sure (great job putting in the extra effort to enhance the discussion by the way) but given the nature of this discussion I can't for the life of me figure out what you're actually trying to say.",
        "children": []
      },
      {
        "author": "awqrre",
        "text": "if they break up, it might become 49.5% as this is not a done deal...",
        "children": []
      },
      {
        "author": "sleepyhead",
        "text": "Mark Zuckerburg is now officially the one percent.",
        "children": []
      },
      {
        "author": "oever",
        "text": "He's not giving it all at once. He announced that he plans to give 1-2% of his Facebook wealth per year.",
        "children": []
      }
    ]
  },
  {
    "author": "uptown",
    "text": "\"As you begin the next generation of the Chan Zuckerberg family, we also begin the Chan Zuckerberg Initiative to join people across the world to advance human potential and promote equality for all children in the next generation. Our initial areas of focus will be personalized learning, curing disease, connecting people and building strong communities.We will give 99% of our Facebook shares -- currently about $45 billion -- during our lives to advance this mission. We know this is a small contribution compared to all the resources and talents of those already working on these issues. But we want to do what we can, working alongside many others.\"",
    "children": []
  },
  {
    "author": "cup",
    "text": "\"Medicine has only been a real science for less than 100 years, and we've already seen complete cures for some diseases and good progress for others.\"Thats a bit unfair. Scientists have been painfully working to advance the field of medicine for centuries.",
    "children": [
      {
        "author": "acchow",
        "text": "I think \"real science\" refers to reproducibly, experimentally driven science.",
        "children": [
          {
            "author": "cup",
            "text": "Arab scientists were performing reproducible and successful removal of cataracts 800 years ago. Surely thats 'real medicine'.",
            "children": []
          }
        ]
      },
      {
        "author": "AndrewKemendo",
        "text": "Unless you have a very loose sense of the word scientist, that's very much untrue.[1]http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2641521/?page=1",
        "children": []
      },
      {
        "author": "DasIch",
        "text": "Doctors have been working to advance the field for centuries certainly but for pretty much all of them science by any reasonable definition wasn't involved in the process.Evidence-based medicine (what else would it be based on?) is actually a thing and an uncomfortably recent one at that.",
        "children": []
      }
    ]
  },
  {
    "author": "rrego",
    "text": "First time I've heard of Facebook Notes, which apparently aren't new at all. The notes that I do see aren't styled the same way as Zuckerberg's letter.",
    "children": [
      {
        "author": "EA",
        "text": "All the notes I have seen lately have this same style.",
        "children": []
      },
      {
        "author": "Cshelton",
        "text": "I mean, technically, Facebook has had notes since the early days. I know the format and style has changed, but I remember writing 'notes' on my wall that any friend could read in a dialogue box since around 2005/2006 ish?To that note, very few people I know actually use Facebook notes compared to other blogging platforms.",
        "children": []
      },
      {
        "author": "austenallred",
        "text": "Facebook has about 800 million features you would never know existed unless you went digging for them.",
        "children": []
      },
      {
        "author": "smackfu",
        "text": "It's a new redesign: http://www.theverge.com/2015/9/25/9398895/facebook-notes-red...",
        "children": []
      },
      {
        "author": "tomasien",
        "text": "Facebook notes were a huge part of the platform at first, died with expansion of the Newsfeed and the way statuses work now.",
        "children": []
      }
    ]
  },
  {
    "author": "ausjke",
    "text": "A great read indeed, plus a nice picture.\nI'm going to print out this and read along with my next generation.I'm thinking about starting to use facebook again, left it a few years ago.",
    "children": [
      {
        "author": "ymse",
        "text": "It's a trap.",
        "children": []
      },
      {
        "author": "tdkl",
        "text": "Seems that Zuck succeeded. So now all he has to do, to gain the old users who didn't agree with Facebook policies, to post cute family notes.",
        "children": []
      }
    ]
  },
  {
    "author": "rrggrr",
    "text": "I'm not trolling, as much as it will seem the opposite, but I feel compelled to wonder about postnatal mania (mild postpartum psychosis) as I read the letter. I wonder how different (or private) the letter may have been had it come four months from now.  I wonder how many really significant acts of charity and kindness by the super wealthy and influential occur in the days following childbirth. Just wondering aloud here.",
    "children": [
      {
        "author": "whatok",
        "text": "I'd imagine they had such a significant decision planned far before the kid was born.",
        "children": []
      },
      {
        "author": "djhn",
        "text": "You would think there is significant PR-department oversight and long-term planning that went into this.But on the other hand.. nobody really knows?",
        "children": []
      }
    ]
  },
  {
    "author": "littletimmy",
    "text": "This leaves a bad taste in my mouth, for some reason. Must one's private life be this public? I get that Zuckerberg doesn't agree with privacy, but surely putting his daughter in the public limelight as soon as she is born is an imposition on her privacy.Maybe I'm just getting old.",
    "children": [
      {
        "author": "jay_kyburz",
        "text": "I see you have some downvotes but I came here to say the same thing. Zuck is using the birth of his daughter to advertise a new venture.You want to be generous? Great, do it!Telling us in a letter to your daughter as a hook to attract eyeballs is kind of weird and exploitative.Update: I also thought I should say that this is no big deal, he has some different ideas about what's ok and what's not and I see that every day, I'm not mr perfect either.I guess the reason it's interesting in this case is because he is head of facebook and entrusted with a lot of people's personal information. If his judgment is different to mine then I don't feel comfortable entrusting him with my social life.",
        "children": [
          {
            "author": "sjg007",
            "text": "Facebook is his thing, and he wants people to be public and share by default. So he is leading by example.",
            "children": [
              {
                "author": "grp",
                "text": "I hope he doesn't make a baby as a tool.\"Dear Max, we use you to make some PR. We won't give you the money we don't have. Love, Mom and Dad.\"",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "rimantas",
        "text": "I am in your camp. I cannot even say that our culture is different, plenty of people fillin up FB with photos of their kids, but this just looks so wrong to me.\nAnd in this case, some mix of PR and bragging.",
        "children": []
      },
      {
        "author": "abc_lisper",
        "text": "With you littletimmy. I couldn't read it after first few lines.",
        "children": []
      },
      {
        "author": "myth_buster",
        "text": "I would like to draw your attention to the time when the fb hit the privacy scandal and it was brought to light that the founder and CEO was too privacy conscious and shared little to nothing on his site.May be I'm too cynical as I see that there was a conscious effort to post more updates. Recently I see another shift following the Internet.org initiative.",
        "children": []
      },
      {
        "author": "rustynails77",
        "text": "There are at least two sides to this.  Mark is speaking openly and stating his view to set an example to others.  I applaud that.  There may be better ways to achieve this, but I feel this personal approach is a very positive gesture.On the other hand, you have the Leonardo Di Caprios of the world who are very philanthropic and try to make the world a better place without open letters like this.I personally am not offended by Mark's approach (and I'm not a fan of Zuck).  I'd rather see someone express benevolent intentions than just about any other alternative (including silence, or prejudice/hostility/etc that seems so common today).",
        "children": []
      }
    ]
  },
  {
    "author": "SCAQTony",
    "text": "He just put his baby into the public eye; now it's paparazzi bait like some Prince's kid in England",
    "children": []
  },
  {
    "author": "7cupsoftea",
    "text": "This is very admirable. Hats off to Mark Zuckerberg. Very well done!",
    "children": []
  },
  {
    "author": "djhn",
    "text": "Zuckerberg isn't planning on retiring.He will rival Bill Gates in the magnitude of philanthropic contributions.And in other news Facebook Notes is challenging Medium as the default one-column publishing tool.Note as well, that of all the immaterial goods that have the potential to create immense value to people and humanity, education and health are the ones strongly highlighted. Global equality is there, but to a critic this too will be seen as another factor in building and supporting an ever-growing, and long-living, consumerist middle class.There is very little said about freedom, democracy, privacy, justice or self-determination. Even if this reading is unfair, cynical or simply too demanding of what this text and announcement is. Not to mention detracting from what is otherwise a highly admirable act.",
    "children": [
      {
        "author": "boxy310",
        "text": "According to the Bill & Melinda Gates Foundation's financial declarations [0], assets as of December 2014 read at a hair under $45 billion. This very much rivals the size, even if it will take some time to build momentum and make as much of a difference as the Gates Foundation has to date.[0] http://www.gatesfoundation.org/Who-We-Are/General-Informatio...",
        "children": []
      }
    ]
  },
  {
    "author": "6stringmerc",
    "text": "Okay, maybe it's just me, but after reading the introduction and getting through the list of extremely difficult \"Can we...\" challenges followed by the \"We must...\" directives, the first quote that popped into my head was a variation of “a poor man is crazy, but a rich man is just ‘eccentric.’”I get the desire to solve the world's ills, of society's shortcomings, of essentially fixing the thousands of years of evolutionary programming to craft a utopia. What sane person would sit down and say \"You know, when I die, I want to leave the world a chaotic fireball of pain and suffering\" in all seriousness? Maybe I'm significantly jaded, but I hope I'm not the only one who finds such a letter a little bit narcissitic, brought to you by the originator of one of the most narcissitic platforms of the modern era, and hosted on that very platform, naturally.>Our generation grew up in classrooms where we all learned the same things at the same pace regardless of our interests or needs.This isn't true at all. \"Our\" generation grew up with having to work to acquire knowledge. To spend time in the library. To sit down and read. To think. It took time, effort, opportunity, and personal investment - so much of which is no longer a priority now.>The internet is so important that for every 10 people who gain internet access, about one person is lifted out of poverty and about one new job is created.Citation needed. Like, really.",
    "children": [
      {
        "author": "rfrank",
        "text": "I personally can't stand this sort of thing because it conflates something personal/intimate with a press release, and that's just kinda gross to me.",
        "children": [
          {
            "author": "6stringmerc",
            "text": "Oh for sure, there's a level of intimacy involved that, in a way, acts as a buffer against criticism.To criticise the lovely sentiment would be like pointing out a child making a half-dozen spelling errors in their letter to Santa Claus.",
            "children": [
              {
                "author": "rimantas",
                "text": "Except in child case you don't doubt their sincerity.\nIn this case I have doubts was this written by parents or by PR department.",
                "children": []
              }
            ]
          },
          {
            "author": "throwaway999888",
            "text": "You're saying that her daughter won't get the warm fuzzies in 20 years time over a PR release veiled as a \"future note to our daughter\"? Me neither.",
            "children": [
              {
                "author": "olewhalehunter",
                "text": "Either way, if Zuckerburg doesn't live up to his promise, his daughter is going to be as schizophrenic as the world her father helped create.",
                "children": [
                  {
                    "author": "overgryphon",
                    "text": "Parenting style doesn't cause schizophrenia.",
                    "children": [
                      {
                        "author": "olewhalehunter",
                        "text": "If your parental style happens to include sexual abuse, yes it does. Whether a parental style consisting of a hyperreal social platform and being the child of the man who created it causes a serious rift in your sense of reality remains to be decided.",
                        "children": []
                      },
                      {
                        "author": "goldenkey",
                        "text": "It causes latent anxiety issues which can cause drug use which can then then increase chance of mental and physical diseases.",
                        "children": []
                      },
                      {
                        "author": "triangleman",
                        "text": "Have you heard of the \"double-bind hypothesis\"?",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "sevensor",
            "text": "Contrast this with Ta-Nahesi Coates' public, yet deeply personal, Letter to My Son.",
            "children": []
          }
        ]
      },
      {
        "author": "ciconia",
        "text": "Whether or not the letter is narcissistic, one has to admire their initiative. It is not, unfortunately, the obvious thing to do, and they deserve to be applauded for that.Whatever personal faults the man has, I'd argue this kind of philanthropy more than makes up for it.",
        "children": [
          {
            "author": "6stringmerc",
            "text": "That's fair, but if you notice a great deal of the letter is simply telling the child about the great achievements and dreams of the parents - if there's one thing I've learned the hard way, it's that dreams are easy to put into words and fuckin' hell on wheels to make reality. Philanthropy is a good social construct, for sure. I guess maybe I just have some inherent bias against preaching from atop the mountain of wealth inequality, a position that was obtained through a combination of luck and timing as much as any pure personal willpower and genius.",
            "children": [
              {
                "author": "mikeg8",
                "text": "I think you were right in your initial comment about being \"significantly jaded\". The dude is literally trying as hard as he can to fix problems in the world but both your comments do little other than detract from his effort/energy.",
                "children": [
                  {
                    "author": "Retra",
                    "text": "What problems do you think his letter is fixing?",
                    "children": [
                      {
                        "author": "CodyReichert",
                        "text": "The letter doesn't do much fixing, but the billions of dollars do.",
                        "children": [
                          {
                            "author": "bigbugbag",
                            "text": "But do they fix the problems they have caused during their collection and transport to Zucker's pockets ?",
                            "children": []
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "author": "bigbugbag",
                    "text": "A PR stunt, which this is, is not fixing any problem in the world. Besides, the guy is responsible for some of the world problems and his corporation is pushing to worsen some of those issues because it fits its own agenda and profit.Let him clean up his act and his company's first, until then he has zero credibility.This Zucker is no Manoj Bhargava.",
                    "children": []
                  },
                  {
                    "author": "gnaritas",
                    "text": ">  The dude is literally trying as hard as he can to fix problems in the worldlmao, you're kidding right?",
                    "children": []
                  },
                  {
                    "author": "6stringmerc",
                    "text": "Well as a scholar I learned there's merit in taking a contrarian position for the purpose of discussion and analysis. I'm not so sure he's \"trying as hard as he can\" as you would put it, because if he was, then he'd be so confident in his abilities that he'd donate everything now and the letter would explain to his daughter why he didn't leave her more than a basic trust fund for college expenses rather than millions. Hey if you want to get in line and shake his hand for doing what is, fundamentally, the right thing, then great! More power to you!But, you know, he could've done all this in private and given her the letter when she turned 16 or 18 or whatever.",
                    "children": []
                  }
                ]
              },
              {
                "author": "Radim",
                "text": "Enough to be the next in line for the Nobel Peace Prize.A worthy successor to president Obama there.",
                "children": []
              }
            ]
          },
          {
            "author": "grp",
            "text": "What about the concrete initiative of just paying taxes in each countries where the real business is done?",
            "children": [
              {
                "author": "Omniusaspirer",
                "text": "If you're in the US and want to actually make the world better there are ridiculously more efficient ways to do so than handing your money to the government. Tax dollars paid in the US are probably more of a negative force in the world than a positive one when you consider the damage our military and corporate subsidies have done over the last 50 years.",
                "children": [
                  {
                    "author": "scott_karana",
                    "text": "Facebook has oodles of untaxed cash by virtue of the Double Irish, so it could choose any of a number of EU governments to invest charitably in. Not just the USA.I wonder what Greece would think of free cash injections, for example? What could improved infrastructure do for that struggling country?",
                    "children": [
                      {
                        "author": "markyc",
                        "text": "what makes you think pumping even more free cash into greece would help anybody but a select few that handles that cash? just throwing cash at problems rarely fixes them, what these guys are trying to do (zuck, gates, etc) is create a movement that goes for the root of the problems. it's quite encouraging and kudos to them",
                        "children": [
                          {
                            "author": "scott_karana",
                            "text": "Greece was a random (and poor) example.The pith of my point was that Facebook does not need to repatriate money to America and get taxed to do good, contrary to my post's parent's assertion. There is plenty of good to be done all over the world, and Facebook already has untaxed pools of Euros to use.",
                            "children": []
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "author": "grp",
                    "text": "I don't disagree, but it's not because his wealth is actually valued at 45B that he deserves more democratic power than me or anyone else in the US or the world.This trend for \"corporations can make the world better\" is misleading. Everyone else has failed: military corp, narco, public corp (as in ancient urrs), ... If only one has succeed, we should see it.",
                    "children": []
                  }
                ]
              },
              {
                "author": "brbsix",
                "text": "If Facebook were to pay taxes \"where the real business is done\" (assuming there is a legal way to avoid doing so), it would probably be considered gross negligence. I imagine the same is true of any multinational.Besides, Facebook can put that money to much better use than government. All the lowly users of Facebook on the other hand do not know how to best spend their money and had better hand it over. Zuck says so (so do Gates and Soros).",
                "children": [
                  {
                    "author": "bigbugbag",
                    "text": "I have yet to see unemployment checks from facebook, or social security, or public services or infrastructure. But I've seen budget cuts and austerity and the GAFAM's tax evasion plays a role in this.The point is that if facebook were to stop its tax evasion business, it would probably not be profitable.",
                    "children": [
                      {
                        "author": "jsprogrammer",
                        "text": "If you are taxed, you are, by definition, profitable.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "author": "grp",
                    "text": "I don't think 'internet.org' is the best way to teach the lowly users how to best spend their money.The responsability of teaching should be public (so like a government), not just 3 random guys.Zuck also says \"you need to work in a hangar\"... Nah, I want my workplace to be better than my home.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "author": "wnissen",
            "text": "Exactly. Bill Gates came late to the game. He pretty much had to conquer the whole world before developing an interest in philanthropy. Now it's his \"real work\" and I guarantee you he'll be remembered more for that than MS-DOS!Zuckerberg, like Gates, is a brilliant but deeply flawed person. However, Zuckerberg appears to be maturing much faster than Gates. I have lots of hope for him left.",
            "children": [
              {
                "author": "lottin",
                "text": "To be honest, I think this \"interest\" in philanthropy is simply due to the diminishing returns of money: the more money you have, the less value each unit of money has to you, therefore you feel more inclined to give it away for good causes.",
                "children": []
              },
              {
                "author": "jimbokun",
                "text": "\"However, Zuckerberg appears to be maturing much faster than Gates.\"Most likely, due to having Gates as an example and inspiration.",
                "children": []
              },
              {
                "author": "marincounty",
                "text": "I've never felt Mark was brilliant.  Would a brilliant man know what an average man wants, or really values?  I'm not knocking the guy, he just never struck me as being brilliant.\nMaybe being kinda average is a blessing?I'm am greatful these billionaires are giving away their money.  I've seen so many wealthy families who are absolutely misserable.  Why not give it to good causes?  His gift to his daughter is not monetarily spoiling her?That said, I wish more would just give the money without any strings.  Set up the foundation, vet the BOD, and walk away.  Just because you are good in business, why would anyone think they are in any position to know how to fix societies problems?  Most of these guys gave lived most of their lives in a bubble.On the other hand, I have yet to see a charity/foundation that I completely trust.  The more I look into so many charities/foundations; the more cynical I get.I do like Mark much more today than yesterday though.  You made a great move Mr. Zuckerburg!I hope your charity dies wonderful things.(I didn't even read the article.  I'm just assuming he's actively involved?  If wrong, I applogiguse!)",
                "children": []
              },
              {
                "author": "bjwbell",
                "text": "Overwhelming evidence is needed that Gate's philanthropy will be remembered more than his computing career. Carnegie is remembered for steel before philanthropy.Carnegie's wiki page \"Andrew Carnegie was a Scottish-American industrialist who led the enormous expansion of the American steel industry in the late 19th century. He built a leadership role as a philanthropist for the United States and the British Empire.\"",
                "children": []
              }
            ]
          },
          {
            "author": "bababouy33",
            "text": "Hmmmm. Is locking down the entire internet worth $45B?",
            "children": []
          },
          {
            "author": "bigbugbag",
            "text": "Well, if you consider the double irish with a dutch sandwich designed to take that money from states (who would use that money to finance stuff such as public services, medical insurance, social welfare,etc.), the market manipulation during the IPO, the spammer methods and a transnational corp whose business is the collection of personal and private data from users while trying to replace the web/internet among other wrongdoings, all to put that money in zucker's hands (and a few others) then it becomes obvious that this has nothing to do with philantropy or altruism, to the contrary it's narcissicism, ego and maybe guilt.",
            "children": [
              {
                "author": "olewhalehunter",
                "text": ">to the contrary it's narcissicism, ego and maybe guilt.Lets not kid ourselves here, Zuckerburg probably likes to think he is God, and with his investments into VR also probably sees his daughter as one of last to be born in anything resembling the natural world.  To begin to even try to assign any sort of psychological pathology or diagnostics would be futile. We'll have to hope the universe has a way to keep tech monsters like him in check or that he realizes playing neuromancer with the parents of his child's friends destroyed any sense of authenticity in his daughter's life.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "chejazi",
        "text": "You're right in that a lot of this is common sense. But I think the strength of the message is in making the implicit, explicit. It's the same reason people suggest \"writing things down\" rather than letting thoughts/plans live in your head. When times get tough, or things go sideways, you have a manifesto to fall back upon to keep your vision clear and to hold yourself accountable to your original intents.",
        "children": []
      },
      {
        "author": "grp",
        "text": "I would like to see the citation too.Joke: in the late 80s, Stasi employed nearly 1 person for 50 people in East Germany. They just say they can do that 5 times better with internet, not impressive in 30 years of technical progress. Give us more!",
        "children": []
      },
      {
        "author": "droopybuns",
        "text": "His Charity is so great- that He simultaneously saves the world's poor while providing fodder for season 3 of Silicon Valley.",
        "children": [
          {
            "author": "amalag",
            "text": "If only he had put something in the letter about how the opening of car doors has improved so much in the last 100 years.",
            "children": [
              {
                "author": "askafriend",
                "text": "We've got cars where the doors go ~~like this~~!",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "Mikeb85",
        "text": "The internet does democratize access to information, but part of me thinks that for every job the internet created, Facebook destroys by wasting peoples collective time...",
        "children": [
          {
            "author": "Cthulhu_",
            "text": "\"I'm just going to quit my job / school so I can go on Facebook all day!\", said no one ever. Ten years ago, few people could boast that they could reach out to hundreds of people all at once; I'd not call that a waste of time.",
            "children": []
          }
        ]
      },
      {
        "author": "nathanvanfleet",
        "text": "I sounded like a useless thing until he actually pledged the resources to do something. But it does indeed sound crazy, even if it is I hope that it does something positive for the world.In some ways \"how can any two people actually have the power to fix so many problems\" is somewhat defeated by the fact that these two people have 45 billion dollars and not to mention plenty of influence.There are plenty of people/companies that seem to be working very hard to do make inequality worse so it's nice to hear a powerful figure say that are somewhere from neutral to positive.",
        "children": [
          {
            "author": "ant6n",
            "text": "It seems kind of strange that those people with this unfathomable multiple of normal people's power and wealth talk about wanting to work towards equality.",
            "children": []
          }
        ]
      },
      {
        "author": "bababouy33",
        "text": ">Our generation grew up in classrooms where we all learned the same things at the same pace regardless of our interests or needs.What are honors classes? What are remedial classes?",
        "children": [
          {
            "author": "brbsix",
            "text": "The variety and pace of public schooling is still very consistent when compared to the past practices or current alternatives (e.g. homeschooling, self-study, peer learning, tutelage).",
            "children": []
          }
        ]
      },
      {
        "author": "imglorp",
        "text": "Does it matter whether or not he's a narcissist or whatever reason why he does it? Or Gates or Buffet do?I say bravo, and am looking forward to the benefits of giga-scale philanthropy.",
        "children": [
          {
            "author": "Kluny",
            "text": "I dunno - careless philanthropy can cause more damage than the orginal problem.",
            "children": []
          },
          {
            "author": "6stringmerc",
            "text": "Are you familiar with the history of the robber barons and their business practices and labor's working conditions in addition to their philanthropy?",
            "children": []
          }
        ]
      },
      {
        "author": "ucha",
        "text": "Frankly, I find this is a very cynical approach to the lecture of this letter.Most everyday Joes might not have the means to change the world but it is certain that when turn into billionaire, they rarely pledge the quasi-totality of their fortune to improve the well being of others.If this is narcissistic, just let it be and be appreciate that for once, a great deal of money will be put to good use. The world is full of Koch Brothers, Saudi princes and European heirs to prove that most billionaires are more concerned about evading taxes rather than giving back.",
        "children": [
          {
            "author": "fabrice_d",
            "text": "While Facebook is not doing everything it can to evade taxation in many countries, right? And let them choose what to do with the money. Why isn't Zuckerberg pledging to drive his company as a good citizen?",
            "children": [
              {
                "author": "unchocked",
                "text": "Your question is a good response to the framing of this philanthropy as \"giving back\". Indeed, if the point of it is to give back, why not simply mold your corporate behemoth into something kinder and gentler.I don't think this sort of thing is about \"giving back\" however. I think it's something more ambitious than that: to \"do something\", do something transformative for the future.Though Zuck's manifesto isn't well thought out yet, I'm stoked that he's committed to doing something with that $45B. Because hoarding up billions of dollars into family dynasties is pretty much doing nothing.",
                "children": [
                  {
                    "author": "scott_karana",
                    "text": "> Because hoarding up billions of dollars into family dynasties is pretty much doing nothing.Well, his money isn't stuffed under sofa cushions, so it would bankers choosing what to invest in, but your point still stands. ;)",
                    "children": [
                      {
                        "author": "KayEss",
                        "text": "If the wealth is held as stock then there is no \"money\" for the bankers to do anything with. At best he can borrow money with the stock as collateral and then allow bankers to invest that.",
                        "children": [
                          {
                            "author": "jacquesm",
                            "text": "In that case he'd better pray the stock doesn't tank.",
                            "children": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              },
              {
                "author": "sokoloff",
                "text": "I would call that tax avoidance, not evasion, but no matter.Judge Learned Hand (a real person's name) wrote, \"Any one may so arrange his affairs that his taxes shall be as low as possible; he is not bound to choose that pattern which will best pay the Treasury; there is not even a patriotic duty to increase one’s taxes.\"I agree wholeheartedly.I imagine that were I in their shoes, I'd be fairly confident that I could do more good for the world by private philanthropy, directed to causes that I felt compelling, than by fueling general government spending/avarice around the world.",
                "children": [
                  {
                    "author": "pen2l",
                    "text": "> I imagine that were I in their shoes, I'd be fairly confident that I could do more good for the world by private philanthropy, directed to causes that I felt compelling, than by fueling general government spending/avarice around the world.I think that is beside the point. These companies are violating the spirit of law, not the letter of the law, when they avoid taxes. Take for example, the recent Pfizer/Allergen merger which happened merely for tax-avoidance reasons. It's legal, but it's totally uncalled for and it's clear to see why: a lot of what Pfizer stands on is from NIH-funded research, it's from us the tax-payers. Pfizer should have played fair by paying back, so NIH can fund even more studies, so that more people are employed, so that academia has more breathing room, etc.",
                    "children": [
                      {
                        "author": "sokoloff",
                        "text": "There are clear interpretations and case law that state that faithful adherence to the letter of the tax law is fine. How is one to interpret the \"spirit\" of the law when the spirit inferred by one reader is at odds with the text of the law as acted upon by someone else? It's (relatively) easy to show compliance with the letter of the law. It's (essentially) impossible to show compliance with all possible spiritual interpretations thereof.The Internal Revenue Service (of the US) writes:Avoidance of taxes is not a criminal offense. Any attempt to reduce,\navoid, minimize, or alleviate taxes by legitimate means is permissible.\nThe distinction between evasion and avoidance is fine yet definite. One\nwho avoids tax does not conceal or misrepresent. He shapes events to\nreduce or eliminate tax liability and upon the happening of the events,\nmakes a complete disclosure. Evasion, on the other hand, involves\ndeceit, subterfuge, camouflage, concealment, some attempt to color or\nobscure events, or making things seem other than what they are.Did this Dutch company purchase product/services from this Irish company?Did these two companies merge and the surviving company was the non-US company?Did this executive receive stock options on such-and-such date?Those are all relatively easy questions of fact.Should the surviving entity of the merger have been the US company? (According to whom? Or on what basis? To what end? Which benefits the investors the most? What did the shareholders vote to do with their company? Why should someone else judge that what they did was \"legal but improper\"?)The real issue is simply that the US is relatively uncompetitive as a corporate domicile (on a rates and particularly on a \"worldwide income basis\") Attempts to patch the system without addressing this root issue are unlikely to succeed in a clean and sustainable fashion, IMO.",
                        "children": []
                      },
                      {
                        "author": "russell_h",
                        "text": "Can you clarify which law (or IRS rule - I don't mean to be pedantic here), specifically, you feel Facebook is violating the spirit of?Most common tax avoidance strategies are possible due to very deliberate policies in each of the relevant jurisdictions. Its fine to claim that there is something wrong with the laws in question, but I haven't been able to identify one that strategies like the \"double-dutch\" violate the spirit of.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "author": "milge",
                    "text": "Agreed. I'd rather have my taxes being spent on worthwhile endeavors instead of half going to blow up strangers on the other side of the world. $435 hammers to line Dick Cheney's pockets? No thank you. A large portion of my taxes going towards curing cancer? Have some extra.",
                    "children": [
                      {
                        "author": "rquantz",
                        "text": "Well, military spending is half of discretionary spending, but it's nowhere close to half the federal budget. I'd rather these billionaires and corporations be paying into the commonweal and helping us to pay for the social programs and infrastructure we need that are chosen by the will of the people. Instead they get to choose whatever priority is important to them, which are sometimes helpful (malaria) and sometimes disastrous (\"education\").",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "author": "sanatgersappa",
                "text": "Because most tax money is wasted on wars and special interests.",
                "children": []
              }
            ]
          },
          {
            "author": "Swizec",
            "text": "As my mum used to say \"It's easy to shit when your butt is full\".How hard is it, really, to give away 99% when you're still left with enough to comfortably sustain 5+ lifetimes? Bill Gates said it well here: http://imgur.com/gallery/YDuoHdrThat said, I hope that if I ever get into a position like that, I too will be able to look beyond my personal greed and desire to increase the high score.",
            "children": [
              {
                "author": "tertius",
                "text": "\"I hope that if I ever get into a position like that, I too will be able to look beyond my personal greed and desire to increase the high score.\"Are you an American? Well sir, your butt is full and you're keeping it all to yourself.Stolen metaphors aside, you're in the 1% of the world and you can actually make a difference.\"How hard is it?\" You tell me.",
                "children": [
                  {
                    "author": "Swizec",
                    "text": "> Are you an American?Nope. Born in Yugoslavia (communist/socialist), raised in Slovenia (ex-socialist), now in the US for ~8 months. Don't even have my status fully resolved yet.Right now I can barely keep up with rent and building some savings. At current rate it will take me 46,875 years to save up as much as Zuck will have left over after the 99%.Next question?",
                    "children": [
                      {
                        "author": "tertius",
                        "text": "> Nope. Born in Yugoslavia (communist/socialist), raised in Slovenia (ex-socialist)Okay, top 5%. (*I'm not an American, though I too have moved here.)> Next question?\"How hard is it?\" You tell me.",
                        "children": []
                      },
                      {
                        "author": "tertius",
                        "text": "Also, try https://www.givingwhatwecan.org/get-involved/how-rich-am-i/",
                        "children": []
                      }
                    ]
                  },
                  {
                    "author": "ethanbond",
                    "text": "Since when is wealth synonymous with comfort?There are people in America who are within the top 1% of global wealth but struggle to feed themselves, or to keep themselves healthy, or to shelter themselves, etc.",
                    "children": [
                      {
                        "author": "tertius",
                        "text": "> within the top 1% of global wealth> but struggle to feed themselvesWealth means assets. If you can't feed yourself you do not have assets and therefore you don't have wealth.There is extreme lack of poverty in the U.S. (not complete, and compared to all countries). There is no reason for anyone to go without food.",
                        "children": [
                          {
                            "author": "gradstudent",
                            "text": "> There is extreme lack of poverty in the U.S. There is no reason for anyone to go without food.I'm not sure which US you're referring to but it's not one I recognise. There is massive inequality in the US that I know and the results of that are visible everywhere that I visited.  Homeless people abound like nowhere else in the developed western world that I've been to (Europe, Australia) and there is a real edge of desperation to the countless number of working poor. For example, in my experience, money is a topic of conversation that pops up way more frequently in the US than elsewhere. If it's not in the context of income (usually being too low) then it's about prices and taxes (usually being too high). Americans seem to think about these things A LOT. Also, looking around, it seems to me like everyone is always hustling for the next dollar. It's sufficiently weird and alien to me that I find it remarkable.",
                            "children": [
                              {
                                "author": "Swizec",
                                "text": "> Americans seem to think about these things A LOT.In my experience that's because Americans only talk about personal wealth/income by proxy. They won't talk about how much they earn, but they will talk about how much they pay for rent, or talk about taxes, etc.It's a way to gauge how much the people you know are making in a system where the concept of pay grade doesn't exist across companies.",
                                "children": []
                              },
                              {
                                "author": "tertius",
                                "text": "> I'm not sure which US you're referring to but it's not one I recognise.I'm from an African country and with that perspective I stand by this phrase:> There is extreme lack of poverty in the U.S. There is no reason for anyone to go without food.Name one area in the U.S. where a homeless person cannot get a meal.My claim is simple. The U.S. is the most prosperous place on the planet, the inequality doesn't touch at least a hundred other countries. Again, inequality isn't necessarily an indicator of poverty.",
                                "children": [
                                  {
                                    "author": "grumblestumble",
                                    "text": "I'm gonna go with \"what is a white South African?\" for $200 on this one, Alex.",
                                    "children": [
                                      {
                                        "author": "tertius",
                                        "text": "Takes one to know one.",
                                        "children": [
                                          {
                                            "author": "grumblestumble",
                                            "text": "you got me :)",
                                            "children": []
                                          }
                                        ]
                                      }
                                    ]
                                  },
                                  {
                                    "author": "gradstudent",
                                    "text": "> My claim is simple. The U.S. is the most prosperous place on the planet, the inequality doesn't touch at least a hundred other countries. Again, inequality isn't necessarily an indicator of poverty.The comparisons you make are on absolute terms but the reality is more nuanced. There are almost 47 million people living in poverty in the US [1] and something like 38% of the population live paycheque-to-paycheque (up from 31% in the late 90s) [2]. Even if most of those people are food-secure (something like 90% of Americans in poverty are) those numbers should still be pretty alarming. Just because the average American has it much better than the average African doesn't mean their situation is necessarily very good.[1] http://www.census.gov/hhes/www/poverty/about/overview/index....[2] http://www.cbsnews.com/news/more-americans-live-paycheck-to-...",
                                    "children": [
                                      {
                                        "author": "tertius",
                                        "text": "> There are almost 47 million people living in poverty in the USLook at the definition of poverty and you'll agree it's certainly a form of poverty, but again compared to the majority of the planet doesn't really cut it.Living paycheck to paycheck is generally an unfortunate choice or lack of education, but the point remains that there's a paycheck.And I can certainly agree that the culture of credit/debt isn't the best.> Just because the average American has it much better than the average African doesn't mean their situation is necessarily very good.I completely agree, it's not good at all. I think this underlies my point at the beginning that we need to give even if we don't have $45B. Our ability to generate the paycheck or our ownership of assets on average outstretches the vast majority of the planet.",
                                        "children": [
                                          {
                                            "author": "ethanbond",
                                            "text": "Americans are the most charitable people on earth.So you don't really have a point.",
                                            "children": [
                                              {
                                                "author": "tertius",
                                                "text": "If you read up you'll see the attitude I was responding to was contrary to that of charity.",
                                                "children": [
                                                  {
                                                    "author": "ethanbond",
                                                    "text": "So are you commentating on attitude, or on people's actual real world efforts towards charitable giving?",
                                                    "children": [
                                                      {
                                                        "author": "tertius",
                                                        "text": "Saying that \"He's rich he can give a lot. I'll give when I get rich.\"When in fact the OP is already in a position to give, he just needs some perspective.",
                                                        "children": []
                                                      }
                                                    ]
                                                  }
                                                ]
                                              }
                                            ]
                                          },
                                          {
                                            "author": "gradstudent",
                                            "text": "> Look at the definition of poverty and you'll agree it's certainly a form of poverty, but again compared to the majority of the planet doesn't really cut it.Poverty is defined along a spectrum, not relative to some kind of global nadir.> Living paycheck to paycheck is generally an unfortunate choice or lack of education, but the point remains that there's a paycheck.You're misrepresenting the situation by arguing it's a lifestyle choice. When you're poor it's very hard to save much of anything. Housing, transportation and food can quickly eat up most of a weekly paycheque.> Our ability to generate the paycheck or our ownership of assets on average outstretches the vast majority of the planet.Nobody is arguing the US the is place to be if you have money. The point I'm trying to spell out for you is that the averages you discuss are massively skewed by huge inequality. America's middle class are no longer the world's richest and they are shrinking in number. More, America is increasingly opting for a a system of governance that is leaving more and more people behind, especially its most vulnerable.",
                                            "children": []
                                          }
                                        ]
                                      },
                                      {
                                        "author": "lotharbot",
                                        "text": "There's a little nuance needed when it comes to poverty in the US, since it's based on a floating measure.[the following is copied from previous comments I've made on this subject]http://www.census.gov/hhes/www/housing/ahs/nationaldata.html\nAmericans below the poverty line in 2009 are more likely to have things like complete kitchens, complete plumbing, automobiles, air conditioning, and dishwashers than Americans as a whole in 1970. Put another way, if we used the living conditions of someone at the poverty line right now and used that to define the poverty line in 1970, over half of the 1970 population would be below the poverty line..... the definition [of poverty] is tied to CPI, which is tied to housing costs, which are more likely to include the cost of a full kitchen now than in the past especially for people near the bottom. I would argue that for someone in that position, having a full kitchen is better than not. Yet the CPI-based measure treats the cost of having a full kitchen as a negative (inflation), without treating the benefit of the full kitchen as a positive[end copied segment]Point being, the definition of \"poverty\" has some hidden inflation built in.",
                                        "children": []
                                      }
                                    ]
                                  }
                                ]
                              }
                            ]
                          },
                          {
                            "author": "tertius",
                            "text": "Anyone downvoting the parent needs some serious perspective.",
                            "children": []
                          },
                          {
                            "author": "Retra",
                            "text": "Do you consider debt an asset? If I can feed myself by going into debt, am I wealthy?",
                            "children": [
                              {
                                "author": "tertius",
                                "text": "Easy access to debt is another economic asset that most of the world does not have.If you can feed yourself by going into debt, then you have purchasing power. You need something (except if you're a student) to guarantee the loan.",
                                "children": [
                                  {
                                    "author": "nommm-nommm",
                                    "text": "Unsecured loans exist.",
                                    "children": []
                                  },
                                  {
                                    "author": "Retra",
                                    "text": "Sure, but you'll still have to pay your lenders before donating to charities. Have you forgotten your original point so quickly?",
                                    "children": []
                                  },
                                  {
                                    "author": "zardo",
                                    "text": "I'm not convinced they would be better off with it. For every American that wisely uses debt to get an education that will lead to an ROI, how many are just screwing themselves with consumer debt and degrees that don't pay?",
                                    "children": []
                                  }
                                ]
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "author": "philh",
                    "text": "The US has 4% of the world's population. If you're not in the top 25% of the US, you're not in the top 1% of the world.Europe has 10%, and Slovenia and the ex-Yugoslav countries are not known for their wealth.",
                    "children": [
                      {
                        "author": "bennyg",
                        "text": "That's a weird statistical interpretation.",
                        "children": []
                      },
                      {
                        "author": "tertius",
                        "text": "As far as population goes, you got me beat. But seriously we're talking about money, i.e. income and assets.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "author": "rdtsc",
                    "text": "> Are you an American? Well sir, your butt is full and you're keeping it all to yourself.Quite a few Americans live payday to payday. Some work many part time jobs to make ends meet. Do they in absolute dollar terms make more than someone in Africa? Yeah they do. Does it help them if they still can't pay rent? Is that supposed to make them feel better that they make more dollars per month than someone in Burkina Faso?What do you suggest that they somehow go live in Africa, and commute to US, then share the extra wealth for the betterment of mankind.> \"How hard is it?\" You tell me.Pretty darn hard.Here is some sauce, because someone will ask for it anyway:http://www.cbsnews.com/news/census-data-half-of-us-poor-or-l...http://www.bbc.com/news/magazine-21636723",
                    "children": [
                      {
                        "author": "jdminhbg",
                        "text": "I've only been through that CBS link, but it's almost comically awful; a good reminder of why you should avoid nearly every story about a complex issue from a media outlet. As a representative line:\"Mayors in 29 cities say more than 1 in 4 people needing emergency food assistance did not receive it.\"But at any rate, you completely misunderstood the parent's comment, which alludes to the fact that any American with enough disposable income to be browsing HN is in a rarified stratum of wealth globally, and has plenty of opportunity to donate it to the less fortunate.",
                        "children": [
                          {
                            "author": "tertius",
                            "text": "That's better than I put it.",
                            "children": []
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "author": "farresito",
                    "text": "Well, to be honest, the cost of living is also significantly higher than in most countries.",
                    "children": []
                  }
                ]
              },
              {
                "author": "scoot",
                "text": "5 lifetimes? That's $90M per lifetime. Comfortable is one word for it!Not to detract from the generosity of giving away the $44.5B of course...",
                "children": [
                  {
                    "author": "Swizec",
                    "text": "Yeah. If you want a salary of 100k/year for 90 years, you need ... $9M. Okay I'm bad at zeroes, it's enough for 50 lifetimes :)",
                    "children": []
                  }
                ]
              },
              {
                "author": "myg204",
                "text": "Good comment by Gates. It's the difference between giving out of your excesses and giving out of your poverty.",
                "children": []
              }
            ]
          },
          {
            "author": "gist",
            "text": "Don't know about the Saudi princes however the Koch Brothers have given away millions of dollars (and I am sure there also give away money anonymously as well).http://www.kochfamilyfoundations.org/foundationsdhk.aspAlso rest assured that Facebook also \"evades taxes\" in the same way that the Koch brothers do, that is by taking advantage of the US Tax Code in a legal way.  And none of us have any idea what the Koch Brothers have in their wills and have not publicly announced.",
            "children": [
              {
                "author": "pen2l",
                "text": "Consider as well that Facebook steals money from content creators who really need the money. See https://www.youtube.com/watch?v=L6A1Lt0kvMA & https://www.youtube.com/watch?v=t7tA3NNKF0QAlso, the idea of having Facebook at the cost of giving up your privacy to this behemoth, and more importantly, at the cost of this company exploiting your cognitive biases to get you to buy things hardly seems conducive to a spirit of bettering the world.",
                "children": [
                  {
                    "author": "bigbugbag",
                    "text": "Not sure why the downvotes, your point is valid. Though it should not be a surprise, facebook business is designed as such (empty shell to be filled by the facebook used + everything shady and dirty trick in the book).",
                    "children": []
                  }
                ]
              },
              {
                "author": "rewqfdsa",
                "text": "One of the organizations the Koch brothers fund is FIRE, which is dedicated to free speech on college campuses. It's really hard to find fault in that. I really hate the Manichean judgment common in modern public discourse. Everyone is either a saint or a devil, depending on which side you're on.",
                "children": [
                  {
                    "author": "orangecat",
                    "text": "It's really hard to find fault in that.Not that hard. Social justice advocates increasingly view support of free speech as equivalent to defense of racism/sexism/homophobia/etc.",
                    "children": [
                      {
                        "author": "tlrobinson",
                        "text": "Which is a little insane given marginalized/minority groups are typically the ones who need freedom of speech the most.",
                        "children": []
                      },
                      {
                        "author": "EGreg",
                        "text": "Yeah, some offshoots of social justice have metastized into fascism. Who gets to decide what censorship will take place in the name of this justice?",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "author": "scoofy",
                "text": "David Koch, worth 44,200 million dollars, is donating literally millions?!? How generous of him to give away approximately 0.002% of his fortune here and there.Please be serious. This comparison is laughable, the ≈ $300M listed on his foundation is literally 0.7% of his net worth.",
                "children": [
                  {
                    "author": "bobbles",
                    "text": "..and who the hell are you to determine where someone donates their money??",
                    "children": [
                      {
                        "author": "g_delgado14",
                        "text": "or lack thereof.",
                        "children": []
                      },
                      {
                        "author": "calibraxis",
                        "text": "Perhaps you should not publicize press releases and webpages detailing money you allocate \"altruistically\", if you do not wish others to comment.(Throughout history in many cultures, people gain status by ostentatious gifts of wealth. Of course, that means you have to tell everyone of your benevolence. And as everyone knows, Koch uses his wealth — and shows like this — to wield enormous influence in politics.)",
                        "children": []
                      },
                      {
                        "author": "scrollaway",
                        "text": "GP wasn't determining where someone donates their money. GP was pointing out that putting the Koch brothers in that comparison is ridiculous given their net worth.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "author": "hoorayimhelping",
                    "text": "How much of your wealth do you donate?",
                    "children": [
                      {
                        "author": "adrianN",
                        "text": "The marginal value of money is small. If I had ten times as much money as I have now, I would stop working and travel a lot more. If then my wealth magically multiplies by another factor of ten, basically nothing would change.",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "jlarocco",
            "text": "> Most everyday Joes might not have the means to change the world but it is certain that when turn into billionaire, they rarely pledge the quasi-totality of their fortune to improve the well being of others.> If this is narcissistic, just let it be and be appreciate that for once, a great deal of money will be put to good use. The world is full of Koch Brothers, Saudi princes and European heirs to prove that most billionaires are more concerned about evading taxes rather than giving back.I'm not so sure that's true.  The ultra-rich actually donate a huge amount of money.  Just last July a Saudi Prince announced he was donating over $30 billion to \"philanthropic causes\".  And back in 2012 a bunch of them pledged to give away \"half their wealth.\"And those are just a couple of the bigger examples I found in 2 minutes of web search.Also, I've never heard of anybody volunteering to pay more taxes.  Everybody tries to pay less, so it's silly to fault the rich for doing it just because they're saving more in absolute terms.Link 1: http://fortune.com/2015/07/01/saudi-prince-alwaleed-donation...Link 2: http://www.christianpost.com/news/over-125-philanthropist-bi...",
            "children": [
              {
                "author": "knughit",
                "text": "Unfortunately, alQaeda/Daesh is a philanthropic program in House of Saud's point of view.",
                "children": []
              }
            ]
          },
          {
            "author": "6stringmerc",
            "text": "The more I think about the letter, the more I'm reminded of the poem Ozymandius. Are you familiar with it? The crux of the poem, up for interpretation, is that all empires are led by men of great confidence and eventually they return to dust over time. You know, like MySpace did before Facebook.",
            "children": []
          }
        ]
      },
      {
        "author": "danielrm26",
        "text": "Man tries to help the world with his money and he's greeted with criticism.",
        "children": [
          {
            "author": "arasmussen",
            "text": "Welcome to Hacker News.",
            "children": []
          },
          {
            "author": "kuschku",
            "text": "Man evades taxes, scams his coworkers, conceals a press release as \"letter to daughter\" and is greeted with \"He just wants to do good\".",
            "children": [
              {
                "author": "BtM909",
                "text": ">Man evades taxes\nHe or Facebook as a company?>scams his coworkers\nCitation or clarification much appreciated :)",
                "children": [
                  {
                    "author": "bigbugbag",
                    "text": "I suppose it is related to Cameron Winklevoss, Tyler Winklevoss, Divya Narendra and the out of court settlement.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "author": "andreyf",
            "text": "I don't think cynicism and criticism are the same here. This is the man that about a decade ago who called his users \"dumb fucks\" for trusting him with their personal data [1]. The same man who used failed password logins to Facebook to access a journalist's email address [2].Now he's giving 99% of his wealth to a charity he controls. This is an awesome step: dynastic wealth is stupid. However, it will take a few more good deeds to convince me that he's grown out of his youthful moral indiscretions.1. http://www.businessinsider.com/well-these-new-zuckerberg-ims...2. http://www.businessinsider.com/how-mark-zuckerberg-hacked-in...",
            "children": [
              {
                "author": "visakanv",
                "text": "What in particular would Zuck have to do to convince you that he's \"grown out of his youthful moral indiscretions\"?",
                "children": [
                  {
                    "author": "andreyf",
                    "text": "The most important measure is how well he weaves his core principles stated here into how Facebook makes its money (the way Jobs did with Apple).More specifically, I worry that Internet.org is an advertiser-funded competitor to the user-funded internet as we know it, and that the interests of advertisers are in many ways contrary to the interests of individuals (e.g. w.r.t. privacy).Information pipes are a really important building block to a thriving political and economic ecosystem, and for those blocks to be sturdy, it's important that these pipes have built-in privacy protections which remove a lot of value advertisers derive from them.",
                    "children": []
                  }
                ]
              },
              {
                "author": "gnaritas",
                "text": "> Now he's giving 99% of his wealth to a charity he controls.Which is just a way to setup a comfy retirement where you make more from the money than you have to give away to be considered a charity and everywhere you go is now \"business\" as long as you give some money away on the trip. Make 30% on investments, give away 10%, avoid all kinds of taxes and appear charitable all the while still in control of the whole fortune.  Color me skeptical.",
                "children": [
                  {
                    "author": "onewaystreet",
                    "text": "> Make 30% on investments, give away 10%Any profits made from investments go back into the charity's holdings. This is a good thing.",
                    "children": [
                      {
                        "author": "gnaritas",
                        "text": "\"Charity\" being Zuck's control.  I don't think it's a good thing, I think it's a fancy way to avoid taxes (victimizing american taxpayers) while maintaining control of your fortune. When he gives his money to a charity that isn't his other pocket, then it's charity.",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "bigbugbag",
            "text": "You should not accept such a blatant PR stunt at face value.Why the Rich Give to Charity[1]Some give out of vanity. Some out of guilt. Some for the tax breaks. Some give out of conviction that their success in business makes them equally expert in solving the world’s problems.\nYet perhaps the most powerful and common reason why the rich give is the idea most commonly referred to as “legacy.”would you rather be remembered as that guy who build the biggest and meanest personal data collection machine, tracking people, extending global surveillance, pushing to destroy the foundation of the internet and made a fortune out of it (and a little stock trickery), or as the guy who gave most of his billions of money to charity ?[1]:http://blogs.wsj.com/wealth/2012/03/08/why-the-rich-give-to-...",
            "children": [
              {
                "author": "markyc",
                "text": "so what?if he's really giving 99% of his wealth to charity, and on top of that puts effort into where the money goes and that it's put to good use, why do you care that he's doing that for legacy?",
                "children": [
                  {
                    "author": "gnaritas",
                    "text": "> if he's really giving 99% of his wealth to charityBy \"charity\" he means himself, his own charity foundation.  He's basically putting the money in another pocket and calling it charity. It's a tax avoidance scam. Cheaper to give away 10% a year in the guise of charity than actually pay the taxes you'd owe.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "author": "fieryeagle",
            "text": "Not money, shares.Any public letters are carefully crafted pieces of PR, intention notwithstanding. The criticism probably stemmed from that angle.",
            "children": []
          }
        ]
      },
      {
        "author": "GregBuchholz",
        "text": "Did someone say narcissist?  May I introduce you to: http://thelastpsychiatrist.com/",
        "children": [
          {
            "author": "dombili",
            "text": "I miss him.",
            "children": []
          }
        ]
      },
      {
        "author": "dump100",
        "text": "Too me it looks a reasonable.>brought to you by the originator of one of the most narcissitic platforms of the modern era, and hosted on that very platform, naturally.Facebook is only as narcissistic as its user, it is as much about taking part in other peoples activities, by commenting/sharing as it is about personal propaganda.>\"Our\" generation grew up with having to work to acquire knowledge. To spend time in the library. To sit down and read.You are ignoring difference in quality of library, value of teachers and external stimuli in learning.",
        "children": []
      },
      {
        "author": "imgabe",
        "text": "Yeah, he wants to give away tens of billions of dollars to help reduce poverty and fight diseases. What a narcissistic jerk.",
        "children": [
          {
            "author": "itistoday2",
            "text": "With Mark, saying and doing are two completely different things.Example: \"Helping poor people in third world countries get online\" turned out to be: \"Deceiving poor people in third world countries into using something called 'Internet' that's actually 'Facebook with apps', and depriving them of real online access.\"That whole thing ended up being an attack on the free and open web.\"Share with friends only\" is short for \"Share with friends and FB employees and PRISM-subscribers while we decide who gets to see what you shared.\"I could go on for quite some time.Somehow all the \"help\" he tries to provide ends up increasing his control over other people's lives while disempowering them.",
            "children": [
              {
                "author": "vasilipupkin",
                "text": "Looking forward to your multi-billion dollar donation to combat the evil genius of Mark Zuckerberg",
                "children": [
                  {
                    "author": "meric",
                    "text": "The key to refraining from interfering with other's lives is to refrain from interfering with other's lives even that other is trying to interfere with us. Or we would end up just like them.\"The means is the end.\"",
                    "children": []
                  }
                ]
              },
              {
                "author": "imgabe",
                "text": "The last time I checked, using Facebook was entirely voluntary. The existence of it takes away nothing. You have everything you had before, and also the option to use Facebook or not. There's nothing disempowering about that.",
                "children": [
                  {
                    "author": "itistoday2",
                    "text": "Thankfully you're right, Facebook is not—yet—capable of disempowering the entire world by its mere existence. But it does disempower its users, and the more users it gets, the more it disempowers even those who don't use the system thanks to those \"network effects\" that everyone is after.It's not inconceivable that at some point some country (perhaps very close to home) might decide that having a Facebook profile is mandatory in order to operate a business. With their Real Name™ policy it might even be useful for registering citizens. You can see this already happening on a smaller scale with some companies requiring Facebook login in order to use their product or service. I see others calling Facebook a \"public utility\", seemingly unconscious of where that road leads.Sure, you can say all of that is still \"voluntary\". You don't need to use that product and you don't need to even be a citizen of the United States. You could move to some part of Africa where Facebook has not yet commandeered the social infrastructure. But, somewhere around that point I think most would agree that the word \"voluntary\" ceases to have any real meaning.",
                    "children": [
                      {
                        "author": "zaphar",
                        "text": "    I see others calling Facebook a \"public utility\", \n    seemingly unconscious of where that road leads.\n\nIf I were Facebook there is a line I wouldn't want to cross. As soon as you become a \"public utility\" you get regulated to oblivion.",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "threeseed",
        "text": "> To spend time in the library. To sit down and read.Maybe you need to think more broadly.Not every school had a library. Not every child had the ability to spend substantial amounts of time in the library. And there definitely wasn't the breadth and depth of content we have today especially if you were more advanced in your learning. I grew up in the 1980's and was very interested in learning more about computing. Guess what. 1-2 books. And I was in an pretty affluent, middle class school. It wasn't until I got access to Compuserve that my knowledge grew.> Citation needed. Like, really.Zuckberg was quoting a study from Deloitte:http://www2.deloitte.com/uk/en/pages/technology-media-and-te...",
        "children": []
      },
      {
        "author": "bertil",
        "text": "> for every 10 people who gain internet access, about one person is lifted out of povertyThat particular number is… shall we say “often” used by Facebook’s PR? (Another way of expressing that comes to mind, but I'm not sure how to spell 'jackhammer').The source is presumably the numbers in there:\nhttp://www2.deloitte.com/content/dam/Deloitte/uk/Documents/t...\nmatched with the corresponding internet adoption in those countries at the same time. The parallel is discutable, expressly so.Full disclosure:\nI tried and wasn’t able to match those numbers myself (with internal ressources, when I was working for Fb); I would strongly encourage anyone curious to go through the methodology notes: there are many things that deserves to be discussed around equality, literacy, institutional change. Basically, things that are looked at independently by the Oxford Internet Institute (OII) and the Society for Institutional & Organizational Economics (SIOE, formerly ISNIE). Neither institution have been involved in that estimation as far as I can tell — and they would have tremendous impact on the nuanced understanding of those forces once they do.I believe that Facebook can have a dramatic impact on emerging markets, especially with their advertising platform; I know personally who works on measuring that, and I know it is too early to have a proper macroeconomic estimation — but the impact should be very encouraging: there are many places where you cannot grow your business easily.In the meantime, I would take that argument as:\nMark Zuckerberg wants Facebook, Internet.org and internet access in general to lift people out of poverty and into jobs. That means that arguments that argue against his efforts that involve negative effects less than a tenth of “being about to feed their family” will seem quaint to him. Measuring all impacts into orders of magnitude like that can seem a heartless exercice to many, but should not feel foreign to a regular reader of HackerNews.On the other hand, this also means that efforts that connect internet technology with finding or creating jobs should have MZ’s undying support (modulo a possible ad fee).What I believe is more interesting are things like:\nDoes Internet favour local commerce or international transactions? (Unclear)\nAre devices and platform used for business similar to those used for personal transaction? (Apparently, yes.)\nWill West Africa still be ruled by Mama Benz's, even with widespread adoption the smartphone? (Three forces cannot be stopped in this universe: Death, taxes and Mama Benz's dressing up on Sunday. Samsung better adapt.)",
        "children": []
      },
      {
        "author": "Joof",
        "text": ">Citation needed. Like, really.I'm of two minds about this. This is an excellent piece of writing and is extremely persuasive and accomplishes all of it's intended goals. This is very effective writing and may change someone's opinion from emotional calls. It's very human, easy to understand and people flock to it.However; we have seen the constant and repeated abuse of using this style of writing. Advertisements are the most prominent and politics the most dystopian. It's also very easy to convince people that certain things are facts when that may be disputed or outright wrong.So there's a weird question to come out of this: how accurate and cited do we really need our emotional appeals to be? Given the effectiveness of the writing, citations seem completely unnecessary. Given the context (letter to child; although I'm fairly certain it was orignially intended for a broader audience this is what they claim) you would assume it has no need to be entirely factual, but that context is changed now that it's become a public letter. A public piece of writing should ethically cite or have some backing for any statistics they claim (in my opinion). Although overall hacker news' culture would probably say that if you make a decision, it should probably be based on real data.Personally, I think it's a piece of writing meant for a wide audience which in my opinion means they should cite any claims they make in this case. It's easy to mistake it for something else entirely because of how it's written, which is why it appears to get a pass.",
        "children": []
      },
      {
        "author": "eellpp",
        "text": "> Maybe I'm significantly jaded, but I hope I'm not the only one who finds such a letter a little bit narcissitic, brought to you by the originator of one of the most narcissitic platforms of the modern era, and hosted on that very platform, naturally.This is the problem in expressing your thoughts and feelings with words. The readers would extrapolate the words over all sort of things, rather than the essence to which those words were spoken. Its as if the speaker and his rational is subordinate to the various interpretations of those words.The essence here is that a family here feels obligated to provide a better world for their newborn child. They are using all the means at their disposal for this. And the best part is that instead of keeping it to themselves, they proclaim it the world so that others can even judge on their promises. That is an admiring, inspiring and a courageous thing to do.",
        "children": []
      },
      {
        "author": "vasilipupkin",
        "text": "I think many people, me included, get reflexively annoyed by pathos and sanctimony, because so much of it is used to justify just about the most ridiculous actions and theories and ideas.  I do, however, think, that in this case, it is possible to be utterly annoyed at the sanctimonious tone, while simultaneously celebrating the fact that so much money will be put to good use",
        "children": []
      },
      {
        "author": "orionblastar",
        "text": "The same thinking that led to building Facebook or Microsoft or any other technology company won't work for solving socioeconomic issues.Bill Gates tried 5 or so years ago to solve the problem with education with his tax shelter non-profit:\nhttps://www.washingtonpost.com/news/answer-sheet/wp/2014/06/...Test scores showed that everything he did had no effect on the scores or grades of the student. Each school he built had Internet access the latest in technology, special trained teachers, smaller classes, personalized learning, etc.If you ask me the technology can be distracting, I only say so because my son is failing chemistry because he doesn't study enough because he is distracted by Youtube videos and video games.When I was his age I was using a calculator and my father said it was a crutch that I wouldn't be able to do math in my head, and he was correct on that. I could only do math on paper because that was the way they taught us. I have to use a calculator to do math, and the technology distracted me from learning how to do math in my head.",
        "children": []
      },
      {
        "author": "samuelgrittner",
        "text": "I found it off putting how he used his daughter's birth as a PR opportunity for his philanthropy. Those events are totally unrelated but he used one to supercharge PR for the other.My opinion on philanthropy is that if you're not doing it anonymously then you're doing it more for yourself than for the cause. It becomes just another status symbol (I'm more good than you because look at that news headline of how much I donated).",
        "children": [
          {
            "author": "knughit",
            "text": "Non-anonymous philanthropy is important because it establishes a culture that encourages others to donate as well.",
            "children": []
          }
        ]
      },
      {
        "author": "joeguilmette",
        "text": "I can't say I'm surprised to see the mental gymnastics that 'the internet' is willing to engage in to cynically criticize such a massive donation and doe-eyed optimism.To paraphrase some guy on Twitter, Zuckerberg's letter is like a control in the way it measures the baseline meanness of the internet.That would be you, 6stringmerc.",
        "children": []
      },
      {
        "author": "teekert",
        "text": "Well, regardless of its accuracy it perfectly matches the sentiments I felt at the birth of my son. The emotions I felt were be deep, vitalizing, positive and made me want to fight to make the perfect world for him. If anything it shows Mark and his wife to be normal human beings. They just happen to be rich, famous and successful and so their message carries a bit farther. I hope they keep their motivation and enjoy their new feelings for as long as possible.\nThe world can very well use these emotions, at any time.",
        "children": []
      },
      {
        "author": "waterlesscloud",
        "text": "It wouldn't be HN without this being the top response to one of the richest people in the world announcing an intent to dedicate 99 percent of their wealth to the betterment of humanity.If you can't respond positively to this announcement, you really should step back and do some serious self-examination.",
        "children": []
      },
      {
        "author": "lukevdp",
        "text": "So if giving away $45billion for the betterment of the human race isn't enough, what does someone have to do to impress you?",
        "children": []
      },
      {
        "author": "theampersand",
        "text": "I understand your sentiment, but I would hesitate just a moment to judge it so quickly.It's hard to look at this sort of statement, especially when it's posted on Facebook. The source of 'Like this posts to do XYZ' or '#KonyIsABadGuy'. But really, the ideals that they strive for seem to build on those that have formed the foundation of our very society. The equality and advancement of mankind. In many ways, this seems no different than what Jefferson or Franklin had in mind.",
        "children": []
      }
    ]
  },
  {
    "author": "gesman",
    "text": "Adorable baby girl, welcome to the world.PS: stress and toxicity quite often are the real causes whereby the few diseases Mark mentioned is a consequence.",
    "children": []
  },
  {
    "author": "zobzu",
    "text": "When I read this stuff (as in the letter) I just think one thing:You guys are so full of yourselves.",
    "children": [
      {
        "author": "sp332",
        "text": "These opinions really are going to have an influence on the entire industry.",
        "children": []
      }
    ]
  },
  {
    "author": "pgodzin",
    "text": "Interesting how internet connectivity is mentioned without a reference to internet.org after that got a lot of net-neutrality heat. Regardless, great to see so much money being invested in so many great causes.",
    "children": []
  },
  {
    "author": "aswanson",
    "text": "I have had some problems with the way his company operates sometimes but I can't find a single thing he said I don't emphatically agree with here. Hat tip, Mark Z.",
    "children": [
      {
        "author": "rimantas",
        "text": "I find that I don't agree with the whole thing. It just seems like a PR stunt to me :(\nWhy the fuck are you posting a letter to your daughter across the globe? Why do you have a letter at all, can you just say it to her sometime when she is actually able to understand.\nI guess for him completely different rules apply, but my wife and I don't even post any pictures of our daughter online nor are we sharing anything about her. She should be able to decide herself, what she wants to put there, when she is able to…",
        "children": [
          {
            "author": "77ko",
            "text": "One good answer: It totally changed my perception of Facebook. If the guy at the top is trying to save the world, that automatically makes facebook a lot more appealing, not just to me and many other other I know who have historically been quite suspicious of facebook and its overly invasive privacy 'features'.",
            "children": [
              {
                "author": "pinkrooftop",
                "text": "I guess we lucked out that our wealth proclaimed leaders are benevolent",
                "children": []
              },
              {
                "author": "rustynails77",
                "text": "I will never change my perspective about Facebook.  They sell data to the highest bidder and almost certainly use that data to exploit Facebook users.(this contradicts my positive post about respecting Mark for posting the letter).It's similar to Standard Oil.  Rockefeller screwed over many businesses and jacked up the price of fuel to great detriment of society (at least in some ways).  Then, he donates the money to help society.",
                "children": []
              }
            ]
          },
          {
            "author": "danols",
            "text": "Pretty clear you didn't read the thing. The guy just pledged to give away 45 Billion dollars to try and improve humanity in various ways. Seems like a pretty expensive 'PR stunt'.",
            "children": [
              {
                "author": "bigbugbag",
                "text": "Have you read it? If you have you clearly haven't understood a word of it, he's not giving dollars but stock. And he's not so much giving it but says he will over the course of his lifetime.The PR stunt is making this public under the guise of a supposed letter to his child, he could have done all this without the media fuss.",
                "children": [
                  {
                    "author": "danols",
                    "text": "By the time he gives it away it is likely worth more than 45B. So unless he is willing to give it away on the spot the same day it is not worth anything and is just a PR stunt? Sure I don't particularly like the letter and the way he announced it or even the guy for that matter but he just committed 99% of his net worth to charity and deserve some credit for that. Not people bitching and moaning about how he did it in the 'wrong way'. Can you really commit 45B dollars to charity in a wrong  way?\nHow big portion of your money have you given to charity?",
                    "children": [
                      {
                        "author": "bigbugbag",
                        "text": "Well turns out he'll be giving he's not giving anything to a charity foundation after all but investing in a LLC investment fund / holding, you know to retain the ability to lobby and make profit and do away with the 5% rules.Thanks for the kind attempt to reframe the discussion by putting me in the spotlight but what I do with my life has nothing to do with the current matter nor with my legibility to contribute to the discussion.",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "xur17",
            "text": "This will encourage others to do similar things with their wealth, which is a good thing.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "harryf",
    "text": "> right now, we don't always collectively direct our resources at the biggest opportunities and problems your generation will face.One of the biggest problems facing kids in the west is digital addiction. Society as a whole is still collectively in denial here as adults gain from it, from parents who get some peace while the kids play with the iPad to game developers pushing out endless FarmVille clones attempting to get kids hooked enough to convince their parents to approve some in-app payments.The problem is already there - just need to look at the amount of Ritalin being subscribed - http://www.theguardian.com/society/2012/may/06/ritalin-adhd-...",
    "children": []
  },
  {
    "author": "masterponomo",
    "text": "Just wow. I asked my parents how my birth changed their lives. They said they had to invest in some good ear plugs (for themselves) as a sleep aid, and that they lost a sock drawer until I graduated to the futon. While I did not spark the solving of the world's problems, at least I did have some small impact.",
    "children": []
  },
  {
    "author": "subdane",
    "text": "No pressure or anything. Love, Mom and Dad.",
    "children": []
  },
  {
    "author": "msoad",
    "text": "This is really cool. I kind of missed notes in Facebook. How do you create one?",
    "children": [
      {
        "author": "scott_karana",
        "text": "The \"Notes\" app in the sidebar.",
        "children": []
      }
    ]
  },
  {
    "author": "ryandrake",
    "text": "Something's always bugged me about relying on philanthropy as a source of funding the public good, as opposed to the public funding the public good through taxation and the democratic process: In the former case, the public doesn't really have much of a say about where the help goes. We must rely on the judgment (and personal values) of a few rich people and hope they pick charities that maximize the benefit.Would the outcome be better or worse if we had, say, a 99% tax bracket at >$N million, and let the public decide the best way to deploy that funding via the ballot box? Would that process better align with the values of a democratic society? Or would we just get more corporate welfare, bombers and aircraft carriers?I'm not ragging on philanthropy--it's awesome that some of these billionaires understand the meaning of \"enough\" and choose to give away their fortunes to worthy causes. But is it best for society to leave it to a few lucky 'elite' to judge what is and isn't a worthy cause?",
    "children": [
      {
        "author": "dragonwriter",
        "text": "> Would the outcome be better or worse if we had, say, a 99% tax bracket at >$N million, and let the public decide the best way to deploy that funding via the ballot box?If we had that and still had charitable deductions, I suspect more public goods would be funded by charity rather than public decision-making then is now the case, since the marginal cost of charity giving would be much lower.",
        "children": [
          {
            "author": "bigbugbag",
            "text": "You're suspecting wrong. In the sense that less public goods and services are funded today on a global scale due to facebook tax evasion scheme.Even with a 99% tax on Zucker's fortune, it would still be diverting money from countries around the globe towards the US, in other words the already rich and destroying condition favorable to human life USA would get richer by making the poor poorer.In a world with no countries, it would make sense. In the current world it would be another way for the USA to abuse and exploit the rest of the world.",
            "children": []
          }
        ]
      },
      {
        "author": "6stringmerc",
        "text": "Hopefully you're not the only one, as I share your reluctance to embrace it as the \"go-to\" model of social constructiveness. There's a lot of good that comes from people \"giving back\" in one form or another, be it financial, skilled labor, or just simple time and attention when possible. I think it's admirable to want to change \"institutions\" like education for the better - I've been an advocate for 'progress' ever since I saw some of the challenges back in my own youth - but I can't help but think of such experiments as pet projects. Those can be productive, sure, but do I believe, deep down, that the Chan Zuckerberg Initiative is going to have the answer to the variety of problems that plague Chicago's South Side, New Orleans, or any number of troubled communities? Sigh, might just be me.",
        "children": [
          {
            "author": "thatswrong0",
            "text": "Would you voluntarily give more taxes to your governments? Or would you rather donate that money to a charity of your choosing / research?> the answer to the variety of problems that plague Chicago's South Side, New Orleans, or any number of troubled communities?No one (government, private sector, etc.) has the answer to those problems. Those are really really hard problems that require the cooperation of non-profits, local governments, religious institutions, families, etc. I don't think they're expecting to be a silver bullet.",
            "children": [
              {
                "author": "dev1n",
                "text": "I, for one, would absolutely voluntarily give more taxes to my government for the sole purpose that all this shit infrastructure would be fixed up.  Put people to work on infrastructure projects and I will gladly give up more money in the form of taxes.Basic income on the premise of infrastructure renovations is something I'm fully behind and I think many more citizens would be too, specifically those getting by on food stamps.",
                "children": [
                  {
                    "author": "ryanwaggoner",
                    "text": "So you would donate to the government, but only if you could ensure that your voluntary tax dollars go to the most important thing?That's exactly why billionaires donate to their causes directly instead of letting the government allocate it; they don't trust the government with that extra money any more than you do.",
                    "children": []
                  },
                  {
                    "author": "miscellaneous",
                    "text": "Yeah so you just agreed with the above comment - you want control on where your money goes. So does Zuckerberg.",
                    "children": [
                      {
                        "author": "dev1n",
                        "text": "Economically speaking, giving people jobs is far better than tossing 100 million dollars into schools where the students home life is the true source of abandonment in society.This is a well received economic theory, not a way to save face on taxes by promising to give away money in the future so that I don't have to pay taxes now (Zuck).",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "author": "anon1385",
                "text": ">Would you voluntarily give more taxes to your governments?I already voluntarily pay more taxes than I need to. It's pretty easy to (legally) pay much less tax if you are running your own business.Also, I and quite a few other people I know don't use GiftAid when giving to charity or buying things from charities (GiftAid basically lets the charity claim back the income tax that I've paid on that money) for the reason that the government is better placed to know what projects need money than I am. They are more likely to spend the money on 'unfashionable' things that don't trigger the same emotional response in people but are actually more effective uses of money.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "vezzy-fnord",
        "text": "You're becoming too clouded in fuzzy ideals and missing the ugly reality that there is no virtuous public and democratic society, but the state. You say we must rely on the judgment and values of a few wealthy, but then completely ignore the whole landmine of public choice. Not that \"having to rely on a few rich people\" is even true.",
        "children": [
          {
            "author": "bduerst",
            "text": "That's a little nihilist.Traditionally the state has been a form of wealth redistribution, because while it may not be a true democracy, citizens still vote, and could potentially vote to have the majority of the wealth redistributed equally amongst themselves.But instead we have a power struggle between those with the means to sway others and the idealists.  While I'm sure the idealists will probably never attain their utopia, if they don't continue to share their dream we'll end up living someone else's self-serving one.",
            "children": [
              {
                "author": "jevgeni",
                "text": "I think there's a reason, why the people who attain the means to sway others stop being idealists.",
                "children": [
                  {
                    "author": "bduerst",
                    "text": "Which is?",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "author": "laughinghan",
            "text": "I don't think OP is clouded, missing the ugly reality, or ignoring the landmine of public choice. That's why most of it was phrased as a question, and even mentioned:    Or would we just get more corporate welfare, bombers and aircraft carriers?\n\nOP is wondering, not unreasonably, if that reality might be less ugly than what we have today.",
            "children": []
          }
        ]
      },
      {
        "author": "evanpw",
        "text": "One difference is that billionaires (at least the Buffett / Gates crowd) seem to put a lot more of their donations toward projects in foreign countries than the government would. Since the vast majority of people living in bad situations in the world are not Americans, I think it's very plausible that they're doing more good with the money than we would get from taxing it.",
        "children": []
      },
      {
        "author": "vikp",
        "text": "Mark Zuckerberg donated 100 million dollars to Newark public schools a few years ago, and they ended up no better for it (and arguably worse off).  Here's a great article on the topic -- http://www.newyorker.com/magazine/2014/05/19/schooled .The main reason for the failure of the donation to create positive change was that the community wasn't engaged at all in the reform process.  The first time Newark students and parents heard about the donation and the accompanying \"reforms\" were when Zuckerberg announced them on Oprah.I completely agree with your sentiment, and wish philanthropy wasn't seen as an unmitigated good thing.",
        "children": [
          {
            "author": "mempko",
            "text": "It is interesting that the same rich people created a political system that allows the public to be so disengaged.We need the 99% tax because we had it before, and at that time, the public was more engaged. It will take time, but people can learn civic skills.",
            "children": []
          }
        ]
      },
      {
        "author": "Cthulhu_",
        "text": "I'd rather see them pay a considerable chunk of those billions in taxes - which Facebook and other giant companies like it don't pay in the US due to its lax tax laws, and which they evade in other countries using various tax evasion schemes. Then there'd be more money to pay for affordable schools and whatnot.Then again, the US is more likely to spend trillions on wars abroad without those really improving their own country, so on that note, it's probably better for a philanthropist to invest the money in a charity with a singular goal, such as education or research.",
        "children": []
      },
      {
        "author": "clarkmoody",
        "text": "So would \"the people\" know of a better way to deploy Zuckerberg's fortune than the man himself?",
        "children": [
          {
            "author": "the_cat_kittles",
            "text": "why is his opinion more valid?edit: \"its his money\" doesn't explain why he would be more able to judge how to donate money, or effect positive change than someone else. i understand he is allowed to spend it how ever he chooses. the point i'm trying to make is that someone is not inherently more likely to know the right thing to do than someone else just because they have more money.",
            "children": [
              {
                "author": "boryas",
                "text": "because it's his money",
                "children": []
              },
              {
                "author": "joelg236",
                "text": "Because it is his money.",
                "children": []
              },
              {
                "author": "ryanwaggoner",
                "text": "Have you ever given to charity? If so, why? Why didn't you give it directly to the IRS? They accept donations, you know...",
                "children": []
              }
            ]
          },
          {
            "author": "msellout",
            "text": "That's the principle of the free market -- central planning is inefficient.",
            "children": []
          }
        ]
      },
      {
        "author": "vlehto",
        "text": "I think it's good to have both. Philanthropy of rich guy means three things:1. He can afford really good advisers. Democratically elected can be good. But they might be good at campaigning and only get selected because of party status.2. He can afford to monitor charities closely. And enforce legal action if they fuck around. When you invest several millions, you probably take care that they reach the destination. If you just pay little taxes that go everywhere and you also have day job, much slimmer chance.3. These individuals could fund projects that in the future give back to whole humanity. But such projects aren't always popular with the public in the start.",
        "children": []
      },
      {
        "author": "the_cat_kittles",
        "text": "i've wondered about this as well, and it seems really insane to me when you break it down. being good at making money does not imply being good at philanthropy, nor does it imply that your opinion is more valid. yes, i know there isn't a perfect solution, but isn't it silly that that's how things work now? it seems like letting the public vote would do better.",
        "children": []
      },
      {
        "author": "mgraczyk",
        "text": "I have more faith in the judgement of the system that elects billionaires than the system that elects our government.Billionaires will spend their money in more efficient and productive ways than our government spends tax dollars. You may disagree with a rich individual's vision of the future, but he will be vastly more likely to effect his vision than our elected officials.",
        "children": [
          {
            "author": "afterburner",
            "text": "Hope you're ok with whatever that billionaire's vision is.",
            "children": []
          },
          {
            "author": "TaylorAlexander",
            "text": "Perhaps billionaires will spend their money more efficiently.But they'll spend less of it on the public good.The government may be less efficient (also, citation needed there, as I don't buy that at face value), but even if it is it has access to WAY more funds.Sure, we have some nice billionaires like Zuckerberg and Gates who give their money away, but if you required all the billionaires to give up some money, you'd have a much larger pool to work with. So efficiency isn't the only part of this argument. There is also volume.",
            "children": [
              {
                "author": "tempestn",
                "text": "If you force rich people to give away a large enough percentage of their money, perhaps you will remove any incentive for the non-philanthropic ones to keep earning more money.  If they weren't inclined to give it away in the first place, they probably won't be inclined to make more, knowing they'll be required to give it away.",
                "children": [
                  {
                    "author": "deathcakes",
                    "text": "And therefore the people who end up making the most money are the people who are the most philanthropic and that is worse than the current system how?",
                    "children": [
                      {
                        "author": "tempestn",
                        "text": "Because those people are already giving most of their money away to causes that benefit the world.  The \"other\" rich people are still, on average, creating wealth though, via the companies they start and run.  If you disincentivize them from doing those things, you eliminate that wealth, leaving everyone worse off on average.",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "frame_perfect",
            "text": "The system that elects billionaires is the same as the system that elects our government.",
            "children": []
          }
        ]
      },
      {
        "author": "likerofnews",
        "text": "If you have the ability and luck to make a billion dollars, you probably have a bit more skill than the average Joe to determine where that money should go...",
        "children": []
      },
      {
        "author": "sliverstorm",
        "text": "It's not really \"as opposed to\". We have both, and I figure that's good.Each model has its strengths, weaknesses, and problems it is most suited to, just like public vs. private industry.",
        "children": []
      },
      {
        "author": "necessity",
        "text": "Do you have a say on how government spends your tax dollars? In theory sure, and in theory politicians represent our interests. In practice none of that happens and my tax money isn't spend on anything nearly as constructive as what any NGO (or foundation) is doing. Moreover, I'm obliged to contribute to whatever the fuck they want to do with my money, even if it's war. So yeah, that's better than a rich guy giving money away, right? Society already leaves it to an 'elite' to judge what to do - an elite of politicians and whoever is backing them financially. How can you be so naive?",
        "children": []
      }
    ]
  },
  {
    "author": "nbardy",
    "text": "Reading this is impossible to not to think of Bill Gates. Someone who realized the impact his money can have. Many people in this industry have been influenced by the actions of Gates, especially in the tech community. As a 20 something the money I make certainty pales in comparison to that of Gates or Zuckerberg, but even at a low rate for the tech industry it is much above that of my friends, many of who have worked much harder to get to where they are. It is difficult to be in a position to give help and refuse. Perhaps the effect Gates can have on the minds of the wealthy will be even greater than the already vast contributions he has produced.",
    "children": []
  },
  {
    "author": "throwaway999888",
    "text": "> Today your mother and I are committing to spend our lives doing our small part to help solve these challenges. I will continue to serve as Facebook's CEO for many, many years to come, but these issues are too important to wait until you or we are older to begin this work. By starting at a young age, we hope to see compounding benefits throughout our lives.In other words, I'm getting in on this philanthropy thing at a much younger age than Bill Gates.",
    "children": []
  },
  {
    "author": "hvis",
    "text": "https://www.facebook.com/chanzuckerberginitiative/\"Please log in to continue.\"Seriously? One might think they would prioritize raising awareness over increasing Facebook userbase.",
    "children": [
      {
        "author": "ymse",
        "text": "It works if you disable XHR on the page (yes, really).",
        "children": []
      },
      {
        "author": "spicyj",
        "text": "This sounds like a bug. How do you repro this? I started on the note when logged out and clicking \"Chan Zuckerberg Initiative\" brought me to that page with no dialogs about logging in.",
        "children": []
      }
    ]
  },
  {
    "author": "supergirl",
    "text": "Every rich guy thinks he knows what's good for the world. And why announce this together with the birth? Should the world celebrate this miraculous event that also led to our salvation?",
    "children": []
  },
  {
    "author": "astaroth360",
    "text": "Well, I'll say that I appreciate the effort on Zuck's part, but somehow I still can't make myself like the guy :\\Oh well, I guess I don't have to like him to appreciate that kind of cash going into worthy causes.",
    "children": []
  },
  {
    "author": "colmvp",
    "text": "I feel only on HN and Reddit can people find reason to criticize a guy who is giving away billions of dollars for humanity. Talk about not seeing the forest for the trees.",
    "children": [
      {
        "author": "myth_buster",
        "text": "I think it's a good sign if people don't take words at face value and be critical of it.",
        "children": [
          {
            "author": "kansface",
            "text": "Their public pledge to donate 45 billion dollars to charity within their lifetimes with an eye towards long term solutions deserves criticism?  Seriously, WTF?",
            "children": [
              {
                "author": "peterwwillis",
                "text": "The scope of this pledge in combination with the dollar amount would stretch so thin that it would have the net effect of giving every child in the world $20 and saying, here, go improve the quality of your life.So, yeah, if he wants to open himself up to public scrutiny with a tastless \"letter to my daughter that i'm actually making for the public because my daughter can't understand this for another 10 years\", people are going to criticize.But he has 45 billion freaking dollars, so I doubt he cares.",
                "children": []
              },
              {
                "author": "myth_buster",
                "text": "If I may paraphrase the sentiment here:Firstly,  Their public pledge to donate 45 billion dollars\n\nThat number is based on current valuation of Fb and cannot be equated to someone writing a check for $45B. If Fb goes the MySpace way, how much is that donation worth?Secondly there appears to be a duality between how the company operates and what this post tries to rally for.Finally, using the pretense of writing a letter to their newly born daughter rubs some the wrong way.",
                "children": [
                  {
                    "author": "twright0",
                    "text": "> If Fb goes the MySpace way, how much is that donation worth?If Fb goes the Google way and its value continues to go up, the donation will be worth more. It's true that the donation is of unclear value. But calling it $45 billion is a way to communicate the scope of the pledge that they've committed to.> Secondly there appears to be a duality between how the company operates and what this post tries to rally for.It's important to distinguish between the behavior of a person and the behavior of Facebook, Inc. Every time the Bill & Melinda Gates foundation does something, we don't get dozens of people rising out of the woodwork harping on Microsoft's unethical business practices - but Bill Gates' mid-90s Microsoft was definitely on par with Facebook at its worst. It's okay to celebrate good things done, as long as we don't fully forget how we got there. We should continue to criticize Facebook as a company even as we recognize that the individual here is attempting something great.> Finally, using the pretense of writing a letter to their newly born daughter rubs some the wrong way.It's a pretty easy and effective rhetorical device. The letter is obviously targeted at the world, or he wouldn't have published it. But it's a good way to present some emotional framing - this is why he cares so much, why he's invested in a better world. Not all attempts to inspire pathos in the reader are rooted in evil, it's just a tool for effective writing.",
                    "children": []
                  },
                  {
                    "author": "soared",
                    "text": "1.Now you're valuing his donation based on total value? Well using your logic everyone else donates a measly <$10k and is essentially worthless.2.Any substantiation for that?3.Okay. Should've sent a friend request first.",
                    "children": []
                  }
                ]
              },
              {
                "author": "benihana",
                "text": "The post you're responding to never said this essay deserved criticism. It said it's good people aren't taking it at face value and are being critical of it. They are not the same thing.Being critical of the claim to donate 45 billion dollars is pretty natural. First, they didn't say 45 billion, they said a percentage of their worth which right now is 45 billion dollars. You would have a very strong point if they had just delivered the check for 45 billion dollars and people were criticizing it.But they didn't do that. They wrote a post on the internet saying they're going to give away their money sometime in their lifetime.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "afterburner",
        "text": "Who runs the initiative?",
        "children": []
      }
    ]
  },
  {
    "author": "roymurdock",
    "text": "Mark has set some ambitious goals regarding poverty, disease, nutrition, and equality, and connectivity. I hope for all of our sake that he is successful in realigning many of the perverse short-term incentives through his and his Priscilla's generous contributions and efforts.I wish he had spoken more about luck and balance. This is something that Bill & Melinda Gates, as well as Warren Buffet do very well. Understanding luck and balance is the key to empathy, which is also a phrase that is missing from this letter.I also wish he had not marketed this press release as a letter to his daughter. Perhaps he has another, private letter that is actually more relevant and personal, but if I were Max, I probably wouldn't be thrilled to read this 20 years down the road.But I'm sure he had a reason to release this letter as he did, and that he thought for a long, hard time before penning these words. Best of luck to the new father, mother, and daughter.",
    "children": [
      {
        "author": "rustynails77",
        "text": "Most of these things can be achieved, but I really don't understand what most people expect from equality.  For example, does equality mean that if I sit on my ass and do nothing, I get the same as the person next to me who works their butt off?  Or does it mean that I get a fixed amount based on the effort I put in?  How is that effort measured?When people talk about equality, I'm not sure if they mean equal opportunity or equity or utopia (knowing that utopia depends on a slave class).  Maybe it means something else.The reality is that humanity has empathy and greed (noting they are not opposites).  I can not imagine that I will ever see every person equally.",
        "children": [
          {
            "author": "personomas",
            "text": "In this example, equality means that if you act in your best nature, you deserve as much as any other person who acts in their best nature. If sitting on your butt is the best thing, then yes you deserve as much as the next person, likely though sitting on your butt is not the best thing.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "anon4this1",
    "text": "I'm dismayed by the lack of focus on the environment here.  Humans as a species are doing just fine. Health gains just marginally improve that. We need to focus on finding balance with nature that doesn't involve mass extinctions and subjugation.",
    "children": [
      {
        "author": "intjk",
        "text": "I suspect he looked at his daughter and saw the faces of billions. Not to say you're incorrect.",
        "children": []
      }
    ]
  },
  {
    "author": "mei0Iesh",
    "text": "Some thoughts:* Addressing a public press release to your private child's name* Naming the initiative with your family's name* Calling for \"change now\" as if the world isn't already working very hard every day towards progress* Looks like a move out of a strategic playbook some advisers gave for \"how to be President someday\"* Looks like they're marketing themselves as the royal family, like Facebook is the new kingdom* Looks like that smug thing that's hip today where people compete to be most charitable* Reminds me of the Melinda and Bill Gates thing, and the Google medical research thingPart of this is the perspective of engineers who believe everything is solvable if you just build something to do it. If it isn't built yet, it must be because we're not working hard and fast enough. That if someone has billions of dollars, and are just willing to fund an initiative, they can take credit for curing all disease.Part of it is the fear that's faced by people who felt invincible when they become old, or have a newborn infant. When you can purchase anything, the new difficulties are things like bacteria, viruses, and entropy. When you are a god in the eyes of the society and economy, yet a worm in the eyes of biology and ecology, there's no longer a clear path towards how to solve your daily concerns. If you're poor and need food, there's simple steps you can follow to acquire what you need. But when you're wealthy, what do you do to get well from illness, to escape the pains of aging?These people, and much of the digital society today, need perspective and psychological understanding beyond what they have. But you won't see an initiative for that.",
    "children": []
  },
  {
    "author": "bababouy33",
    "text": "Wow, that's a lot of pro-facebook comments for a \"Hacker news\" site. Shouldn't you people be browsing reddit or better yet, facebook?",
    "children": []
  },
  {
    "author": "altonzheng",
    "text": "Okay yeah there might be a lot of flaws or criticisms about this, but at the end of the day, this is a net win for society. Go Mark and Priscilla!",
    "children": []
  },
  {
    "author": "jordigh",
    "text": "> Your generation will set goals for what you want to become -- like an engineer, health worker, writer or community leader.Realistically, we can't all avoid being garbage collectors or street sweepers, can we? Or will automation really replace all unsavoury jobs with high-paying professions?",
    "children": []
  },
  {
    "author": "wityak",
    "text": "Expensive shot at Bezos and his distate of charity. Well played, Zuck.",
    "children": [
      {
        "author": "spicyj",
        "text": "How is this at all related to Bezos?",
        "children": []
      }
    ]
  },
  {
    "author": "tmsh",
    "text": "I think this letter and http://givingpledge.org/ are good.But we all give away wealth when we die. To someone or another.The pledge is not necessarily one of generosity other than looking past one's family. Which is something, but less impressive along the generosity dimension than giving away more earlier (while that money has a very real opportunity cost to you).That said, if I had billions of dollars, I'd be investing in my own research and not giving it away. But that's just me.",
    "children": []
  },
  {
    "author": "queryly",
    "text": "This is amazing. Money doesn't make us live longer, but does $45 billion help bring the future sooner? I bet it does.  It will widen our horizons on what's possible.  Everyone on earth will benefit from it.",
    "children": []
  },
  {
    "author": "webwanderings",
    "text": "Never much cared for Zuckerberg but this changes my perspective.Off-topic: can Facebook please go ahead and literally kill the blogging industry by giving the ability for everyone to use these updated Notes section? As is, the majority of the referrer on the Internet is Facebook. They might as well get the blogs out of the way.",
    "children": [
      {
        "author": "shopkins",
        "text": "I agree, let's put the entire internet in Facebook. News like this just proves Zuckerberg knows best. /s",
        "children": []
      }
    ]
  },
  {
    "author": "jordigg",
    "text": "Hope many more will follow, my sincere admiration.Here the SEC filling:\nhttp://www.sec.gov/Archives/edgar/data/1326801/0001326801150...",
    "children": []
  },
  {
    "author": "awl130",
    "text": "from an evolutionary psychology standpoint, we are all driven to constantly increase our social value (and indirectly that of our offspring). once you hit a certain level of wealth, it is rational for you to shift your attention from making more money.  your social value is only increased by wealth up to a certain amount, after which the marginal returns in social capital approach zero for every additional dollar earned.  to put it simply, how much more social value do you have with $1 billion versus $2 billion?  The world is indifferent.  At that point, you are simply a rich person.once you reach such an inflection point of wealth, you must find an alternative means of increasing your social capital.  there are two common ways: one is to demonstrate your evolutionary fitness in a field completely unrelated to how you amassed your wealth: many rich get into movie production, novel writing or other creative endeavor.  These usually fail.another alternative, the safer alternative, is to expend your remaining time and resources advancing social causes (running for an elected office certainly falls under this category).  this is the simplest way for an adult, untrained in anything other than their primary business, to increase their social capital.it's not a coincidence that zuck is still willing $450mm to his offspring--more than enough to hit that inflection point.  he knows that any additional dollar beyond that inflection point provides marginal social value to his offspring.",
    "children": []
  },
  {
    "author": "dhcar",
    "text": "This seems more like PR than a genuine letter to a child. Which is fine, but I wish they'd treat it as such.They talk about facebook, donations, improving the world, their beliefs, etc. but very little on how to be a better person or how to enjoy life. Maybe I'm projecting, but what would you want to find in your pillow after moving in for your first day of college?I hope they wrote their daughter a real letter. One directed to her and not something that will be tweeted by hundreds of news organizations.",
    "children": [
      {
        "author": "soared",
        "text": "Telling her they're donating $45B seems like a clear message on how to be a better person to me. Selflessness and the desire to improve the world.",
        "children": []
      },
      {
        "author": "sparkzilla",
        "text": "Isn't the birth of a child enough of a celebration, without smothering it in a multi-page manifesto?",
        "children": []
      },
      {
        "author": "DaveWalk",
        "text": "My brain hurts just reading through this letter. I'm trying to picture my parents -- or anyone's parents! -- writing:\"Your mother and I don't yet have the words to describe the hope you give us for the future...\nOur hopes for your generation focus on two ideas: advancing human potential and promoting equality...\nWe can do this work only because we have a strong global community behind us. Building Facebook has created resources to improve the world for the next generation. Every member of the Facebook community is playing a part in this work...\nLove, Mom and Dad\"Philanthropy aside, doen's this \"letter\" read like a scene from the Silicon Valley TV show?",
        "children": []
      }
    ]
  },
  {
    "author": "Mark1999",
    "text": "Thanx Mark. Now that your CIA financed endeavour became a money making machine, you find it is about time to contribute some sort of \"philanthropy\" to the world. It is no wonder the millions of  serfs don't waste any time to congratulate you on this great action of yours. Please, a word from the world to American based institutions: Please, stop saving the world. Really, look at what your government is doing to Syria, etc supporting terrorists through CIA controlled channels. \nAnd for God's sake! Read the reports from World Bank before posting this \"i will save the world\" letter: Poverty and inequality have risen during the last years, not decreased!",
    "children": []
  },
  {
    "author": "canes2001",
    "text": "Many wealthy citizens have only used their wealth to enrich themselves and their families. It is nice to see someone that is focused on making the world a better place.",
    "children": []
  },
  {
    "author": "cpursley",
    "text": "Why are the techno-barons so focused on human health? Not that there's anything wrong with these efforts, but human disease is much less of a threat to our species and planet than an ever-increasing human population. What I'm saying is that humans have little difficulty reproducing; it's a solved problem.What's not a solved problem is our disappearing fisheries[1], rhinos going extinct all over the place[2], farmland desertification[3], tropical deforestation[4], ocean acidification[5]... From my back of the envelope math, it seems that longer lives and a larger population will exacerbate our environmental and resource issues.I'd like to see billionaires purchase large tracks of land simply for preservation. Cleaning up industrial waste from rivers. Foot the salaries of anti-poaching efforts. Get clean fusion energy production up and running. That sort of thing. Perhaps we should get our planet's shit together before tackling immortality?[1] http://www.washingtonpost.com/posteverything/wp/2014/06/03/t...[2] http://www.cnn.com/2015/04/16/africa/kenya-northern-white-rh...[3] http://www.bbc.com/news/world-africa-34790661[4] http://www.theguardian.com/commentisfree/2015/oct/30/indones...[5] http://fm.kuac.org/post/increasing-ocean-acidity-threatens-m...",
    "children": [
      {
        "author": "msellout",
        "text": "Ted Turner bought a bunch of land.",
        "children": []
      },
      {
        "author": "erkaes",
        "text": "I heard that healthy human is the key to sustainable population. Less-healthy human condition tend to make human have more babies since mortality rate on their babies are higher.",
        "children": []
      },
      {
        "author": "beccasanchez",
        "text": "Bill Gates is actually very concerned with reducing population growth.I think you have an OK point and the more intelligent rich people like Elon Musk are the ones furthering your agenda. Bill and Zuck were always too conventional to think big like this. Their conventionality was part of their success--they are both too uncreative to come up with something new but instead they know how to steal the ideas of others and make a more competitive business out of them.",
        "children": []
      },
      {
        "author": "the_economist",
        "text": "Bill Gates has teamed up with Mark Zuckerberg to form multi-billion-dollar clean energy fund: http://www.sciencealert.com/bill-gates-has-teamed-up-with-ma...It sounds like they are doing exactly what you request.",
        "children": [
          {
            "author": "fulafel",
            "text": "Investing in new energy technologies is not an effective way to address any of the problems he mentioned.",
            "children": [
              {
                "author": "ZenoArrow",
                "text": "So clean energy isn't beneficial in tackling 'farmland desertification[3]' and 'ocean acidification[5]'? You have heard of climate change, right?",
                "children": [
                  {
                    "author": "fulafel",
                    "text": "It might be marginally beneficial but it's not an effective way to combat climate change. Something else is needed to stop USA, Saudis, China and Russia from digging up the cheap oil and coal. And to stop everyone from doing all the wasteful and co2-increasing things with agriculture and deforestation etc.We need intergovernmental coordination and limits on market forces much more than we need an energy MacGuffin.",
                    "children": [
                      {
                        "author": "ZenoArrow",
                        "text": "> \"Something else is needed to stop USA, Saudis, China and Russia from digging up the cheap oil and coal.\"So you don't think cheap and effective clean energy technologies are very useful to encourage moving away from oil and coal?",
                        "children": [
                          {
                            "author": "fulafel",
                            "text": "Sure, I believe it's useful in that rich western countries continue their leisurely\ntransition to cleaner energy as it becomes cheaper, combined with gas taxes and carbon trading and such. Billionaires investing more money in cleaner energy can be marginally beneficial, though there is already large and increasing amounts of capital allocated by the markets toward this end.But the deciding factor is can we make everyone stop using the cheap fossil fuels that are basically free money lying in the ground. Oil price will follow demand. It might get cheaper if western countries cut consumption, but someone will still buy the rest with the lower price.  And there is nothing in the horizon that would displace oil and coal at their minimum profitable production prices for developing countries (where most people live) in the requisite timeframe. If we leave it to markets, this is the case by overwhelming odds, Zuckerberg or no Zuckerberg.Think what needs to happen on the world stage in order to enact a global ban (1) on oil pumping and coal mining within 20 years. That's the job. Interests of nations addicted to the oil income, interests of nations whose agriculture is entirely dependent on cheap imported oil, etc. Easy UN consensus?And this is just the energy sector, there's more to climate change drivers. So fixing this is necessary but not sufficient. The same political measures that are needed to coordinate the energy sector will also work for the other sectors. But energy tech won't.(1) A very high tax really, that 99% prevents use in fuel applications. Ban is a simpler word.edit: added bit about fossil prices reacting to demand in west",
                            "children": [
                              {
                                "author": "ZenoArrow",
                                "text": "> \"Think what needs to happen on the world stage in order to enact a global ban (1) on oil pumping and coal mining within 20 years. That's the job.\"You could aim for that, or you could aim for a steady stream of improvements leading to larger change once momentum is built. Or in other words, revolution vs. evolution. If you want to pursue revolution, go for it, I'll continue to  pursue evolution.",
                                "children": [
                                  {
                                    "author": "fulafel",
                                    "text": "Are you uggesting we don't have give up fossils that quickly, or are you suggesting we could wait 19 years and then shut down fossil fuels with a large change which would bring cheap fossils replacements for even third world countries?I do favour ramping down incrementally, and we should get started ASAP.",
                                    "children": [
                                      {
                                        "author": "ZenoArrow",
                                        "text": "I'm suggesting that instead of waiting for dramatic political and/or economic changes I will support every opportunity we get to move in the right direction, regardless of how small those changes are. The key in my opinion is building momentum. Research into clean technologies are likely to pay off eventually, even if the changes in the near term are negligible.Remember that the best way to predict the future is to invent it. If you truly want your revolution, then lead the way by action. I'll continue supporting change in my own way.",
                                        "children": []
                                      }
                                    ]
                                  }
                                ]
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "author": "bambax",
                    "text": "Dirty energy isn't the (main) problem; intensive agriculture and aggressive fishing is the main problem.Humans need to eat less meat and fish. Much less. Like, in rich countries, at least 95% less.",
                    "children": [
                      {
                        "author": "ZenoArrow",
                        "text": "> \"aggressive fishing is the main problem.\"That is a separate problem from ocean acidification. Ocean acidification is directly linked to pollution from fossil fuel usage.",
                        "children": [
                          {
                            "author": "bambax",
                            "text": "Yes, aggressive fishing is a different problem (but a problem nonetheless).Ocean acidification however, is caused by the fact that the oceans absorb the excess of CO2 present in the atmosphere; and livestock are responsible for more CO2 production than all of transportation.",
                            "children": [
                              {
                                "author": "ZenoArrow",
                                "text": "> \"Ocean acidification however, is caused by the fact that the oceans absorb the excess of CO2 present in the atmosphere; and livestock are responsible for more CO2 production than all of transportation.\"There's a common misconception that all CO2 is bad. CO2 is a natural part of the bio cycles found on Earth, what's bad about using fossil fuels is the rapid expansion of CO2 (and other gases) in the environment where life lives, which causes instability and damage as the Earth adapts.",
                                "children": []
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "bigbugbag",
        "text": "Manoj Bhargava is doing something similar: \nhttps://imgur.com/gallery/teGsT",
        "children": []
      },
      {
        "author": "yarou",
        "text": "https://en.wikipedia.org/wiki/Malthusian_growth_model",
        "children": []
      },
      {
        "author": "oever",
        "text": "You make a very good point. Currently, the largest threat to long and happy life is a destroyed habitat.",
        "children": []
      },
      {
        "author": "sireat",
        "text": "The cynic's answer is that human health is something that really rich do not have much control over.  (SJ is just one shining example)In other words you get billion dollars but realize it is all for naught as you will be worm food in 100 years.So some go full Kurzweill, some find/found religion, some do a bit of everything.This problem is not unique to billionaires but they can attempt to roll a bigger rock up the mountain.",
        "children": []
      }
    ]
  },
  {
    "author": "dpc_pw",
    "text": "Aren't this \"foundations\" essentially just tax loopholes for the rich?http://www.salon.com/2013/04/12/10_tax_dodges_that_help_the_...read point 4.",
    "children": [
      {
        "author": "dmix",
        "text": "The problems with these tax systems are far greater than just the wealthy exploiting income tax. There are so many hidden costs in the endless complexity of the tax and financial systems in nearly all of the modern Western governments.It's a shame people rarely protest the sytematic issues, preferring to attack people or specific groups of people (often the wealthy or left vs right) - which are positions that generate adversarial responses rather than rational counter-arguments: http://lesswrong.com/lw/gw/politics_is_the_mindkiller/The surest way to minimize abuse/loopholes while being supported by rational a-political benefits:Flat tax + basic income.Eliminating millions of hours of wasted time due to beaurocracy (and while treating each social class with consistent dignity). These arguments are more likely to be persuasive to politicians - both left and right. This is a lesson I believe the general public missed  after the whole Occupy movement failed to result in much political change. The problem with the obsessive focus on \"the 1%\" was that it generated an us vs them response, further entrenching positions on both sides and further distancing already strained policial/social group relationships.For example: the simplification of taxes would very likely increasing the speed at which people file taxes and therefore signficantly increasing the speed that tax revenue could be collected annually, while reducing the amount of time they spend chasing down people who fail to do taxes. <- These are the types of a-political positive benefits I hope will eventually get attention one day to make the previously mentioned policies less of a pipe dream.",
        "children": []
      },
      {
        "author": "bigbugbag",
        "text": "yes, yes they often are.",
        "children": []
      }
    ]
  },
  {
    "author": "FussyZeus",
    "text": "When things like this pop up, as well intention-ed as they may be, I just think to myself, if this were just a regular guy and not famous, would anyone give a shit?",
    "children": []
  },
  {
    "author": "abalone",
    "text": "Couple problems with this otherwise well-intentioned effort:1. It's a drop in the bucket compared to what governments spend on a regular basis trying to solve these problems. (Bill Gates has said as much.)2. Private charity by the billionaire class is not a scalable solution. Historically most social advancement has happened through popular organization and government programs, not charity.Silicon Valley itself is a product of government spending. The Internet and thus Facebook wouldn't exist without billions of taxpayer investment in early stage high risk research and procurement via DARPA and other government agencies. That continues today (just a couple examples: Siri and autonomous vehicles).If we are serious about accomplishing social change and \"long term investments over 25, 50 or even 100 years,\" the answers lie in greater government investment in these areas. Just like Silicon Valley. And that means all Silicon Valley companies should be paying back to the government just as they would an early stage investor. Not as a \"noble choice\" but as an obligation. (Currently they get the core tech pretty much for free.) That would drum up an order of magnitude more funding for much-needed social projects.I'd like to hear more Silicon Valley CEOs talk about that.",
    "children": [
      {
        "author": "jnpatel",
        "text": "To quote the letter itself: \"We know this is a small contribution compared to all the resources and talents of those already working on these issues. But we want to do what we can, working alongside many others.\"",
        "children": [
          {
            "author": "abalone",
            "text": "A far cry from \"we know this is payback for public investment in tech companies, and we call on all of silicon valley to support formal remuneration to the federal government to give back to the public.\"",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "seansmccullough",
    "text": "His daughter is clearly not the intended audience of this post.  In fact, the fact he is having a kid has nothing to do with this post.",
    "children": []
  },
  {
    "author": "kafkaesq",
    "text": "Can we truly empower everyone -- women, children, underrepresented minorities, immigrants and the unconnected?Yes you can, Mark:  Stop requiring people to use real names.  And stop caving in requests from authoritarian governments that want to do their dirty work for them.",
    "children": []
  },
  {
    "author": "chegra",
    "text": "Sometimes, I think people on HN probably think they get points for being the most cynical critic.Can't we just say, \"Dude we are happy for you, and thanks for the money.\"And what happened to the rule about not saying stuff you wouldn't say to a person's face.  Would you be calling Mark a narcissist to his face?  Keep it civil people.",
    "children": [
      {
        "author": "dennisnedry",
        "text": "Where are you seeing \"narcissist\" reflected in the comments here? I'm seeing, \"ulterior motive\". And yes, I think most HN'ers wouldn't hesitate to call Zuck out on that. I know I would.",
        "children": []
      },
      {
        "author": "Mikushi",
        "text": "> Would you be calling Mark a narcissist to his face?I definitely would. I'd call him a cunt too. He is one, and in my country you call a cat a cat. None of that tippy toeing around you english people do, Zuck is a horrible person as the last ten years has shown everyone, Facebook is a despicable company with despicable ethics.This letter is vomit inducing, and the comment section is rich people stroking each other for \"helping the world\" after being major actors in destroying it, fuck them all too.",
        "children": []
      }
    ]
  },
  {
    "author": "sakopov",
    "text": "Oh lovely. This is the same man who called his users dumb fucks in the infancy of his company. Now he's worried about future generations and pushes his corporate agenda innocently using his newborn. Facebook is like a goddamn cult that acts like God's gift to humanity.",
    "children": []
  },
  {
    "author": "saccrant",
    "text": "Time to short Facebook stock.Given stock is the best way to motivate executives, when the guy on top is giving all of it away you know where the stock price is going.",
    "children": [
      {
        "author": "pjscott",
        "text": "Are you actually shorting their stock, or just blustering? You sound very confident.",
        "children": []
      }
    ]
  },
  {
    "author": "orionblastar",
    "text": "It is a lot of promises that are hard to keep.They think they can just throw money at a problem and it will eventually go away given enough time.They think people in communities will give up their bigotry against certain groups without a fight. They think everyone in the future will adopt the same worldview that they have. They think that they can solve poverty by giving everyone an Internet connection on the planet and most people who are poor are illiterate and can't read and write.Like I said a lot of promises.Some problems can't be solved with money, it takes innovation, it takes a new way of thinking, it takes doing things in a way nobody thought of yet.Students who are poor and have family problems have emotional and psychological problems that hinder their learning. No matter how much money you spend on their school, as Gates has learned, their test scores don't go up.  https://www.washingtonpost.com/news/answer-sheet/wp/2014/06/...This effort by the Gates Foundation proves that building better schools does not give the students a better education.You see they made the mistake of throwing money at a problem in order to solve it. Five years later and a disappointment in what they had created.Parents of the students get by with low paying jobs, because there is a wealth inequality in our nation. It leads to poverty, family issues, emotional and psychological problems none of which building new schools could address. All of which factor into having a hard time learning and getting better test scores.Why is there a wealth inequality and people have to settle for low paying jobs?Technology has automated most of the good paying jobs so they can be done with computers for free. Microsoft and Facebook for example earn money from technology that does work for others for free and earns money. Websites can operate 24/7 and replace people who take phone calls or work at a desk to fill out forms.Also we used to have factory jobs until we shipped those jobs to China because the labor cost less over there.Getting a good education is only possible if you have a good enough credit rating to get a student loan, if your family is poor and struggles and misses paying bills, you will have a bad credit rating and not be able to get a student loan for college. Not getting good enough grades will lead to a lack of scholarships and other things.People who can't get a college education face a life of hardship working low paying jobs just to get by. Not everyone can become a computer programmer after being a dropout, and then join a startup. Some have to work retail jobs in the service industry and 2 or 3 of those jobs. Not having time to raise their children properly. Not able to help with homework because they work overtime to get enough money to pay the bills.These factors have not been addressed in the future plans for fixing our education system.Sure you can learn a lot on the Internet and even use it to earn money, but most people just use it for entertainment value and communication. So there are distractions to learning on the Internet. But what happens when the freelance market suddenly gets 3 billion more lower wage contractors in it all competing for the limited amount of contracts?I wish I knew how to solve these problems, but I learned from experience that you can't just throw money at them and solve them.You need the government to help out with some sort of basic income program to lift people out of poverty as good paying jobs are scarce because of automation or AI advances. I expect that to get worse in the future.You need better mental health clinics to address the emotional and psychological problems associated with poverty for the students to be able to learn better. You need to find money for tutors to help them with homework when their parents cannot. You need to teach poor students stress management and test anxiety management so that they can o better in tests and learn better study habits and score higher.I've found at least with my son, that the Internet is a distraction for him. Time he could have spent studying for tests, he instead watches Youtube videos and plays video games. I've tried to help him as best as I can, but now he is failing chemistry as a junior in high school but passing his other classes because they are not as hard.We are one of those poor families because I ended up on disability in 2003 and don't earn as much as I used to as a programmer. There is only so much I can help my son, he makes decisions for himself, but I cannot force him to study more or do better on his tests. I feel as if I didn't go on disability we'd be better off and I'd be able to hire a chemistry tutor for him to get his grades up. I forgot as I took chemistry in 1985, and it was so long ago. It is harder to raise a child than you think, esp if you are on a limited income. The school he goes to is a good one with good teachers and modern equipment and they use iPads for ebooks and learning, but it is not enough and still students struggle with their classes.No matter what you do there will still be problems as no system is perfect, and students will still get low mtest grades no matter how good a personalized system you develop. The Dewey System was developed for personalized learning and it failed. https://en.wikipedia.org/wiki/John_DeweyMost of what they are trying to do has already been tried and failed. It is like trying to go against human nature and change the way human beings behave so they can learn better. But human beings cannot be reprogrammed like robots, and almost all of these theories go with the case that human beings can be reprogrammed like robots to create a better community for better learning.It is like trying to solve a social problem using technology thinking, you need to think in terms of society and the way people work, which is not the same way technology works. You need to lead social reforms in communities in a way that makes sense to everybody and not just people on a certain political spectrum that leaves out all others. You will face a resistance to change, as many won't want to change. People will come up with conspiracy theories over the changes, etc.It is a good start to build a different system of education and try to make new communities for education for everyone, but money alone won't solve it, you need the cooperation of everyone in the community to change the way their human nature works and give up on the old ways of doing things. Some won't want to give up on the old ways.",
    "children": []
  },
  {
    "author": "bikamonki",
    "text": "Dear Max, you are filthy rich. I accidentally created a very successful social network. People mostly use it to post cat pics, drowned babies, whine about everything and the best possible selfies they can take, or you know, post stuff that is addictive to humans. We then sell ads and well, make tons of cash. I say accidentally created because there where already social nets out there but mine was just out at the right time and had the right funding and coaching we needed. Well, honestly, I also had to screw a couple of guys to get here. Anyway, Maxy, all this is ancient and boring stuff. The deal is that since I have tons of cash and success people think I am smart, I think am smart too, so I ought to know a thing or two about how to solve real world problems. I mean it can't be that hard: it is just a matter of developing tech. Billy is throwing 2B to energy research, I can do just the same, see daddy will be a hero too! Anyway dear, this posting personal stuff on Facebook fever just got me and I love you and it is so cool Shakira just likes this post. Also, the post generated a billion views, we sold them ads at premium: your first day on Earth Maxy and you are one million dollars richer! Ok, thats it. Love. Dad.",
    "children": []
  },
  {
    "author": "keane",
    "text": "Disappointed once again in the immediate cynicism here but by now I should know not to be surprised by it in any community where nothing is sacred.",
    "children": [
      {
        "author": "ionised",
        "text": "What should be considered sacred?",
        "children": []
      }
    ]
  },
  {
    "author": "uhtred",
    "text": "I'm so glad I'm not on Facebook.",
    "children": []
  },
  {
    "author": "NN88",
    "text": "this melodramatic bs",
    "children": []
  },
  {
    "author": "fantasticsid",
    "text": "Reading some of the comments make me sad. This has happened so often lately..",
    "children": []
  },
  {
    "author": "derefr",
    "text": "As far as I can tell, this is a speech directed at other billionaires, attempting to 1. put them in an idealistic frame of mind and then 2. making the suggestion that the natural outlet for that idealism is philanthropy, while 3. Putting his own money where his mouth is for some peer-pressure.If that works, then this will singlehandedly be the highest-ROI \"evangelism\" anyone has ever done. Unlikely, though.",
    "children": []
  },
  {
    "author": "breakyerself",
    "text": "Well I hope he learned something from the boondoggle his grant to Newark schools turned out to be.",
    "children": []
  },
  {
    "author": "dimdimdim",
    "text": "As I said in previous post --- if I were writing a letter to my son, it would be a private affair and not posting it worldwide on FB.Also, there is a huge difference between pledging to donate during our lifetime and \"donating\". Anyone can make that pledge and then decide a comfortable schedule.",
    "children": []
  },
  {
    "author": "melted",
    "text": "I like Zuck. He seems to have picked the right role model to follow (Bill Gates). I just hope he cashes out before a credible competitor takes over.",
    "children": []
  },
  {
    "author": "charlie_vill",
    "text": "Thank you Mark.",
    "children": []
  },
  {
    "author": "salgernon",
    "text": "In the end, the only thing anyone has to give is their time.How many billions of hours are spent daily on Facebook?  His fortune is won on the backs of those poor fools.It ain't gonna happen, but shutting down Facebook now would be a greater philanthropic act. (Yea and obviously OtherFacebook would come online.)",
    "children": []
  },
  {
    "author": "gabea",
    "text": "It is unfortunate that we cannot accept the kindness and generosity from those who have been blessed with wealth and whom wishes to share it with others. Rather we ridicule them and surmise that they have some hidden agenda behind their desire to share.",
    "children": []
  },
  {
    "author": "seanlinehan",
    "text": "> Can we truly empower everyone -- women, children, underrepresented minorities, immigrants and the unconnected?Part of me thinks that Zuck means people without family or otherwise ties to wealth and influence. But another part of me thinks that he means those that aren't connected to the internet. If it's the latter, this is quite the bold statement. The implication would be that people without access to the internet are structurally disadvantaged. Which in a lot of ways are true. The internet enables anybody to acquire knowledge, skills, and relationships with an ease that is otherwise impossible. Thankfully, this bucket has a fairly clear solution path.",
    "children": []
  },
  {
    "author": "YorkianTones",
    "text": "Applause to the Zuck for the public commitment to invest 99% of his fortune in charitable causes.Providing cheap, reliable internet to underserved areas of the planet seems like an achievable goal. Much of the technology is present, and so this goal can be attacked now given available funding. The technology should improve further and become cheaper in the near horizon. Go for it Zuck. Make a dent.\"Curing disease\", however, or \"learning and experiencing 100x more than we do today\" - these trite and nebulous platitudes seem line lines stolen from HBO's Silicon Valley script. \"Eradicating polio\" is a concrete, well-scoped, measurable, and realistic goal (regardless of whether its is the best apportioning of resources). \"Curing disease\" is not. Does someone who's married to a doctor really believe that all disease is eradicable in the next 100 years? Must we resort to impossible moonshots and unqualified invocations like \"Make the world a better place!\"? Something like \"colonize space!\" is not a helpful goal; \"build a habitation on Mars which produces enough food, water, and O2 to sustain 5 people for a year\" begins to be.This pedestrian rallying cry is a chaotic amalgam of cliches. I hope Zuckerberg puts more thought, organization, and direction into how he will invest his billions for the betterment of posterity.",
    "children": []
  },
  {
    "author": "o0-0o",
    "text": "This would have been a lot more genuine if he had just wrote the letter - tucked it away - and then let his actions do the talking.When a choice is between doing the right thing loudly, and doing the right thing quietly, the amount of noise you make is the inverse of the size of your dick.~_^",
    "children": []
  },
  {
    "author": "zurn",
    "text": "Wow, addressing climate change and unsustainable resource consumption are absent from the list and \"protecting the environment\" is once mentioned in passing.",
    "children": []
  },
  {
    "author": "nemo44x",
    "text": "New money mistake. You don't change the world by putting your money into non-profits but rather cultivating a dynasty that has tentacles in business, government and thus policy.You consolidate this kind of wealth into the proper channels to influence public opinion and thus a much greater sum (measured in trillions) over a greater time to get the real change you believe in.It's a good gesture but a losing strategy. But it's his money to do as he pleases so, cheers Zuck.",
    "children": []
  },
  {
    "author": "ForFreedom",
    "text": "Kayne and Kim named their son, North\nMark and Priscilla named his daughter MAX.",
    "children": []
  },
  {
    "author": "jpeg_hero",
    "text": "Patrick Bateman -- World problems speechhttps://youtu.be/dZlK_ThjMk4",
    "children": []
  },
  {
    "author": "fijal",
    "text": "I think a bad sentiment here is mostly generated not about what Mark says on his post, but what he does otherwise. We've seen a fair share of controversy regarding facebook, privacy practices etc, we've seen a fair share of controversy regarding internet.org.I for one find it all skeptical - I don't see how his ideas would align with facebook goals as a company",
    "children": []
  },
  {
    "author": "frame_perfect",
    "text": "Actions speak louder than words.",
    "children": []
  },
  {
    "author": "robert_tweed",
    "text": "Maybe I'm being too cynical, but this seems about as philanthropic as Ron Hubbard starting a religion.Firstly, the donation is stock not cash, so the value of this foundation will be directly linked to the value of Facebook shares.Secondly, it has been stated that one of the things this foundation will do is \"participate in policy debates\". If the headline was \"Mark Zuckerberg to put $45 billion is stock behind lobbying effort to establish Internet.org as a monopoly in developing countries\", that wouldn't sound quite so positive, would it?",
    "children": [
      {
        "author": "Veedrac",
        "text": "I think you're being too cynical.So what if the donation is stock?Since when does> We must participate in policy and advocacy to shape debates. Many institutions are unwilling to do this, but progress must be supported by movements to be sustainable.mean \"lobbying effort to establish Internet.org as a monopoly in developing countries\"?",
        "children": []
      },
      {
        "author": "morgante",
        "text": "It sincerely depresses me that the top comment on Hacker News is so incredibly cynical. The man is giving away a huge amount of money and you can only find ways to detract.> Firstly, the donation is stock not cash, so the value of this foundation will be directly linked to the value of Facebook shares.So? The vast majority of his wealth is in Facebook shares. That doesn't change the fact that he's giving away the vast majority of it. You think he should have sold it all now, destroyed its value, and donated a much smaller pot?> it has been stated that one of the things this foundation will do is \"participate in policy debates\".One of many things. Not to mention he has never attempted to make Internet.org anything close to a monopoly.That your reaction to an incredibly charitable act is such pure cynicism is absolutely disgusting. There are plenty of billionaires who hoard their money or perpetuate hereditary fortunes, and those who don't should be commended.",
        "children": [
          {
            "author": "wfn",
            "text": "Try exercising a less naive approach (\"incredibly charitable act\") perhaps.In particular, regarding your statement \"he has never attempted to make Internet.org anything close to a monopoly\", it surely looks like that's the end game here - see https://www.techinasia.com/talk/facebooks-internetorg-evil/ (discussed on HN here: https://news.ycombinator.com/item?id=10568525)",
            "children": []
          },
          {
            "author": "iamsohungry",
            "text": "> Not to mention he has never attempted to make Internet.org anything close to a monopoly.Do you even know what Internet.org is? They're providing free access to a subset of the internet that Facebook controls, while forcing people to pay if they want to access the internet as a whole. The entire reason Internet.org exists is to create a Facebook monopoly on data access in developing countries.Your entire comment is naive.",
            "children": [
              {
                "author": "carb",
                "text": "Internet.org provides access to a subset of the internet that Facebook chooses to pay for. The target audience is mostly people that can't afford any internet access to the first place because it is to outrageously expensive. As well, that subset of the internet is open to developers to submit their own services to be supported by Internet.org [1]. Last time I glanced through the agreement, Facebook is just trying to avoid paying for HD photos and video downloads, which would increase the cost of Internet.org beyond feasibility.An initiative can be charitable while also benefiting the donor. The users of Internet.org get free access to Facebook as well as the other services being provided and that doesn't detract from the service or make the whole initiative evil.I have yet to see research that providing a zero-rating service is harmful as you suggest.[1]: https://developers.facebook.com/docs/internet-org",
                "children": [
                  {
                    "author": "iamsohungry",
                    "text": "> I have yet to see research that providing a zero-rating service is harmful as you suggest.\"Internet.org provides access to a subset of the internet that Facebook chooses to pay for.\">  Last time I glanced through the agreement, Facebook is just trying to avoid paying for HD photos and video downloads, which would increase the cost of Internet.org beyond feasibility.This could be achieved by choking bandwidth, which would be easier to implement, simpler, and more transparent. Instead, you get stuff like:\"In order for your content to be proxied as described above, your URLs may be re-written and embedded content (like javascript and content originating from another domain) removed. In addition, secure content is not supported and may not load.\" [1]Let's be absolutely clear here: Facebook wants to control what content gets into Free Basics and how it's presented, and is willing to make security impossible in order to do it. This enables both censorship and mass surveillance controlled by Facebook and whoever is willing to pay them.>  The users of Internet.org get free access to Facebook as well as the other services being provided and that doesn't detract from the service or make the whole initiative evil.It's not the things users get access to that I'm worried about, it's the things they don't get access to, and who else gets access to those user's data.[1] https://developers.facebook.com/docs/internet-org/participat...",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "drited",
        "text": "You are being too cynical.  He's giving away stock not cash because if he sold the stock first to raise cash to donate, he'd have an enormous capital gains tax liability.  By gifting stock, he can gift a far greater amount and the tax-exempt recipient charity can sell the stock itself to raise cash.  This is standard in situations like this - e.g. it's what Buffett did when gifting away almost all of his billions.Also the cause you listed is just one of many that he is gifting to so you're missing the forest for the trees.  To help overcome this, list all of the good causes he mentioned (personalized learning, curing disease etc), then list the ones that you don't like.  I bet the list of good causes will be far longer than the list of ones you don't like.",
        "children": [
          {
            "author": "xyzzyz",
            "text": "http://www.nytimes.com/2015/12/02/technology/mark-zuckerberg...Mr. Zuckerberg and his wife, Dr. Priscilla Chan, said they were forming a new organization, the Chan Zuckerberg Initiative, to manage the money, through an unusual limited liability corporate structure. [...] By using a limited liability company instead of a nonprofit corporation or foundation, the Zuckerberg family will be able to go beyond making philanthropic grants. They will invest in companies, lobby for legislation and seek to influence public policy debates, which nonprofits are restricted from doing under tax laws. A spokeswoman for the family said that any profits from the investments would be plowed back into the Chan Zuckerberg Initiative for future projects.",
            "children": [
              {
                "author": "drited",
                "text": "Someone with more knowledge of the U.S. tax code than me will be able to explain how he's going to achieve this while funding a new corporation (perhaps he'll set up a foundation that owns a corporation, similar to what some endowment funds do to avoid UBTI), but there is no way that he's going to make this gift much smaller by doing it in a way that realizes a taxable gain at the time of gift.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "joeyspn",
        "text": "You're just picking the part of the story that you don't like. Zuck maybe has taken decisions that some of us don't share (most likely all related to privacy/monopolies in the internet)... but (like Bill Gates) he's undoubtedly in a unique position to bring deep changes and improvements to the world through philanthropic activities.If having a child has made him rethink his views (which would be normal) then that's great. Too bad he didn't have a child before and started this initiative few years ago!What part of \"curing diseases\" sounds greedy, egomaniac, or bad in any sense? I hope he joins Gates, Thiel, Parker, Diamandis, Page, Kurzweil, and many others on their quest to eradicate diseases from the face of earth. And I hope he funds Aubrey De Grey like Thiel is doing...",
        "children": [
          {
            "author": "Ntrails",
            "text": "My first response was \"why not just give it to the Gates foundation\" since they're already doing it and well.  What's his special insight into what makes a cause effective to fund?  Are we perpetuating a world in which charities employ a bunch of people to convince any of a hundred different rich philanthropists/foundations to hand over wodges of cash?It's a hugely net positive thing he is doing no question.",
            "children": []
          },
          {
            "author": "sukulaku",
            "text": "Gates managed to make people believe he somehow became a Saint after leaving Microsoft, even though he created and guided it to become pretty much the most evil IT company ever.People just don't talk about it anymore, so he's all good now.But there's obviously something shady about his dealings: http://newsjunkiepost.com/2013/06/07/bill-gates-big-pharma-b...",
            "children": []
          }
        ]
      },
      {
        "author": "wanderer2323",
        "text": "If anything, you are not being cynical enough. This 'letter' can be summarized as \"We will use the money for leftist lobbying in our country and establishing a monopoly in other countries AND we're going to say it's charity so no taxes will be paid\".",
        "children": []
      }
    ]
  },
  {
    "author": "zeofig",
    "text": "It astounds me that people are taken in by this. There are so many ways that Zuckerberg can manipulate this to his self-worshiping benefit that I can't even guess which ones he'll pick. Consider the type of charity Zuckerberg has previously favoured: totally monopolistic internet infrastructure in India. Sure, people get internet, but it'll Zuckernet from now until forever. Philanthropy is a broken system, because powerful philanthropists never really give away their money: they retain control of whatever the charity is used to build. When you have everything and it's not enough, that kind of control is worth a lot of dollars to you.",
    "children": [
      {
        "author": "DanBC",
        "text": "Do you think your comments apply to Bill Gates?",
        "children": [
          {
            "author": "zeofig",
            "text": "It's less clear cut with Gates because he has a quite different personality to Zuckerberg. Gates has a genuine desire to understand and fix things, although that is amongst his more positive traits. Zuckerberg/Facebook, on the other hand, has well-documented antisocial and indeed malicious behaviour.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "andr3w321",
    "text": "I'm all for rich people giving their mass fortunes to charity but they sure do seem to take a long time to do it.  Bill Gates is STILL the richest person on the planet in 2015 and his wealth GREW $3.2 billion last year.  Can we save the praise for giving away $44 billion until he actually gives it away?Source: http://www.forbes.com/sites/kerryadolan/2015/03/02/inside-th...",
    "children": [
      {
        "author": "petewailes",
        "text": "It's actually quite hard to give away money faster than you get it above a certain level of wealth. I suspect this reflects more the performance of the investments Bill has than the level of charitable investment.",
        "children": []
      }
    ]
  },
  {
    "author": "tmsh",
    "text": "\"He has informed us that he plans to sell or gift no more than $1 billion of Facebook stock each year for the next three years and that he intends to retain his majority voting position in our stock for the foreseeable future.\"http://www.sec.gov/Archives/edgar/data/1326801/0001326801150...What an amazing donation! But not for the foreseeable future. I don't care how multiplicative his voting shares are. If there is no plans to sell them in the foreseeable future, this is a pledge spread out across a generation, decades, while real problems are affecting us every year. Every year where he just capped himself at 1 billion dollars in donations.Why are you applauding this?",
    "children": []
  },
  {
    "author": "hellofunk",
    "text": "I'm signed up for CNN's \"Breaking News\" emails that are sent out whenever some earth-shattering crisis occurs or particularly important news that affects everyone. I received one of these email alerts upon the arrival of their daughter. This gave me a great sigh; good news for them, but how did it become worthy of worldwide immediate news notification?",
    "children": [
      {
        "author": "erikrothoff",
        "text": "You didn't read the article did you?",
        "children": [
          {
            "author": "hellofunk",
            "text": "I did. What does that have to do with CNN Breaking News?",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "DyslexicAtheist",
    "text": "I'm so excited about the trickle-down economics that I can hardly curb my enthusiasm",
    "children": []
  },
  {
    "author": "seanhandley",
    "text": "I find it disgusting that he's just had his first child and is already piggybacking a PR exercise off it.In spite of the enormity of the announcement, to tie it up as \"A letter to our daughter\" is deeply crass and makes me feel queasy.",
    "children": []
  },
  {
    "author": "poub",
    "text": "I would have loved having parents writing such beautiful letter to me for my birth.\nIt’s an extraordinary beautiful welcoming.",
    "children": []
  },
  {
    "author": "artur_makly",
    "text": "https://imgflip.com/i/v2fo1",
    "children": []
  },
  {
    "author": "lagudragu",
    "text": "Not to be cynical, but isn't this also just a method to ensure your company will remain for a longer duration? As a decline in facebook stock will indirectly hurt the philanthropic projects which are linked to it through his foundation. I would take his \"pledge\" more serious if he would invest actual capital (money, resources, ...) in such projects.",
    "children": []
  },
  {
    "author": "cJ0th",
    "text": "Alternative proposal: Use that money to turn Facebook into a self-sustaining non profit that solely cares about maximizing its users experience and stop breaching privacy so that data can be sold.Perhaps that's not as fancy as investments in health, education or the environment but at least it seems very doable and could solve one problem (excellent means for human communication) for good.",
    "children": []
  },
  {
    "author": "jordache",
    "text": "so you equate to internet monolopy as impactful as curing diseases?? So the dude is doing something else you find objectionable, but it doesn't come close to good stuff he is trying to accomplish.",
    "children": []
  }
]