{
  "title": "Why FPGA manufacturers keep their bitstream formats secret",
  "summary": "This December 2015 article argues that FPGA manufacturers' practice of keeping bitstream formats secret is not justified by their stated reasons (protecting customer designs, protecting chip IP, preventing customer damage, or supporting tools). The author refutes each argument with technical evidence. The discussion thread covers whether open bitstreams would enable better tooling, the economics of FPGA design, and the challenges of creating competitive open-source FPGA toolchains. Many commenters highlight the complexity of modern FPGA tools as the real barrier, not just the bitstream format, while others note that Project IceStorm's success with Lattice iCE40 proves that reverse-engineered and documented bitstreams can enable viable open tooling.",
  "what_happened": "Over the next 10 years, the prediction that open bitstreams could enable competitive tooling largely proved correct, though with caveats. Project IceStorm (mentioned in the discussion) became highly successful for Lattice iCE40, spawning a mature ecosystem with Yosys, nextpnr, and other tools. However, the bigger FPGA vendors (Xilinx/AMD and Altera/Intel) did not voluntarily open their bitstream formats. Instead, community efforts like Project X-Ray (prjxray) have successfully reverse-engineered and documented Xilinx 7-series bitstreams, and openXC7 now provides open tooling for Xilinx Series 7 devices. By 2024-2025, the landscape shifted significantly: nextpnr gained support for Xilinx devices, and a major milestone was achieved with open-source tooling supporting a 500k LUT space-grade FPGA (NanoXplore NG-Ultra) funded by the European Space Agency. The vendor toolchains (Vivado, Quartus) remain closed, bloated, and frustrating, but open alternatives have become genuinely viable for multiple FPGA families. Lattice, being more open-minded, released the Nexus 2 platform in late 2024. The joke about needing a 20GB download remains somewhat true—vendor tools are still enormous—but open alternatives now exist and work well.",
  "most_prescient": {
    "user": "throwaway000002",
    "reason": "This commenter correctly predicted that open tooling on Lattice iCE40 would drive adoption and create a positive feedback loop: open tools → more users → better tooling → hardware improvements → entrenched user base. They also correctly anticipated that this could eventually threaten established FPGA vendors and that the openness of platforms like Linux had fundamentally changed the competitive landscape. They were right that companies like Intel (which acquired Altera) would eventually offer integrated FPGA+CPU solutions, and that Chinese vendors would enter the space. Their 10-year prediction about open FPGA tooling and SoCs with integrated FPGA fabric is coming true."
  },
  "most_wrong": {
    "user": "jacquesm",
    "reason": "This commenter argued that 'there is no real demand for openness' and that FPGA manufacturers would never voluntarily open their formats because there's no business justification. They claimed that if openness really mattered, a manufacturer would 'surely take the lead and capture marketshare.' This was wrong because: (1) Lattice did exactly this by being more accommodating to open tooling, (2) Community reverse-engineering (iCE40, Xilinx 7-series) proved viable without vendor support, (3) Open tooling did drive adoption and user preference, as evidenced by testimonials like 'the workflow is far superior' mentioned in the comments. The argument that 'outside of the tinkerer world there's vast industry' that doesn't care was partially correct but too dismissive—by 2024, open tooling was gaining professional adoption."
  },
  "notable_aspects": "The discussion thread contains an actual Altera director (dkarchmer) commenting, providing insider perspective that opening up would require massive documentation effort and that the 'comprehensive tooling' (not just bitstreams) is what's complex. This comment has aged well and remains relevant. Also notable: the thread mentions specific projects that did materialize (icestorm, fpgatools, arachne-pnr) and users were already discussing whether to invest in reverse-engineering efforts. The prediction about Chinese FPGA vendors entering the market has partially come true (Gowin, Anlogic are now player). The discussion about whether bitstream format or comprehensive tooling is the blocker proved nuanced—both matter, but the iCE40 success showed that with bitstream docs, the tooling community would build the rest.",
  "grades": {
    "buserror": {
      "grade": "A",
      "rationale": "Correctly identified that icestorm would be 'an excellent project' and that the workflow advantages would be undeniable. Also right about the value of 'hacker friendly packages' and the immense value of not needing 20GB downloads. Prescient about how this would appeal to users despite being limited to smaller FPGAs."
    },
    "coderdude": {
      "grade": "C+",
      "rationale": "Made reasonable points about comprehensive tooling being the real issue, not just bitstream format, which is partially true. However, underestimated how much open bitstreams would actually enable. The comment that 'bitstream formats are nothing' aged poorly—they turned out to be quite important for enabling third-party tools."
    },
    "sklogic": {
      "grade": "A-",
      "rationale": "Correctly argued that knowing the bitstream format is essential for building alternative tools and that open formats would enable third-party tools. Accurately identified that vendor tools have unjustifiable bloat. The prediction that open bitstream knowledge would lead to compact, modular tools (like what actually happened with nextpnr) was spot-on. Minor deduction for not anticipating reverse-engineering success."
    },
    "userbinator": {
      "grade": "A",
      "rationale": "Correctly stated that bitstream formats are 'probably the worst-kept secret' and that reverse-engineering is 'pretty trivial' given FPGA regularity. Accurately predicted that vendors would send lawyers at public disclosure (hasn't happened extensively, but the threat exists). Correctly identified icestorm as the project worth following."
    },
    "throwaway000002": {
      "grade": "A+",
      "rationale": "Most insightful comment. Correctly predicted the positive feedback loop of open tools driving adoption, which would then drive tooling refinement. Right about how this could eventually change competitive dynamics. Prescient about Linux as a model. Correctly anticipated Lattice's strategic advantage in being more open. The only reason not A+ is some technical details about interconnects and architecture weren't perfectly expressed, but the overall vision was correct."
    },
    "nickpsecurity": {
      "grade": "B",
      "rationale": "Made many insightful points about EDA complexity and why open FPGA design is hard (IP costs, tooling requirements, economies of scale). Correctly noted that every challenger to Xilinx/Altera has failed. However, underestimated how much the iCE40 momentum would matter and overestimated the permanence of the FPGA vendor duopoly. Also failed to anticipate the ESA-funded space-grade FPGA initiative."
    },
    "badsock": {
      "grade": "B+",
      "rationale": "Made an interesting technical argument about how non-volatile memories (memristors, nano-RAM) could eventually allow regular FPGA structures that would enable open-source design. This was speculative but not unreasonable. The timeline was too optimistic (10 years), and these technologies haven't materialized as predicted. However, the basic principle that simpler, more regular structures could enable open tooling was sound."
    },
    "jacquesm": {
      "grade": "D",
      "rationale": "Provided valuable skepticism about market economics but was wrong about the key predictions. Believed open tooling would never succeed without vendor buy-in; proven wrong by iCE40 and later Xilinx community efforts. Right that capital requirements are high, but underestimated community ability to tackle niche markets and how niche markets could grow. The claim 'no real demand for openness' was contradicted by events."
    },
    "michaelt": {
      "grade": "B+",
      "rationale": "Made an interesting but underappreciated point about API stability concerns: vendors don't want to publicly commit to bitstream stability. This insight was partially validated—vendors do avoid this commitment. However, the concern turned out to be less important than expected; community tools coexist happily with vendor tools even without guarantees."
    },
    "cottonseed": {
      "grade": "A",
      "rationale": "As the author of arachne-pnr, demonstrated the practical success of open tooling and correctly believed that creating compelling open tools could change vendor incentives. The comment about 'workflow is far superior' validated the prediction. However, they were perhaps too optimistic that success with iCE40 would translate to flagship FPGAs."
    }
  },
  "score": 8
}