[
  {
    "author": "hoodoof",
    "text": "Wow you guys just hit that thing pretty hard - no experience, no tech knowledge, raise cash, throw it at an agency that takes a year and $100K to build the software then grind out your unproven new concepts for six years.You've got stamina I'll grant that. (or you HAD stamina?)Not my cup of tea.  I prefer my to do my failing writing my own code and these days I try to avoid spending any money so that when I fail I feel less bad about it than I used to when I spent lots of money to get to failure.",
    "children": [
      {
        "author": "pbreit",
        "text": "Send post today that read like an Onion article.",
        "children": [
          {
            "author": "forgottenacc56",
            "text": "?",
            "children": [
              {
                "author": "pbreit",
                "text": "I meant \"second post\" (besides the \"Lists\" one). This post seemed to list out every cliched, obviously wrong thing to do.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "x1024",
        "text": "To me it sounds more like \"We had no skills, no experience and no worthy advice. But we DID have $100K burning a hole in our pockets\".Literally \"Rule number 1\" of being a startup is \"Do an MVP and then test if it's worth it to do more\". $100K is one hell of an MVP.A fool and his money are soon parted.",
        "children": [
          {
            "author": "Kequc",
            "text": "Hi, I'm interested in your perspective on this. Could you elaborate as to how much is an acceptable amount to spend on an MVP and testing? $100k certainly sounds high but not altogether unreasonable considering there is a physical product and distribution.",
            "children": [
              {
                "author": "x1024",
                "text": "You are not wrong about the \"physical product and distribution\" part, but the article says they paid $100K for web development alone.",
                "children": [
                  {
                    "author": "yaakovkarda",
                    "text": "Didn't elaborate well — $100K were total expenses by the time of launch, but tech took more than production.",
                    "children": []
                  }
                ]
              },
              {
                "author": "nostrademons",
                "text": "It's usually better to do your own MVP because the product of an MVP (for you, the entrepreneur) is learning, and when you pay someone else to do it, they get the learning.",
                "children": []
              }
            ]
          },
          {
            "author": "geebee",
            "text": "I don't think of an MVP (minimum viable product) as a prototype, I think of it as the most pared-down application that can still launch.  I don't think of this as a shoddy or unreliable app, more a minimalistic one in terms of features, but it does need to work and be stable enough for the initial needs of the business.If you got a good developer at 100k an hour, that leaves you with 1000 hours to create a minimum viable product, or a little over six months.I guess it depends on what you're trying to do, how well you want it to scale initially, and so forth.  Kind of curious, this community does tend to lean toward fast startups rather than slow big corps, is six months and 100k considered clearly excessive for an MVP?",
            "children": [
              {
                "author": "softawre",
                "text": "> 100k an hourI'm available for contract work at that rate.",
                "children": [
                  {
                    "author": "geebee",
                    "text": "Ha! took me ages to catch that.",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "czbond",
        "text": "I am the same way. I have one failed, one \"moderate hit\" that as CTO I left, and now I trust no-one but myself to do product need validation. And I've become so skeptical of my results, that I have to hear the message over and over.",
        "children": []
      },
      {
        "author": "yaakovkarda",
        "text": "$100k was never a budget estimate. There is a long story under the hood, but (in very short) we had to switch agency but lost a lot of money, than waisted a lot of money again on the indian offshore engineers that made shitty product that we had to remake. So $100k and a year is just an outcome. We had an angel investor who (just as we did) firmly believed in the concept and wanted the project to launch and not to be dropped on the way.",
        "children": []
      }
    ]
  },
  {
    "author": "danieltillett",
    "text": "This is a great article and kudos to Yaakov for being brave enough to share his experience with us. This is a classic example of a talented and dedicated people working on a bad idea and hoping that they can pivot their way to a good idea.As they rightly noted in the end people don’t want to make their own clothes online. They want clothes that make them look good and project the image to the world that reflects how they want to be seen. No matter how well executed, this idea can’t work except for the tiniest niche.I have often thought about how to make this market (the “consumer co-creation” category) work and I have yet to figure out a way. The best idea I have had is to out Zara Zara. The Zara model it to keep the supply chains short (with a resulting high labor cost) and the stock turn over rapid so if something proves popular they can make more of it quickly (no ordering for summer in the middle of winter). It might be possible with better physical tracking and identification of the key influencers to be able to get a jump on what will prove popular with enough lead time that you can lengthen the supply chain to be able to take advantage of low cost labor, but I have not explored this idea.",
    "children": []
  },
  {
    "author": "underwater",
    "text": "I'm surprised they decided to just focus on jeans. I can't imagine buying pants without trying them on. Even if I get the size right I might not like how they feel. Hoodies and shirts seem much more forgiving, and there are a bunch of companies who seem to be successful in that space.",
    "children": [
      {
        "author": "kristianc",
        "text": "There are lots of companies popping up that focus on doing one thing well - Casper's, Harry's etc. It sounds like they'd have had far lower margins on hoodies and shirts.",
        "children": []
      },
      {
        "author": "petercooper",
        "text": "I don't ever try on any clothes before buying them because it's awkward to do so and it's so easy to return them nowadays, but I still wouldn't buy custom jeans.. seems an unusual thing to customize to me.",
        "children": []
      }
    ]
  },
  {
    "author": "rmason",
    "text": "I am a little puzzled that they they didn't try to sell companies instead.  Every company has shirts with the company brand but I'd think you'd really stand out if say your food delivery people were wearing company branded jeans.  I did a quick check and none of the corporate apparel vendors offered jeans or pants.",
    "children": [
      {
        "author": "yabatopia",
        "text": "Probably because the brand recognition on a pair of jeans is too low to even bother. A logo on a shirt is instantly recognizable: it's right in front of you.Putting the company name on a jeans only works for short names. Even a relatively short name like Facebook is challenging to keep it readable from a short distance, let alone from a few meters.Similar for logos, with the additional challenge of logo placement. Where will you put the logo on a jeans? On the back? That will cause a lot of uncomfortable situations. On the front? Now you have to look down in front of the person wearing the trousers, making it even more uncomfortable.Maybe jeans in the exact company color could work, but you need a lot of different sizes. People are very picky about the fitting of a jeans, so you'll end up with a huge number of sizing combinations. Shirts a far more easy: from XS to XL and you're done.",
        "children": []
      },
      {
        "author": "RogerL",
        "text": "\"No one does this or asks for it\" despite it being pretty easy to do is a good signal that there is no demand for it.Not a perfect signal, but a good one.",
        "children": []
      }
    ]
  },
  {
    "author": "jakejake",
    "text": "I hate to see a good idea go to waste. I think the assumption that people want to design their own clothes is false. But if a celebrity designed a pair of jeans, people would want that.It probably isn't realistic to get Kanye West for a non-ridiculous sum of money. But a lot of fairly popular indie musicians or fashion bloggers would surely endorse a pair of \"custom\" jeans with their name on the label. I know a lot of musicians would do it simply to get a bunch of free pairs of their own custom jeans.",
    "children": [
      {
        "author": "danieltillett",
        "text": "This is just another celebrity fashion brand. These are popular for a short while, but it is really hard to build a sustainable model on this.Fashion is incredibly competitive - really, really competitive. Us techies underestimate how cut throat the fashion industry is. It is not a bunch of idiots air kissing each other - it is in the main run by really canny people who know what they are doing.",
        "children": [
          {
            "author": "spacecowboy_lon",
            "text": "Apart from  Victoria Beckham I don't see any celebrity fashion brands lasting.",
            "children": [
              {
                "author": "magic_beans",
                "text": "Uhh... Just because you're not aware of celebrity fashion brands doesn't mean they don't exist:Mary Kate and Ashley Olsen - The RowJessica Simpson - eponymousGwen Stefani - LAMBJay Z - RocawearBeyonce - House of DereonP Diddy - Sean JohnKanye WestAnd these are just a FEW.Celebrities selling clothes is pretty lucrative.",
                "children": [
                  {
                    "author": "spacecowboy_lon",
                    "text": "I meant lasting in the sense that Chanel, Dior, Boss,  are",
                    "children": []
                  }
                ]
              },
              {
                "author": "jakejake",
                "text": "Ah, but every few months there's a new celebrity!",
                "children": []
              }
            ]
          },
          {
            "author": "lmm",
            "text": "> This is just another celebrity fashion brand. These are popular for a short while, but it is really hard to build a sustainable model on this.Right, but there could be a sustainable model in a turnkey service that made it very easy for minor celebrities to do their celebrity-fashion brand for the short period while it's possible?",
            "children": []
          },
          {
            "author": "jakejake",
            "text": "I think they were onto a great idea, but their main premise that people want to design their own clothes was wrong. People want to buy clothes that are a known brand or recommended, worn and endorsed by tastemakers. They have a platform that could enable those tastemakers to create their own custom brands. Celebrities are all over this stuff - making their own perfumes, clothing, accessories. There's a ton of more indie-level celebrities that would love to do this but don't have the connections.Even still, the outcome for most businesses is failure. And I'd assume you are correct that fashion is probably one of the more fickle businesses.",
            "children": []
          }
        ]
      },
      {
        "author": "TheOtherHobbes",
        "text": "I think that kind of marketing would have made a big difference.Some people do want to design their own clothes. But they'll probably be making their own clothes by hand already. Everyone else wants low cost, a strong brand, and/or a celebrity link.So mistake one was assuming that just because you're a build-it-yourself person, everyone else is too.But more, marketing for these kinds of projects has to be creative. You have to invent your customer relationships and your brand, not just try to buy them wholesale using social media and Google as a retail store for clicks.If this was easy, everyone would do it. But it's not easy at all. It's really, really hard.",
        "children": []
      }
    ]
  },
  {
    "author": "fersab",
    "text": "I'm wondering, and forgive me if I missed this somewhere in the article, but did the founders wanted this type of product for themselves in the first place?If there was a solution like that before they started, would they go and design their own jeans instantly, cause they really really wanted to do so?Sounds to me like one of these \"that would be cool if, I think\"-type of ideas... I may be wrong though?",
    "children": [
      {
        "author": "csydas",
        "text": "They did address this and acknowledged it should have been a red-flag for them.Really what it comes down to is the old saying how people \"...don't know what they want until they see it.\" Bespoke items are great, but, at least with pants, I would assume the purpose would be to get the best fitting pair, not necessarily to give a pair of pants flair. The end result of telling people \"your pants can look however you want!\" is a bunch of people scratching their heads going \"I want...them to fit?\"",
        "children": [
          {
            "author": "timje1",
            "text": "I guess that's the difference between this and say, threadless. Threadless has amateur custom designs submitted and voted on, and the top designs float up to the front page. Because most people simply aren't very good designers...",
            "children": []
          }
        ]
      },
      {
        "author": "franze",
        "text": "from the article>Perhaps the fact that none of us had ever tried to order custom jeans ourselves should have set off alarm bellto answer you questions: no, no, yes",
        "children": [
          {
            "author": "fersab",
            "text": "Aah there that was!However i'm still impressed by the execution, when you take it all in the acccount, regardsthe  lack of tech knowledge and so on...",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "franze",
    "text": "i do a 1h free for startups, this means i talk a lot with startups of all kinds.sometimes i talk with early stage founders - very, very clever and very passionate people - who have figured everything out. they know what product they will build, what their website will look like, what they URLs will look like, what their marketing campaign will look like, how they will get investment, what their customers will be like.i call this a \"perfect start-up\"perfect start-ups fail. always. sometimes fast, usually it takes them a long, hard, crappy time.sometimes i talk with early stage founders - very, very clever and very passionate people - who have an idea. they don't know what their product will look like, don't know what their website will look like, don't know what their marketing campaign will look like, don't know how they will get investment, don't know what their customers will be like. they don't even know if their idea is great or shit.i call these \"interesting people\"they are clever, passionate, willing to listen, willing to work hard ... and sometimes, only sometimes, they succeed.",
    "children": [
      {
        "author": "danieltillett",
        "text": "Franze what do you do for startups? Sounds interesting.",
        "children": [
          {
            "author": "dest",
            "text": "you could check the links in his/her HN profile",
            "children": [
              {
                "author": "pc86",
                "text": "His",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "d--b",
        "text": "Here though it is clear that they were in the second category. They said they pivoted several times, changed their customer targets, tried many things and it didn't work out. It's not like they started with a \"know-it-all\" attitude, it's just that they tried, failed, iterated and failed again until they could not do it anymore. I say congrats for trying.",
        "children": [
          {
            "author": "jnbiche",
            "text": "> It's not like they started with a \"know-it-all\" attitude,Well, they hired a (presumably competent) web design firm and then told them to implement a truly horrific site wireframe design, replete with a font in the same family as comic sans. It takes a certain amount of hubris - or ignorance - to think you can design an effective, attractive website for a growing business (and in the fashion industry, to boot!) with zero training or background in web development or graphic design.",
            "children": [
              {
                "author": "czbond",
                "text": "To be fair, i am guessing the design was in 2009'ish, when they started, rather than in the last few years.",
                "children": [
                  {
                    "author": "yaakovkarda",
                    "text": "Wireframes we drawn were meant to be a design guide, they never made it to production of course ;—)",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "kaizendad",
        "text": "I used to do 1h free with startups (free for them only, the government paid me), and I echo your impression of \"perfect start-ups\" (which is a better name than I ever thought of). For whatever reason, I only saw the perfect start-ups when they were hurtling towards launch; then they'd come to me and ask a question like \"how do I sell my product?\" or \"I've mortgaged my house, when will I start to be able to make payments from my company?\" Those were always sad.I loved the \"interesting people\" -- they still had time to do something useful. Before you launch a startup, you have unlimited time (it's rarely true that you must be the first entrant in a market to succeed, so time is on your side). I would always tell them to do a \"feasibility analysis\" -- a long document in which you:\n1. Clearly state what it is your company does\n2. Clearly state who your customer is\n3. Clearly state why they will value you\n4. Are specific about what you're assuming about your customer, competition, wider economy, etc., that will drive you to success\n5. Validate that your customer exists and shares your perception of what value is\n6. Validate that all of your assumptions are trueThese usually took about 3 months of part-time work for the entrepreneur to complete, and, if they had a feasible start-up, they usually had customers in hand by the end of the process. If it wasn't a feasible start-up, they had the chance to pivot or just walk away, before spending any real money or real time.I love the idea of Getwear, and I really love the frank discussion of their failure. I'm sad that everything Yaakov writes probably could've been determined in a feasibility analysis.",
        "children": []
      }
    ]
  },
  {
    "author": "aioprisan",
    "text": "They have their VK vs Facebook numbers completely wrong: “Russia’s mighty Facebook rival, VK — which has more than twice as many total users and probably many times more active users — didn’t work for us. It seems that folks there are too preoccupied with cats and funny images to bother about custom jeans.”\nFacebook has 1.55 billion monthly active users, not the 24 million claimed there – even with 2014 numbers, Facebook went over 1 billion monthly active users in 2012. (http://www.statista.com/statistics/264810/number-of-monthly-... http://newsroom.fb.com/company-info/).",
    "children": [
      {
        "author": "skav",
        "text": "The article numbers are obviously only for Russia.",
        "children": []
      }
    ]
  },
  {
    "author": "d--b",
    "text": "I see all these comments saying it was a bad idea in the first place. That is quite not true. The market for custom jeans is simply overcrowded! I mean why wasn't getwear on this article at all: http://www.wsj.com/articles/SB100014240527487038050045756065...I think that - as the article points out - the execution wasn't great for a number of reason, but don't blame the idea.",
    "children": [
      {
        "author": "rgbrenner",
        "text": "if anything.. that's confirmation they're right. 2 of the 3 custom jean makers in that article are gone:here's a blank page for one:\nhttp://thimbler.com/And indiedenim is now Indie Internet Marketers:\nhttp://www.indidenim.com/The 4th mentioned in the article was a site that ranked premade jeans from major manufacturers based on a questionaire.. so i'm not counting that one.",
        "children": [
          {
            "author": "magic_beans",
            "text": "Whoaaaa... Indie Denim's website is HORRIBLE.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "butwhy",
    "text": "$100k and a year to launch something?",
    "children": []
  },
  {
    "author": "known",
    "text": "\"The reasonable man adapts himself to the world; the unreasonable one persists in trying to adapt the world to himself. Therefore all progress depends on the unreasonable man.\" --George Bernard Shaw",
    "children": []
  },
  {
    "author": "austenallred",
    "text": "We are trying an experiment with the a new product my company is launching.We started out by writing down all of our assumptions, of which there are many. I'm not sure you can ever build any product or service without them, no can you successfully \"validate\" all of them (people's actions don't always line up with their words).It's actually really refreshing to be able to look and see, \"OK, there's all of the stuff that we don't really know, and our job is to invalidate any lore in there as quickly as possible.\"",
    "children": []
  },
  {
    "author": "squozzer",
    "text": "After all that, the idea still has merit, but as the author pointed out, jeans (and clothing in general) are rather tricky products.I recently purchased a sofa from a site that used a similar tack - though in hindsight it had a more limited set of options than a typical furniture store. But that's still OK, at least I didn't have to make chatter with a furniture sales rep - who aren't bad people, I'm just not very social.",
    "children": []
  },
  {
    "author": "travelhead",
    "text": "As a die hard tester, my first question would be, \"what price points did you test?\"$299, $399, $499?For example, you said you have a 0.6% conversion rate and $99 price point point. Perhaps your conversion rate at $499 would drop to 0.3% but even so you just dramatically increased your profitOften times mispricing (either too high or too low) is why startups fail.",
    "children": [
      {
        "author": "yaakovkarda",
        "text": "We started with $150, as far as I can remeber than went down. The higher the price, the more important is the brand component OR bespoke experience in the luxury offline environment. We did work with ateliers that sold our jeans for $300, but a) the volume was still low and b) we were only getting our $99 out of the each pair. Besides, when you go for real bespoke, people tend to be much more picky → more returns and alterations as a result.",
        "children": []
      }
    ]
  },
  {
    "author": "agentgt",
    "text": "A couple of things I don't like about clothing startups is that they don't go after my demographic that has a problem, the cost of the products are way too high and they have an assumption that people have fashion sense.For example my problem is that I have not-so-lovely male gyno and I produce sweat stains on my T-shirts at a particularly high rate (such that when I find a shirt that fits and looks right its ruined in a couple of months). Thus I like the idea of customizing a piece of clothing but I just can't see how you could make it cost effective given I want to use different materials and cuts. Not to mention I want you to pick a good fashion for my body type.If the company went after a particular niche.. like shirts for ugly dudes to make ugly dudes look better instead of rich good looking young hipsters.. I might be interested :)",
    "children": [
      {
        "author": "danieltillett",
        "text": "I have always been fascinated why fashion labels make equal numbers of each size (XS, S, M, L, XL) when this does not fit the distrubution of sizes of the population. It is even worse with pants where 36\" & 38\" sell out instantly, but there is always a 24\" in the sale bin.",
        "children": []
      },
      {
        "author": "surrender",
        "text": "Have you considered Sweat Block? It's a wipe you apply to your underarms and it lasts for up to a week in blocking your sweat.",
        "children": []
      }
    ]
  },
  {
    "author": "pacaro",
    "text": "I use buildyourownjeans.com for this.They are somewhat spammy, quality control is dodgy (I've gotten a zipper when I ordered buttons), the website is a joke, but...The price is right ~$75They offer things I cant easily get elsewhere that matter to me, 14oz fabric, raw denim, and customized cut",
    "children": []
  },
  {
    "author": "manigandham",
    "text": "This idea is not revolutionary and already has plenty of market research. A single day talking to people who work in fashion/apparel/denim industry would've told them this was not viable.",
    "children": []
  }
]