[
  {
    "author": "zmanian",
    "text": "Support Tor's first donation campaign.Become a crowdfunder.https://blog.torproject.org/blog/our-first-real-donations-ca...",
    "children": [
      {
        "author": "yeukhon",
        "text": "Why does Tor need a director? If it is truly a decentralized network, why should the project require centralized project administrators? Because of funding and donation? Let's put the whole spread the initiative PR stuff away (of course that cost money), plus the hosting cost, what else do they use the donation for?",
        "children": [
          {
            "author": "zmanian",
            "text": "They use the funding to pay the developer who develop the Tor software/daemon and the engineering effort there is extraordinary.Thousands of volunteers provide the network capacity that makes the daemon useful.",
            "children": [
              {
                "author": "yeukhon",
                "text": "Thank you for the info. This is helpful to know.[edit] Have you folks looked at https://gratipay.com/search as another source of crowdfunding for developers? I am not sure which one is more effective for general funding.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "tacojuan",
        "text": "I can't believe they're using PayPal of all things...",
        "children": [
          {
            "author": "zmanian",
            "text": "Agree, lutz.But EFF and Freedom of Press also use Paypal and they have a nice interface for monitoring recurring contributions.",
            "children": []
          },
          {
            "author": "middleclick",
            "text": "I agree but I think the problem is the lack of an alternative in the space. PayPal works across countries.You can even send in cash...",
            "children": []
          },
          {
            "author": "EthanHeilman",
            "text": "You can play via bitcoins if that is your thing:https://www.torproject.org/donate/donate-options.html.en",
            "children": []
          },
          {
            "author": "tonyedgecombe",
            "text": "Some of us like PayPal.",
            "children": []
          },
          {
            "author": "kbart",
            "text": "What are the alternatives that work well internationally? Only Bitcoin comes to my mind, but it's a mess to buy, conversation rates fluctuate wildly and is far from easy to use.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "anonymous4",
    "text": "Useless web site.  Can anybody please post the text of the article so that it is readable??",
    "children": [
      {
        "author": "Estragon",
        "text": "Yes, it's absolutely horrendous on mobile.  On my laptop it's fine.",
        "children": []
      },
      {
        "author": "j_s",
        "text": "http://pastebin.com/6938UxS0TL;DR (2014):Feb: Understaffed Tor minimized security warning. \"Activity in the past has looked suspicious at the time, but ultimately did stuff that helped advance our art.\"May: CMU researchers announce breaking Tor, ignoring potential ethical violations. Blackhat talk cancelled; CMU & FBI begin 'not the droids you're looking for' responses.Jul: Emergency fix to Tor to block CMU vulnerability. CMU researchers stop corresponding with Tor project.Nov: FBI crackdown",
        "children": []
      }
    ]
  },
  {
    "author": "zaroth",
    "text": "So who is going to get the billing record for all those hosts they spun up? Hard proof should not be that hard to come by, so I'm just waiting to see that. I am more likely to believe Tor than CMU because of the way the research was pulled, and it would be nice to pin them to it.",
    "children": []
  },
  {
    "author": "rasz_pl",
    "text": "TLDR: CIA funded people angry at FBI funded people for breaking their toys. CIA funded people react only after being deanonymized __personally__.",
    "children": [
      {
        "author": "iamsohungry",
        "text": "Do you have a source on Tor being funded by the CIA?It's disingenuous to say that Tor reacted only after being deanonymized personally:1. It was well known that Nick Mathewson worked for Tor long before this attack.2. Tor added code that allowed them to detect the attack before they knew their IPs were deanonymized: that's the only way they found out their IPs were deanonymized.",
        "children": []
      }
    ]
  }
]