[
  {
    "author": "larsberg",
    "text": "The killer feature in this week's newsletter is an image of using Servo itself to post this link to HN :-)",
    "children": [
      {
        "author": "bttf",
        "text": "I can appreciate the honesty of that video.",
        "children": [
          {
            "author": "aravindet",
            "text": "Haha. Maybe related: https://github.com/servo/servo/issues/4378",
            "children": [
              {
                "author": "JupiterMoon",
                "text": "I wonder if anyone has thought of including screencasting in bug reporting for bugs in guis?",
                "children": [
                  {
                    "author": "bjz_",
                    "text": "We used to use LICEcap at my old work for that.",
                    "children": [
                      {
                        "author": "Rexxar",
                        "text": "Wonderful, you just make aware of the software that do exactly what I need today :-)",
                        "children": [
                          {
                            "author": "enimodas",
                            "text": "There's also https://github.com/thetarkus/WebMCam which records in a more modern format than gif.",
                            "children": [
                              {
                                "author": "xena",
                                "text": "On Windows only.",
                                "children": []
                              },
                              {
                                "author": "Rexxar",
                                "text": "Looks potentially better but I experience lots of crash/freeze",
                                "children": []
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "author": "nickysielicki",
                    "text": "For anyone wondering how to do this on linux, I use recordmydesktop and ffmpeg to make small webms (~2mb). Highly recommend it.    `recordmydesktop --windowid $(xwininfo)`\n\n and click the window you want to record. \n\n    `ffmpeg -i out.ogv -o final.webm` \n\nand you're done! recordmydesktop is available in most distros afaik.",
                    "children": [
                      {
                        "author": "masklinn",
                        "text": "And for anyone wondering how to do this on OSX, QuickTime Player v10 (né QuickTime X) File > New Screen Recording > click big red button > select display section > Start Recording",
                        "children": []
                      },
                      {
                        "author": "Manishearth",
                        "text": "I used kazam to make this (and ffmpeg/convert to make it into a gif). But yeah, recordmydesktop works too.Though it has a small bug where, when recording a single window, the mouse position isn't shown correctly in the final video. (Instead of showing where the mouse was relative to the window, it takes the absolute position of the mouse and scales it down to the window size)",
                        "children": []
                      },
                      {
                        "author": "FreeFull",
                        "text": "How come passing $(xwininfo) works? xwininfo outputs a lot more than just the window ID",
                        "children": [
                          {
                            "author": "nickysielicki",
                            "text": "I don't know why I said that it would. It doesn't.This works, though:    recordmydesktop --windowid $(xwininfo | grep 'Window id' | cut -d' ' -f4)\n\nthough its worth noting that it theoretically could detect that its being redirected and only output the window id",
                            "children": []
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "author": "snaily",
                    "text": "https://lookback.io lets you do that on mobile. The neatest implementations have it show up if the user shakes the phone.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "author": "perlgeek",
            "text": "This bug (input field doesn't scroll automatically, but spills its text into the surrounding elements) is a good demonstration of just how many, many small details you have take care of when implementing a browser engine.A really monumental task. The servo devs have my respect!",
            "children": [
              {
                "author": "oneeyedpigeon",
                "text": "Maybe I'm missing something hugely obvious, but shouldn't the input field be rendered using a native control which would preemptively eliminate that bug and reduce the need for rewriting code that's been written countless times before?",
                "children": [
                  {
                    "author": "dumbmatter",
                    "text": "There's probably many reasons, but one is that native controls don't support everything in CSS.",
                    "children": []
                  },
                  {
                    "author": "Manishearth",
                    "text": "dumbmatter is correct, we can't arbitrarily style things via CSS with native controls.Eventually we do want them to look more like the controls on the platform they're running on, though.",
                    "children": []
                  },
                  {
                    "author": "pcwalton",
                    "text": "> shouldn't the input field be rendered using a native control which would preemptively eliminate that bug and reduce the need for rewriting code that's been written countless times before?Broadly speaking, native controls don't like being composited into OpenGL scenes (which are necessary for things like 3D transforms).",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "freebullets",
        "text": "Saved into dead animation format, GIF. :(",
        "children": []
      }
    ]
  },
  {
    "author": "thwd",
    "text": "You mentioned the URL-parsing macro twice.Congrats to the whole team!",
    "children": []
  },
  {
    "author": "pcwalton",
    "text": "(Copying my comment here from Reddit /r/rust:)Just to repeat, because this was somewhat buried in the article: Servo is now a multiprocess browser, using the gaol crate for sandboxing. This adds (a) an extra layer of defense against remote code execution vulnerabilities beyond that which the Rust safety features provide; (b) a safety net in case Servo code is tricked into performing insecure actions.There are still plenty of bugs to shake out, but this is a major milestone in the project.",
    "children": []
  }
]