{
  "title": "Lessons Learned After Shutting My Startup, Following a Six-Year Struggle",
  "summary": "Yaakov Karda, founder of Getwear (a custom jeans startup), chronicles the company's six-year journey from 2009 to 2015. The startup was built on five unvalidated assumptions: that people wanted unique jeans, wanted to design their own clothes, would customize repeatedly, would share designs on social media for commission, and that sharing would drive viral growth. After raising capital and spending $100K on web development, they launched with a custom-coded site but failed to achieve meaningful market traction. The discussion thread features 60 comments debating whether the idea itself was flawed or if execution issues were to blame.",
  "what_happened": "The market for custom jeans and online clothing customization never materialized as a mass-market opportunity. While Getwear itself shut down in January 2015, the broader landscape shows that consumer co-creation in clothing remains a niche at best. Levi's Original Spin (shut down 2004) and other attempts (INDi Custom Denim, OriJeans, Tribe Jeans) all failed. However, the made-to-measure clothing market has experienced modest growth by 2024-2025, but it targets specific niches (workwear, luxury, sustainability-conscious consumers) rather than general mass-market consumers who want to design their own clothes. The market is projected to reach $124.55 billion by 2033 with a CAGR of 9.56%, but this represents a fundamentally different business model than what Getwear attempted—made-to-measure (tailored to fit) rather than custom-designed (user creates the look). Online platforms like Hockerty, Sumissura, and Made to Order Jeans exist but remain niche players. The core insight from Getwear's failure proved correct: people don't actually want to design their own jeans; they want jeans that fit well and come from established brands.",
  "most_prescient": {
    "user": "kaizendad",
    "reason": "Perfectly diagnosed that the entire failure could have been prevented with proper customer validation. This person explicitly stated 'I'm sad that everything Yaakov writes probably could've been determined in a feasibility analysis,' identifying the root cause (skipped validation, too many unvalidated assumptions) and predicting the outcome before the outcome was even written. They also noted that 'perfect start-ups fail. always.' The comment demonstrated deep understanding of startup mechanics and validation methodology."
  },
  "most_wrong": {
    "user": "d--b",
    "reason": "Defended the core idea by claiming 'the market for custom jeans is simply overcrowded' and linking a 2015 WSJ article as proof that the market existed. This misdiagnosed the problem: there was no viable market, not merely a crowded one. Ten years later, the custom jeans market remains non-existent at scale. The comment confused the existence of competitors attempting the same business with the existence of actual customer demand. This framing suggested the idea was sound but just needed better execution—precisely wrong."
  },
  "notable_aspects": "1) The author explicitly noted that 'none of us had ever tried to order custom jeans ourselves' should have been a red flag—the classic founder-market fit problem. 2) Multiple commenters correctly identified that jeans are a poor product for customization because fit is paramount and people buy them infrequently. 3) The Russian market pivot was particularly notable: they found initial success with Russian audiences (via Artemy Lebedev's blog) but abandoned it when macroeconomic collapse (Crimea annexation, currency collapse in 2014) made jeans twice as expensive overnight. 4) Several commenters suggested the idea might have worked for niche applications (corporate branding, celebrity collaborations) but the founders never pivoted in those directions. 5) The article references buildyourownjeans.com (mentioned by commenter 'pacaro') which still exists and operates with low prices (~$75) and low-quality branding but survives through authenticity rather than trying to be a consumer-facing brand.",
  "grades": {
    "kaizendad": {
      "grade": "A+",
      "rationale": "Articulated the most insightful diagnosis: proper validation would have prevented all the losses. Demonstrated deep understanding of startup methodology, identified the failure mode correctly, and explained what should have been done. Their comment proved prescient."
    },
    "danieltillett": {
      "grade": "A",
      "rationale": "Correctly identified that people don't want to design their own clothes, only want clothes that make them look good. Noted no successful online custom jeans business existed (correct in 2015, still true in 2026). Showed sophisticated understanding of fashion market dynamics and the fundamental flaw in the business model."
    },
    "franze": {
      "grade": "A-",
      "rationale": "Distinguished between 'perfect start-ups' (know everything in advance, fail) and 'interesting people' (willing to learn, sometimes succeed). Applied this framework helpfully to Getwear. While the categorization was insightful, it somewhat excused the founders' core error of not validating the basic premise before committing resources."
    },
    "jnbiche": {
      "grade": "B+",
      "rationale": "Pointed out that the founders showed hubris in designing a terrible website wireframe (similar to comic sans fonts) without training, despite being in the fashion industry. Valid criticism of the execution, though underestimated how fundamental the problem was (not just design, but the entire premise)."
    },
    "pacaro": {
      "grade": "B",
      "rationale": "Provided practical information about buildyourownjeans.com as evidence that a market existed, but at a different price point ($75 vs Getwear's $99+) and without brand ambitions. Their existence proves people will buy pre-customized options at low price, not that they want to design from scratch."
    },
    "d--b": {
      "grade": "D",
      "rationale": "Misdiagnosed the issue as 'overcrowded market' rather than non-existent demand. Suggested the idea was fine but needed better execution. Ten years of evidence shows the core idea was fundamentally flawed—there is no thriving consumer custom jeans market in 2026."
    },
    "x1024": {
      "grade": "C+",
      "rationale": "Correctly criticized the $100K MVP as excessive and identified the lack of skills/experience. However, was somewhat harsh without understanding that physical product manufacturing adds costs. The fundamental criticism was right (validate first) but the execution comment was oversimplified."
    },
    "underwater": {
      "grade": "B-",
      "rationale": "Noted that buying pants without trying them on is problematic, suggesting hoodies and shirts might be easier. This shows good intuition about the product-market fit problem (fit is crucial for pants) but didn't connect it to the deeper insight that people don't want to design clothes at all."
    }
  },
  "score": 8
}