[
  {
    "author": "ktamura",
    "text": "In 2007, I was just graduating from Stanford and vividly remember how my classmates perceived Facebook: they pretty much echoed Swisher's sentiment in the article. With the exception of a couple of really smart folks who wanted to \"own\" a significant part of yet-to-be-built Facebook, the most accomplished CS grads were joining Google in droves (Google was hot and on a hiring binge). Problems are Google seemed grander and more challenging and less toy-ish.Microsoft was another popular destination at Stanford at the time. If Facebook was toy-ish and Google was cool, Microsoft was \"respected\". Many deemed Microsoft to be the McKinsey of tech: spend a couple of years there, build their resume and join or start a start-up. I even knew someone who took a job at Yahoo! over one at Facebook (Needless to say, most everyone who had offers from either Google or Microsoft chose them over Facebook).Hindsight is 20/20 =)",
    "children": [
      {
        "author": "dboreham",
        "text": "In 2007 (purely by chance, I had followed the VPEng from the previous company) I was working on a Facebook application at a startup. In contrast to your experience, I recall being impressed by the quality of their engineering, rapidity with which bugs were fixed, their approach to developer support and rate at which the service scaled and added features. We were dealing with all the major \"social\" platforms as application developers at the time (MySpace, FB, Google, Hi5, Bebo). Facebook were by far the most impressive. Ever since I've chuckled when I hear about how Facebook is a toy and Zuck can't code...",
        "children": []
      },
      {
        "author": "colmvp",
        "text": "Someone once told me that he joined Facebook before it surpassed MySpace. Had he stayed and waited for his stocks to vest, he would make serious bank. Like, life changing amount of money. Instead, he joined another company before any of it vested and well...Hindsight is 20/20 but missing out on that would haunt me.",
        "children": [
          {
            "author": "meric",
            "text": "Every other day there's a stock somewhere around the world going up 1000%, because of a miraculous biomedical or geological discovery, or invention, and life changing amounts of money could be missed by not borrowing a personal loan from the bank and putting it all on that stock. If someone had the foresight to know what was going to happen, they would make bank, and occasionally someone did.Everyday we're missing out.If your friend stayed and Facebook had fallen through and your friend missed three pay checks it would haunt him against working at startups too...",
            "children": [
              {
                "author": "greyman",
                "text": "> life changing amounts of money could be missed by not borrowing a personal loan from the bank and putting it all on that stockBut this is different from already being employed at that company and not seeing the potential.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "pbreit",
        "text": "A lot of folks have pretty good foresight, too.",
        "children": []
      },
      {
        "author": "anonu",
        "text": "In 2005 I was just graduating from CMU. I remember when Facebook came to campus. They picked a large lecture hall to pitch their job openings. I want to say Facebook was way less than 100 employees at the time. In the lecture hall (which probably sat 100) there were about 20 people. I already had a nice full-time offer lined up - and remember thinking - why would I ever want to work for a company whose users \"poke\" other users. What value is there in that? #doh",
        "children": []
      }
    ]
  },
  {
    "author": "paul",
    "text": "I love reading these old articles. Here's another fun one: https://news.ycombinator.com/item?id=1719975",
    "children": [
      {
        "author": "misiti3780",
        "text": "that was a good one - at some point in that thread someone bet him 10K he was wrong - and offered to put the money in escrow - i wonder if it ever happened",
        "children": [
          {
            "author": "Steko",
            "text": "it would have ended 2 months ago.",
            "children": []
          }
        ]
      },
      {
        "author": "chintan",
        "text": "Wonder if this bet was executed between dhh and harryh after the FB IPO - https://news.ycombinator.com/item?id=1720352",
        "children": []
      }
    ]
  },
  {
    "author": "djsumdog",
    "text": "I remember telling people only a few years ago that I felt Facebook was over-valued.It's made it's way to the top, and that still bothers me. The lack of decent federated social networking protocols has left the world in the hands of mega-sites.",
    "children": [
      {
        "author": "Kinnard",
        "text": "What's an example of a half decent federated social networking protocol? Basically, I don't know what you mean . . .",
        "children": [
          {
            "author": "AndrewKemendo",
            "text": "There isn't one because it doesn't make sense. As facebook has proven, people generally want one place that gives them the stuff they indicate they want to see. A federated system means more work for the average person.I think federated systems generally (even governmental) aren't sustainable because they require too much effort from individual users for them to remain good - so they trend toward single or few \"owners.\"",
            "children": [
              {
                "author": "EGreg",
                "text": "How about Wordpress? Powers 20% of websites.",
                "children": [
                  {
                    "author": "jsnathan",
                    "text": "It might power 20% of all domains, but that doesn't equate to 20% of mindshare. Individual Facebook pages should be counted individually in this context.Wordpress also is not really a federated system, because the individual sites are not interconnected.",
                    "children": [
                      {
                        "author": "colechristensen",
                        "text": "I want to be very snarky with an unnecessary description of a hyperlink... another day.Wordpress sites _are_ to a degree a federated protocol beyond hypertext:\nhttps://make.wordpress.org/support/user-manual/building-your...",
                        "children": []
                      },
                      {
                        "author": "zkhalique",
                        "text": "What would it require to make it a federated system? And interconnected?",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "author": "Kinnard",
                "text": "So what do you think is gonna happen to the United States? Do you have examples? Additionally what do you think explains this phenomenon? I'm not sure I buy the to much work for individuals argument.",
                "children": [
                  {
                    "author": "AndrewKemendo",
                    "text": "So what do you think is gonna happen to the United States?I have no idea, but the idea of true hardcore federalism ended with the Civil War - for good reason in that case as you can't truly have it if there is an arbiter that can always trump the state if it sees fit. NAFTA, TPP have just eroded independence further.I'm not saying it's good or bad, it's just what people want.Nothing is really done by individuals, rather small high effort groups typically are the ones that make things happen. Even within those, you have a handful of powerful people and the rest are largely there for the ride. This is the whole idea behind \"key influencers\" and \"network effects.\" Get enough of the big people on board and the rest just follow - it's literally the same in every facet of life.If some form of the Jeffersonian proposal, that every citizen should have a self sustainable farm and gun, is what is necessary for sustainable, free society, Then you can wave that dream goodbye.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "author": "mjevans",
            "text": "To prevent abuse it would pretty much have to be pull based.  Your area would be a website you own and control, which would have a process that on some activation polled feeds from your friends and aggregated it together for your use.  Your friends might be able to hit your wall and see you do that for others; you'd control what you shared via that action.The reason that will not happen is because the average user doesn't understand their privacy, can't easily get a location they own setup like that, and doesn't exist within a web of trust (which you could roll out with this via a public key system).Maybe those problems will be solved someday when server time is so cheep that it's a shock if someone doesn't own a VM which the law would treat similarly to an apartment.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "sjg007",
    "text": "In fact it was allthingsD that failed in 2013.  This type of news is just hyperbole... The media companies strive on conflict and will create it to get eyeballs.  Now that's a Ponzi scheme.",
    "children": [
      {
        "author": "Scoundreller",
        "text": "I recently tried to go to their site. It auto-corrected to allthongsd.com, which thankfully is still unregistered ;)",
        "children": []
      }
    ]
  },
  {
    "author": "knughit",
    "text": "Ah, 2007, when casually mocking nerds was still cool, before they became the new billionaire class. How quickly pundits forget how they were bullies.",
    "children": []
  },
  {
    "author": "EGreg",
    "text": "I joined Facebook back in 2005 or 2006 I think. Was in the first million people. I remember thinking in 2006 what I will record for YouTube. But that was too much hassle. In 2008 the F8 conference the Platform was launched and I was hooked. Then in 2008 the iPhone came out and the newly formed Andreessen Horowitz offered money to anyone with an app. Remember those days?",
    "children": []
  },
  {
    "author": "draw_down",
    "text": "It's the easiest thing in the world to shake your head and laugh at \"crazy\" valuations. It's incredibly tired at this point, maybe it was less so in 2007, but it's not an interesting activity in my opinion. And of course there's never any pressure to walk any of it back, this is the Internet, down the memory hole it goes.Talking about the structural reasons for the crazy valuations may be slightly more stimulating.",
    "children": []
  },
  {
    "author": "golergka",
    "text": "Hindsight is 20/20. I vividly remember how surprised I was when Yurii Milner's DST invested in it on then-giant valuation; I just thought that Facebook has run out of local fools and had to find a sucker from across the ocean.The magnitude of my stupidity at that moment is something I never want to forget.",
    "children": [
      {
        "author": "jonmc12",
        "text": "Pretty amazing, DST's $200M @ $10B valuation came 20 months after the AllThingsD article.  From http://techcrunch.com/2009/05/26/mark-zuckerberg-and-yuri-mi... - 'just doing our math':\"MA: You’re comfortable with the $10B valuation?YM: Absolutely. And, you know, I can repeat the reasons why. Basically, I think they have a very unique perspective on social network monetization, that other investors don’t necessarily see. You see how social networks have been monetized in our part of the world, and we’re just doing our math and coming up with numbers that we feel very comfortable with going forward. We don’t really value this business on (fee?) basis 2009 but rather on a longer term, based again on our experience, and we’re very confident that, you know, those numbers can be achieved.\"",
        "children": []
      },
      {
        "author": "Grainy1",
        "text": "...and Kim Kardashian has more followers on Twitter than Bill Gates and all the Presidential Candidates from both sides of the aisle put together.So what? What does that say about society or the exec\\brands that prop her up? There is no dearth of misguided smart people in the world doing dumb shit.Facebook was stupid in 2007. Imho it is stupid today. People worry about AI causing unpredictable damage to society. I worry about Facebook doing it much before AI does.It is a social experiment that should have been run inside the safe confines of a social science lab. Running social experiments on the real world, at this scale just because the tech makes it possible, and advertisers fund it is like watching the plot of Jurassic Park play out.Maybe a quote from there is apt - \"Isn't it amazing? In the information society, nobody thinks. We expected to banish paper, but we actually banished thought.\"Kara Swisher's advice still stands.",
        "children": [
          {
            "author": "golergka",
            "text": "Whether it's stupid or not is irrelevant. People don't give their money to funds to do intellectual things with it. People (including you and me) give their money to funds to turn a profit.DST's investment in Facebook turned out a great profit. The general rant about the \"state of society\" and Kim Kardashian is kinda irrelevant to this conversation.",
            "children": []
          },
          {
            "author": "manibatra",
            "text": "Recently read the book \"SuperIntelligence\" and found it fascinating as it delves into how AI could be catastrophic and what measures we could take to avoid that scenario. Could you give some examples as to how Facebook could do it much before AI? Can it be of the same degree of severity as potential damage that AI could lead to ?",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "author": "jondubois",
    "text": "I'm going to withhold my judgment on the matter until after the next market crash.\nI think it's impossible to judge the value of anything in this messed up 0%-interest economy.\nCrazy money is going around and inflating not just valuations, but revenue, profit margins, etc.Everyone is looking at Price/Earnings (P/E) ratios (which are currently quite bad, but not horrible) and are completely ignoring the fact that earnings themselves might be inflated by\nthe low interest environment. Maybe if interest rates were higher, companies wouldn't spend anywhere near as much on Facebook advertising.With that said, I think the current economic environment is more like 'froth' than a 'bubble'.\nA bubble can only get so big before it pops - Froth can keep building up to a considerable volume before it starts to deflate.Economy is a bit like ecology - If you raise the temperature (interest rates) by 5 degrees (5%), you could end up wiping out many species (companies) because of their complex interdependencies.",
    "children": [
      {
        "author": "bobm_kite9",
        "text": "I agree with this, but for one thing.  What makes you think interest rates will rise?Governments set interest rates to combat inflation, caused by wage or price increase.  However, we've had 0 rates for 7 years, and QE to combat deflation.If you believe (as I do) that the value of the worker is decreasing with time (due to substitutability with technology), it kind of stands to reason that we're not going to see much wage inflation anymore.. doesn't it?Or, is there another kind of inflation I haven't considered?",
        "children": [
          {
            "author": "jondubois",
            "text": "I think the economic value of people overall will decrease (a lot will lose their jobs) but the value of workers (increasingly specialized ones which cannot be replaced by machines) will keep increasing (until they too become replaceable).I think the value of all physical assets will decrease dramatically (due to constant increases in economic productivity). So in effect, those who manage to hold on to their jobs for the longest will be able to accumulate the most wealth in the end....Then in an effort to optimize energy consumption, machines will genetically engineer us to require fewer and fewer resources. Until we become amoeba.",
            "children": [
              {
                "author": "bobm_kite9",
                "text": "Yeah I think I basically agree.  I'm not sure about physical assets though.  The way to price those is to PV the future cash flows.  However, if interest rates are zero, PVs are infinite.. so we need a different approach.  Or, if we continue to use PV, then as rates get lower, physical assets increase in price.But yeah, I'm pretty sure the amoeba will have zero-rates.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "author": "anonu",
        "text": "I agree with this. You also have to realize that people attach a massive growth rate to FB - and this is partly what wall street prices in. There are 7bn people on this planet and at least 1/7th of them are \"active\" FB users. That's unparalleled. And that trend will continue. That is why you can't really apply relative comps/fundamentals to this company.On a personal note, I have to admit spending a little more time on both FB and FB mobile recently. The experience has really improved tremendously: delivering interesting content, connecting me to the restaurant or bar I am currently sitting, composing my pictures by \"Moment\". The FB force is undeniable. Another anecdote I like to think about is video views for the same video between YouTube and FB. FB simply crushes it with the number of eyeballs....",
        "children": []
      }
    ]
  }
]