{
  "title": "15B More Reasons to Worry About Facebook (2007)",
  "summary": "In September 2007, journalist Kara Swisher published a scathing critique of Facebook's rumored $15 billion valuation, calling it 'delusional' and comparing the company to a failing AOL/Yahoo. Swisher argued Facebook was not comparable to Google despite their revenues coming primarily from Microsoft's sweetheart deal. The article sparked a lively HN discussion where commenters shared personal anecdotes about dismissing Facebook job offers in favor of Google and Microsoft, revealing the skepticism around Facebook's long-term prospects at the time.",
  "what_happened": "Facebook went on to become one of the most valuable companies in the world. The company went public on May 18, 2012 at $38 per share with a $104 billion valuation. By 2024-2025, Meta (Facebook's parent company) reached a market capitalization of $1.665 trillion, making it the world's 7th most valuable company. Swisher's $15 billion valuation—once considered absurdly high—proved to be a bargain. Facebook successfully monetized its platform through advertising, grew to nearly 3 billion users globally, and expanded into mobile, video, and other high-growth areas. The company achieved exactly what skeptics said was impossible: sustained growth and profitability at massive scale.",
  "most_prescient": {
    "user": "dboreham",
    "reason": "While most commenters dismissed Facebook as a 'toy,' dboreham correctly identified that Facebook had superior engineering quality, rapid bug fixes, excellent developer support, and impressive scaling capabilities compared to competitors like MySpace. This was the most important factor in Facebook's eventual dominance—not sentiment or user affection, but technical execution. The comment presaged Facebook's ability to scale and innovate under pressure."
  },
  "most_wrong": {
    "user": "anonu",
    "reason": "Dismissed Facebook's poking feature as valueless, turning down a job offer at a <100 person company in 2005 because 'why would I ever want to work for a company whose users poke other users. What value is there in that?' This represents the quintessential 'I missed it' moment—a CMU grad rejecting employment at what would become one of history's greatest wealth creators based on a shallow dismissal of product features without understanding network effects or long-term potential."
  },
  "notable_aspects": "Several meta-observations make this retrospective particularly interesting: (1) The article references Peter Thiel's initial $500K investment in 2004, which eventually turned into billions—early Thiel backers got the bet right despite public ridicule; (2) Multiple commenters lament missing early Facebook employment opportunities, with one noting a friend who could have made 'life changing' money had they stayed through the IPO; (3) The comments section becomes a time capsule of 2007 hiring preferences—Stanford CS grads choosing Google and Microsoft over Facebook because they seemed more 'prestigious'; (4) One commenter astutely notes that the AllThingsD publication itself failed in 2013, making Swisher's dire warnings ironic—she was wrong about Facebook but her own employer's business model failed; (5) The discussion touches on prescient concerns about federated social networks and centralized platforms that would become more relevant in the 2010s with privacy concerns and monopoly debates.",
  "grades": {
    "ktamura": {
      "grade": "B",
      "rationale": "Accurately captured the hiring ecosystem of 2007—Stanford CS grads genuinely preferred Google and Microsoft to Facebook. However, missed the key insight that this preference would reverse dramatically as Facebook's true value became apparent. Useful historical perspective but no foresight."
    },
    "dboreham": {
      "grade": "A+",
      "rationale": "The only commenter who actually understood what mattered: engineering quality and operational capability. While others obsessed over valuations and user sentiments, dboreham identified Facebook's technical superiority—the actual moat that would drive success. This shows genuine insight rather than hindsight."
    },
    "colmvp": {
      "grade": "C+",
      "rationale": "Acknowledges the missed opportunity but frames it as inevitable with 'hindsight is 20/20.' Shows pattern recognition (early Facebook employment would have been lucrative) but no deeper analysis of why. The comment about 'life changing money' is more wistfulness than insight."
    },
    "anonu": {
      "grade": "F",
      "rationale": "Spectacularly wrong. Rejected Facebook employment based on a dismissive reading of a single feature, missing entirely the network effects and platform potential. This is the classic 'what was I thinking' moment that defines bad judgment at scale."
    },
    "djsumdog": {
      "grade": "D",
      "rationale": "Correctly identified overvaluation concerns but then became equally wrong by 2016, still insisting Facebook was overvalued after it had already proven massive value creation. Raises valid concerns about federated protocols but provides no actionable insight."
    },
    "golergka": {
      "grade": "B-",
      "rationale": "Shows self-awareness about misjudging DST's 2009 $10B investment, calling it for 'sucker' money. However, frames this as stupidity rather than recognizing the legitimate long-term thesis DST was making about monetization potential and user scale. Correct outcome but wrong reasoning."
    },
    "Grainy1": {
      "grade": "D+",
      "rationale": "Makes sweeping moral critiques about Facebook being 'stupid' and comparing it to Jurassic Park experiments. While raising valid societal concerns that became more relevant post-2016, completely misses the financial and technical reality. Moral concerns don't make valuation predictions accurate."
    },
    "jondubois": {
      "grade": "C",
      "rationale": "Thoughtful analysis of low-interest-rate environment inflating valuations, but hedges with 'I'm going to withhold judgment.' Makes interesting points about froth vs. bubbles and the role of interest rates but provides no directional prediction and admits uncertainty."
    },
    "anonu2": {
      "grade": "B+",
      "rationale": "Makes the prescient observation that Facebook's video performance was crushing YouTube and that the 'FB force is undeniable,' correctly identifying mobile growth and feed quality as underappreciated. Recognizes that 7 billion potential users creates unprecedentedly large TAM that traditional comps don't capture."
    }
  },
  "score": 9
}