{
  "title": "Detailing the CMU Tor Hidden Services Attack and Tor's Response",
  "summary": "This November 2015 article discusses the Carnegie Mellon University (CMU) attack on Tor that occurred in early 2014. Researchers had silently attacked Tor's hidden services by running malicious exit nodes and tampering with traffic to deanonymize users. When CMU planned to present their attack at Black Hat 2014, the legal team cancelled the talk. The incident escalated into accusations that the FBI paid CMU $1 million to conduct the attack, which both CMU and the FBI denied. The Tor project later revealed that CMU was subpoenaed by the FBI and court documents confirmed the university's involvement. The discussion centered on Tor's donation campaign announcement and questions about governance, funding, and the ethics of the attack.",
  "what_happened": "The 2014 CMU attack was confirmed to have been conducted by the Software Engineering Institute at Carnegie Mellon. The researchers (Volynkin and McCord) had operated relays and tampered with user traffic to deanonymize Tor users. While CMU and the FBI both denied a $1 million payment, court documents later confirmed that CMU was subpoenaed by law enforcement and information from the attack was used in legal proceedings, including a Silk Road 2.0 prosecution and child exploitation cases. The attack represents one of the most significant security breaches of Tor's hidden services. The incident highlighted the tension between law enforcement and privacy advocates, and demonstrated that Tor's security could be compromised through practical attacks that identified users through traffic analysis rather than theoretical cryptographic breaks. The fallout damaged trust in academic research and raised ethical concerns about university-government collaboration on security research without proper oversight.",
  "most_prescient": {
    "user": "rasz_pl",
    "reason": "Despite the crude phrasing, this commenter correctly identified the core issue: that CIA-affiliated Tor vs FBI-affiliated academic research represented a fundamental conflict of interest, and that the attack was only responded to after Tor developers themselves were deanonymized. This proved prescient—the subsequent revelations showed that law enforcement had indeed weaponized the research without proper oversight or warrants, and the conflict was indeed between different government agencies with different agendas."
  },
  "most_wrong": {
    "user": "zmanian",
    "reason": "The original poster promoted Tor's donation campaign as if everything was normal and trustworthy, without acknowledging the serious security implications of the attack that had just been revealed. The response to yeukhon's reasonable questions about Tor's governance and funding was optimistic about the project's direction, when the article itself detailed a major breach of trust and security failure. This proved wrong-headed in hindsight as the incident showed systemic problems with how Tor handled the attack."
  },
  "notable_aspects": "The discussion reveals several interesting points: (1) The commenters were already skeptical about using PayPal for donations to privacy projects, prescient given later discussions about payment processors and privacy. (2) The thread was fragmented—some discussing governance, others the attack itself—showing confusion about what the actual news was. (3) The pastebin summary by j_s captured the essential timeline in 2014, showing Tor's minimized response evolved as details emerged. (4) The anonymous user found the original article's website unusable on mobile, a meta-commentary on a privacy project having poor web accessibility. (5) The debate about CIA/FBI funding foreshadowed what would become a major point of contention in the privacy community.",
  "grades": {
    "rasz_pl": {
      "grade": "A-",
      "rationale": "Correctly identified the government conflict of interest despite crude presentation. Wrong on the specific claim that Tor only reacted after personal deanonymization, but right about the core problem of competing interests and institutional problems."
    },
    "iamsohungry": {
      "grade": "A",
      "rationale": "Provided factually accurate corrections about Tor's founding (Nick Mathewson's long employment), and correctly explained how Tor detected the attack (through code injection detection, not personal deanonymization). This comment aged very well with subsequent revelations."
    },
    "zmanian": {
      "grade": "C",
      "rationale": "The OP seems well-intentioned but was tone-deaf to the gravity of the situation. The Tor project's initial response was to minimize the attack's significance, which proved wrong. Promoting donations without addressing the security breach showed poor judgment."
    },
    "yeukhon": {
      "grade": "B+",
      "rationale": "Asked legitimate questions about Tor's decentralization and governance that proved surprisingly prescient. The incident itself exposed real questions about how funding and centralized decision-making could compromise a supposedly decentralized project. These concerns turned out to be well-founded."
    },
    "j_s": {
      "grade": "A+",
      "rationale": "Provided the clearest, most accurate summary of events in the thread. The pastebin timeline correctly captured what happened and in what order, and proved durable even as more details emerged."
    },
    "zaroth": {
      "grade": "B",
      "rationale": "Good instinct to want hard evidence of the funding and billing records. This person correctly anticipated that institutional proof would be the key to verification, which later court documents provided."
    },
    "tacojuan": {
      "grade": "B-",
      "rationale": "The concern about PayPal for a privacy project was reasonable but tangential to the main issue. PayPal did prove problematic for Tor's fundraising in the long run, but this wasn't the urgent problem in this moment."
    }
  },
  "score": 8
}